{
  "id": "2025-07-12-hyperliquid-defi-speed-revolution",
  "status": "translated",
  "category": "daily-news",
  "date": "2025-07-12",
  "language": "en-US",
  "title": "When DeFi is no longer satisfied with \"decentralization\": Hyperliquid redefines the rules of the game for transaction speed",
  "content": "Have you ever wondered why DeFi has been criticized for being \"too slow\" and \"too expensive\", but we still insist that it is better than traditional finance? In the past few years, we seem to be trapped in a dilemma: either choose a decentralized but inefficient DEX, or compromise with a fast but centralized CEX. But if I tell you that there is a platform that is completely rewriting the rules of the game, allowing you to enjoy the transaction speed of Binance while maintaining the transparency of the blockchain, would you believe it? DeFi's \"Adolescent Crisis\" Let's first understand the fundamental problem facing DeFi. Traditional decentralized exchanges, such as Uniswap or GMX, are like a very democratic but inefficient committee. Every decision needs to go through a complex voting process to ensure fairness and transparency, but this also means that the speed is slow and the cost is high. Imagine ordering food in a crowded restaurant. A traditional CEX is like an efficient fast food restaurant: you order, pay, and get your food, and the whole process may only take 30 seconds. But a traditional DEX is more like a community kitchen where everyone needs to vote to decide how each dish is made: democratic but slow, transparent but expensive. This is the adolescent crisis of DeFi: we insist on ideals (decentralization), but the reality is very skinny (inefficiency). Most users eventually returned to CEX because no one is willing to wait 10 minutes and pay a $20 fee for a simple transaction. Hyperliquid: DeFi's \"Coming of Age Ceremony\" Then, Hyperliquid appeared, representing DeFi's \"Coming of Age Ceremony\"-a breakthrough from pure idealism to pragmatism. Hyperliquid made a seemingly rebellious but actually smart decision: instead of trying to run on a \"general purpose computer\" like Ethereum, it built its own dedicated blockchain. It's like moving from renting a crowded shared office space to a private office building designed specifically for trading. What does this mean technically? Hyperliquid's architecture is divided into three layers: 1. HyperBFT consensus: This is the underlying \"decision-making mechanism\", which is faster and more specialized than Ethereum's consensus\n2. HyperCore execution layer: Specialized in processing transaction instructions, it can process 200,000 orders per second\n3. HyperEVM smart contract layer: Maintain compatibility with Ethereum, but much faster This architecture allows Hyperliquid to achieve a seemingly impossible goal: 0.2 seconds of transaction delay while maintaining complete on-chain transparency. Every transaction, every order withdrawal, and every liquidation is recorded on the blockchain and can be verified by anyone. Market \"vote\": Numbers don't lie The theory sounds good, but the market's reaction is more convincing. In 2024, we witnessed an amazing power shift in the derivatives DEX space: The decline of dYdX: From 73% market share at the beginning of 2024, it dropped sharply to 7% at the end of the year. This once dominant player lost momentum in the process of migrating to the Cosmos chain. The rise of Hyperliquid: From 0.3% market share in February 2023, it surged to 64.8% in January 2025. With a daily trading volume of US$21 billion, it has become the third largest revenue-generating protocol after Ethereum and Solana. This is not the result of marketing, but pure product advantage. Hyperliquid has no token incentives, no advertising, and relies entirely on user experience to win the market. Just like when the first generation of iPhone was released, there was no need to explain too much, people knew the difference after using it. The philosophy of \"super liquidity\" Hyperliquid has proposed a concept called \"super liquidity\". This is not just a technical term, but a philosophical thinking about the future financial infrastructure. The traditional DeFi ecosystem is like a series of isolated islands: Ethereum has its own liquidity, Solana has its own, and BSC has its own. Users wanting to move assets between different ecosystems is like sailing between different islands, which is both difficult and dangerous. The vision of \"super liquidity\" is to build a huge bridge so that all liquidity can flow seamlessly. Hyperliquid's cooperation with Phantom Wallet is the embodiment of this vision: 15 million Solana users can directly use Hyperliquid's services without having to learn new wallets or operating procedures. This collaboration is particularly interesting because Phantom chose not Solana's native derivatives DEX (such as Drift or Jupiter), but instead chose Hyperliquid across chains. It's like a local recommending a restaurant out of town because the food there is indeed better. The double-edged sword of democratization of leverage Hyperliquid and similar platforms have also brought another important change: the democratization of leverage trading. In traditional finance, high-leverage trading is usually only open to those who meet the \"qualified investor\" standard - you need to prove that you have enough assets and experience to bear the risk. But in the DeFi world, anyone with an Internet connection can trade with 40x leverage. This is a double-edged sword. On the one hand, it breaks down financial privileges, allowing retail investors around the world to access tools that were previously only available to Wall Street elites. On the other hand, it also means that more people may suffer significant losses because they do not understand the risks. Academic research points out an interesting phenomenon: the \"democratization\" of DeFi may actually transfer funds from savers to speculators, rather than entrepreneurs with real social production value. This reminds us that technological innovation is not necessarily equivalent to social progress. The philosophical debate between specialization and generalization Hyperliquid's success also exposes a fundamental disagreement in blockchain design philosophy: should we pursue generalization or specialization? Ethereum represents the vision of a \"world computer\": a general platform that can run any application. The advantages of this approach are flexibility and composability, but the cost is efficiency. Hyperliquid represents the philosophy of \"special tools\": highly optimized systems designed for specific uses. This approach is more efficient, but less flexible. This debate is like the development of the automotive industry. Early car manufacturers tried to build a \"universal vehicle\" - one that could carry people and cargo, and could run on both roads and fields. But in the end, the market chose specialization: cars, trucks, and SUVs each have their own job, and they all perform better in their own fields than the universal vehicle. Blockchain may be going through the same evolution. We may see more specialized chains like Hyperliquid, each of which is the best in its own field. Risk and Reality Check Of course, no innovation is perfect. Hyperliquid faces several important challenges: Centralization Risk: There are currently only 16 validators, far less than Ethereum's 800,000. Although more efficient, it is less decentralized. Security Incidents: Several noteworthy incidents occurred in 2024, including the JELLY token manipulation that resulted in a loss of $4 million and the North Korean hacker test platform defense that resulted in an outflow of $250 million. Regulatory Uncertainty: The regulatory status of dedicated chains is unclear and may face stricter scrutiny than general-purpose blockchains. Technical Debt: The pursuit of speed may compromise certain security and decentralization aspects, and the long-term impact remains to be seen. What will the future financial infrastructure look like? The success of Hyperliquid is not just the success of a platform, it represents the maturity of the entire DeFi industry. We are witnessing a shift from \"concept-driven\" to \"result-oriented\". Early DeFi projects often used \"decentralization\" and \"no permission required\" as their main selling points, but the user experience was often poor. The new generation of DeFi projects are beginning to realize that what users really care about is results: faster transactions, lower fees, and better liquidity. This shift is like the development of the Internet. In the 1990s, when people talked about the Internet, they always emphasized \"openness\", \"freedom\", and \"decentralization\". But the ultimate success was not the most decentralized protocol, but the most practical product: Google, Amazon, Facebook. DeFi may also be undergoing the same evolution. Pure decentralization is important, but if it cannot provide a better user experience than traditional finance, it will always be just a niche experiment. Enlightenment for Investors and Builders The story of Hyperliquid has different implications for different people: For investors: Pay attention to projects that truly solve problems, not projects that only have ideas. The market will eventually reward products that create real value. For builders: User experience trumps ideology. If your product is not as practical as centralized alternatives, then the advantages of decentralization will not be enough to attract mass users. For regulators: New technologies will always challenge the existing framework, but it is better to open up than to block. Instead of prohibiting innovation, it is better to actively participate in the formulation of adaptive regulatory policies. For the industry: Specialization may be the key to the next wave of innovation. Instead of trying to do everything on a general platform, it is better to build the most optimized solution for a specific use case. Conclusion: The victory of pragmatism Hyperliquid's success marks an important turning point in the DeFi industry: from adolescent idealism to adult pragmatism. This does not mean that we have to abandon our original intention of decentralization, but that we have to learn to find a balance between ideals and reality. The best technology is not the most \"pure\" technology, but the technology that can best solve practical problems. Just like the invention of the car did not eliminate horses, but provided better options for different needs. Hyperliquid and similar dedicated chains will not replace Ethereum, but they will provide better solutions for specific use cases. In this process, we may lose some purity, but we will gain more practicality. For a technology that wants to change the world's financial system, being truly used by more people may be more important than maintaining the purity of the technology. After all, the best revolution is not the most radical one, but the one that people accept and benefit from without realizing it. When DeFi becomes as easy to use as traditional finance, but maintains the transparency and openness of the blockchain, true financial democratization will come.",
  "references": [
    "https://www.panewslab.com/zh/articles/8yd499yj",
    "https://hyperliquid.gitbook.io/hyperliquid-docs/",
    "https://wifpr.wharton.upenn.edu/wp-content/uploads/2021/05/DeFi-Beyond-the-Hype.pdf",
    "https://academic.oup.com/jfr/article/6/2/172/5913239",
    "https://www.oecd.org/daf/fin/financial-markets/Why-Decentralised-Finance-DeFi-Matters-and-the-Policy-Implications.pdf",
    "https://coinshares.com/us/insights/research-data/the-great-leap-forward-dexs/",
    "https://blog.quicknode.com/hyperliquid-protocol-analysis-2025/"
  ],
  "audio_file": "audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution.wav",
  "social_hook": "🚀 Finally, you don’t have to choose between decentralization and speed! Hyperliquid achieves 0.2 second transactions + full on-chain transparency,...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-19T07:18:12.946Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-07-12-hyperliquid-defi-speed-revolution/segment068.ts"
    ]
  },
  "mock_data": true,
  "mock_generated_at": "2025-07-15T22:52:18.612Z"
}