{
  "id": "2025-09-29-un-blockchain-digital-identity-infrastructure-revolution",
  "status": "translated",
  "category": "daily-news",
  "date": "2025-09-30",
  "language": "en-US",
  "title": "When the United Nations became a blockchain pioneer: Decoding the digital identity revolution for 70,000 retirees and how it redefines trust infrastructure",
  "content": "Have you ever thought about what it means when an international organization like the United Nations begins applying blockchain technology to its core operations? Recently, the UN released a major white paper, \"Transforming Public Digital Identity: The Case Study of the United Nations System on Blockchain,\" announcing their successful transformation of a 70-year-old paper-based pension system into a blockchain-powered digital identity verification system. The paper concludes that blockchain is \"the ultimate technology for digital identity verification.\"\n\nThis isn't just a story of technological advancement; we're witnessing a historic moment in blockchain technology's transformation from a speculative tool to global infrastructure. When the United Nations Staff Pension Fund (UNJSPF) serves over 70,000 beneficiaries in 190 countries worldwide, its scale and impact far surpass any cryptocurrency project.\n\nFirst, why did the UN choose blockchain over a traditional database?\n\nThe challenge facing the UN is typical: a 70-year-old paper-based system needs to provide identity verification services for pension beneficiaries scattered across 190 countries. Traditional solutions suffer from several critical issues:\n\n**Single point of failure**: A centralized database means a system failure affects all users globally\n**Difficult cross-border coordination**: Legal frameworks and technical standards vary across 190 countries\n**High document processing costs**: Tens of thousands of paper documents need to be processed annually, involving mailing, scanning, and archiving\n**Fraud risk**: Paper certificates are easily forged, resulting in approximately 1,400 payment suspensions annually\n\nThe core advantage of blockchain solutions lies in creating a \"trust network\" rather than a \"trust center.\" Using Hyperledger Fabric, an enterprise-grade blockchain platform, the United Nations has established a permissioned network that:\n\n- **Immutability**: Once identity information is on-chain, it cannot be tampered with or deleted\n- **Decentralized Verification**: No reliance on a single verification authority; independent verification is possible globally\n- **Standardized Protocol**: Utilizes W3C-standard decentralized identities (DIDs) and verifiable credentials (VCs)\n\n**Data Showing Real Results**:\n- Paper processing reduced by 40%\n- Archiving costs reduced by 95%\n- Overtime costs reduced by 76.5%\n- Digital user retention rate reaches 99.96%\n\n**Second, how is this different from other blockchain projects we're familiar with? **\n\nLet's compare several major institutional blockchain projects to understand the uniqueness of the UN case:\n\n**TradeLens (Maersk + IBM), now defunct:\n- **Goal**: Digitize global supply chain documents\n- **Reason for failure**: Lack of industry-wide collaboration and insufficient commercial viability\n- **Lessons learned**: Competitor-led alliances struggle to gain trust\n\n**DTCC Project Ion (US Securities Clearing Corporation), now operational:\n- **Scale**: Processes over 100,000 bilateral stock trades daily\n- **Features**: T+0 instant settlement, operating in parallel with traditional systems\n- **Limitations**: Limited to US financial markets\n\n**European Blockchain Services Infrastructure (EBSI):\n- **Scope**: Cross-border public services across 27 EU member states\n\n**Application**: Degree verification, identity authentication\n\n**Similarities**: The \"digital public good\" concept closest to the UN model\n\n**Unique Values of the UN Project**:\n\n1. **People-Oriented**: Rather than tracking \"things\" (containers, stocks), it protects the rights of \"people\"\n\n2. **True Global**: Spanning 190 countries, surpassing any regional organization\n\n3. **Public Interest**: Non-profit, providing public services\n\n4. **Replicable Model**: Designed as a \"digital public good\" for adoption by other organizations\n\n**Third, why is self-sovereign identity (SSI) a \"killer application\" for blockchain? **\n\nThe United Nations' implementation perfectly illustrates the operational logic of Self-Sovereign Identity (SSI):\n\n**Problems with the Traditional Identity Verification Model**:\n- Personal data is stored in countless different systems\n- Each verification requires contacting the original issuing authority\n- Cross-border verification procedures are complex and take weeks\n- Personal data is controlled by intermediaries, posing a risk of misuse\n\n**Innovation of the SSI Model**:\n\n1. **Issuer**: The United Nations Staff Pension Fund issues digital credentials to retirees\n2. **Holder**: Retirees hold the credentials in their own digital wallets\n3. **Verifier**: Local banks or institutions can verify certificates directly without contacting the UN.\n\nThe core of this model is to return control of identity to individuals while ensuring the authenticity of certificates through cryptography.\n\n**Ingenious Technical Architecture Design**:\n\nThe UN uses a two-tier architecture:\n- **Identity Layer**: Hyperledger Indy handles decentralized identity management\n- **Transaction Layer**: Hyperledger Fabric records certificate issuance and verification events\n\n**Off-chain Storage Strategy**: To comply with privacy regulations such as GDPR, sensitive personal information is stored off-chain, with only encrypted fingerprints and verification records recorded on the blockchain.\n\n**Fourth, what does this mean for 75-year-old retirees? **\n\nTechnology, no matter how advanced, is meaningless if ordinary people can't use it. The United Nations has done extensive work on user experience:\n\n**Digital Credential Existence Proof (DCE) Application**:\n- **Facial Recognition**: Users simply take a photo to prove \"I am alive and I am who I am.\"\n- **Geolocation**: Automatically verifies that users are at their stated location\n- **One-Click Verification**: Local agencies can verify their identity by scanning a QR code\n\n**Key Challenge: Key Management**:\nBlockchain's Achilles' heel is key management. How can a 75-year-old retiree securely manage encryption keys? The UN solution combines:\n- **Biometric backup**: Face and fingerprint as key recovery methods\n- **Multi-signature**: Requires multiple factors for simultaneous authentication\n- **Social resilience**: Assisted key recovery through trusted contacts\n\n**Fifth, a new model for global digital governance**\n\nThe UN's success provides a new template for international collaboration.\n\n**Digital public finance concept**:\nSameer Chauhan, Director of the UN International Computing Centre, said: \"This project not only provides a technical prototype, but also an operational model for organizations within the UN system to collaborate on designing a secure, scalable, and inclusive digital public infrastructure.\"\n\nWhat does this mean? Imagine this:\n- **WHO**: Global Vaccination Certificate\n- **UNESCO**: International Recognition of Academic Degrees\n- **IOM**: Verification of Cross-Border Employment Qualifications\n- **UNHCR**: Refugee Identification\n\n**Implications for National Governments**:\n\nMany countries are exploring digital identity systems:\n- **India's Aadhaar**: Biometric ID System\n- **Estonia's e-Residency**: Digital Citizenship\n- **China's Digital ID**: Social Credit Integration\n- **EU's eIDAS**: Cross-Border Digital Identity Authentication\n\nThe UN's blockchain solution offers a novel option: one that enables government regulation while protecting individual privacy and data sovereignty.\n\n**Sixth, what opportunities should investors and businesses focus on?**\n\nThe United Nations' success demonstrates the enormous potential of enterprise-grade blockchain, creating several investment opportunities:\n\n**1. Digital Identity as a Service (IDaaS) Market**\n\nThe market size is estimated to grow from US$20 billion in 2024 to US$80 billion in 2030. Key players include:\n- **Microsoft Azure AD B2C**: Enterprise identity management\n- **Ping Identity**: Authentication solution\n- **Okta**: Identity-as-a-Service platform\n- **Emerging blockchain identity companies**: Sovrin, uPort, Civic\n\n**2. Enterprise-grade blockchain infrastructure**\n\n[Permissioned blockchain] will become mainstream for enterprise adoption:\n- **Hyperledger Foundation**: Open-source enterprise blockchain ecosystem\n- **R3 Corda**: Focused on financial services\n- **ConsenSys Quorum**: Enterprise-grade Ethereum\n- **AWS Blockchain Templates**: Cloud blockchain services\n\n**3. Compliance and Audit Technology\n\nAs blockchain becomes a critical infrastructure, regulatory compliance becomes crucial:\n- Chainalysis: Blockchain Analysis and Compliance\n- Elliptic: Cryptocurrency Compliance Solutions\n- TRM Labs: Blockchain Risk Management\n\nRisk Warning:\n- The regulatory landscape is still evolving rapidly\n- Technical standards are not yet fully unified\n- User adoption may be slower than expected\n- Significant initial investment and technical expertise are required\n\nSeventh, Blockchain is Redefining Trust\n\nThe most profound significance of the UN project is that it demonstrates how blockchain can redefine the trust mechanisms of modern society.\n\n**From \"Institutional Trust\" to \"Protocol Trust\":**\n- Traditional Model: We trust banks, governments, and large corporations\n- Blockchain Model: We trust verifiable mathematics and cryptography\n\n**Democratization of Trust**:\nPreviously, only large institutions could issue \"trusted\" certificates. Now, any organization that adheres to W3C standards can issue verifiable certificates. This lowers the threshold for trust and allows more entities to participate in the trust network.\n\n**Solutions for Cross-Border Trust**:\nThe UN system demonstrates an important concept: how to establish a cross-border trust mechanism in the absence of a common political authority. This has significant implications for the era of globalization.\n\n**Eighth, Challenges and Limitations: Reality is Complex**\n\nDespite its success, the UN blockchain project faces practical challenges:\n\n**Technical Complexity**:\n- **Consensus Mechanism**: Hyperledger Fabric's ordering service may still become a bottleneck.\n- **Governance Issues**: How will over 40 participating institutions coordinate network upgrades and policy development?\nKey management: Key recovery for non-technical users remains a challenge.\n\nBalancing privacy and transparency: Blockchain immutability conflicts with the GDPR's \"right to be forgotten.\"\n\nA carefully designed architecture for separating on-chain and off-chain data is required.\n\nScalability: Hyperledger Fabric's transactions per second (TPS) are still limited.\nAs the number of users grows, performance pressure will gradually become apparent.\n\n**Ninth, Implications for China: Balancing Sovereignty and Openness**\n\nChina has its own path forward in digital identity and blockchain:\n\n**Comparison with the Blockchain Services Network (BSN):\nChina's BSN adopts a similar permissioned blockchain architecture, but places greater emphasis on state control:\n- **Similarities**: Both use permissioned networks and prioritize verifiability.\n- **Differences**: The BSN prioritizes sovereign control, while the United Nations prioritizes international interoperability.\n\n**Lessons from the Digital Renminbi (DCEP):\nThe United Nations' experience with cross-border identity verification offers valuable insights into the internationalization of the digital renminbi:\n- How to achieve international interoperability while maintaining control?\n- How to balance privacy protection with regulatory transparency\n\n\"Belt and Road\" Digital Infrastructure:\n\nChina could consider providing similar digital identity infrastructure to Belt and Road countries as a key component of the Digital Silk Road.\n\n\n**Tenth, Future Outlook: Blockchain Infrastructure**\n\nThe UN project marks a significant milestone in the development of blockchain technology: its transition from a speculative tool to infrastructure.\n\n**Developments we might see in the next five years**:\n- More international organizations adopt similar blockchain identity systems\n- W3C DIDs and VCs standards become global protocols\n- Governments begin integrating blockchain identity into e-government systems\n- Enterprise-level blockchain applications move from pilots to large-scale deployment\n\n**Long-term impacts (10-15 years):**\n- Digital identity becomes a fundamental human right, just like the right to internet access today\n- Cross-border services eliminate the need for complex identity verification processes\n- New international governance mechanisms are based on blockchain consensus\n- The concept of \"digital citizenship\" transcends national boundaries.\n\n**Conclusion: A paradigm shift from \"coin\" to \"chain\"**\n\nThe success of the United Nations blockchain pension system offers a crucial lesson for the entire blockchain industry: what truly changes the world isn't speculative token trading, but the application of technology that solves real problems.\n\nWhen we stop talking about \"blockchain making people rich overnight\" and start discussing \"how blockchain can make it easier for 75-year-old retirees to prove their identity,\" the technology has truly matured.\n\nThe UN case demonstrates that blockchain's greatest value lies not in creating new financial assets but in rebuilding the infrastructure of trust. In an increasingly digital and globalized world, a verifiable, interoperable, and privacy-protecting identity system may be more valuable than any cryptocurrency.\n\nThe underlying significance of this shift is that we are moving from the \"Age of Coin\" to the \"Age of Blockchain,\" from speculative bubbles to infrastructure development, and from \"what blockchain can do\" to \"what blockchain should do.\" The successful implementation of the United Nations provides a compelling answer to the latter question.",
  "references": [
    "https://www.coinglass.com/ja/news/704606",
    "https://www.coindesk.com/tech/2025/09/26/un-experiment-with-pension-funds-proves-blockchain-as-ultimate-identity-tech",
    "https://www.unjspf.org/wp-content/uploads/2025/09/UNICCUNJSPF_Transforming-Public-Digital-Identity.pdf",
    "https://www.biometricupdate.com/202509/un-agencies-unveil-blockchain-breakthrough-in-global-pension-digital-id-verification",
    "https://www.panewslab.com/en/articles/a7a93096-3bba-419e-9bbc-ffabda7e4673",
    "https://www.unjspf.org/",
    "https://www.maersk.com/news/articles/2022/11/29/maersk-and-ibm-to-discontinue-tradelens",
    "https://www.dtcc.com/news/2022/july/27/project-ion",
    "https://digital-strategy.ec.europa.eu/en/policies/european-blockchain-services-infrastructure",
    "https://www.hyperledger.org/",
    "https://www.r3.com/platform/corda/",
    "https://besu.hyperledger.org/",
    "https://www.w3.org/TR/did-core/",
    "https://www.w3.org/TR/vc-data-model/",
    "https://microsoft.com/identity/",
    "https://www.pingidentity.com/",
    "https://www.okta.com/",
    "https://sovrin.org/",
    "https://chainalysis.com/",
    "https://www.elliptic.co/",
    "https://www.trmlabs.com/"
  ],
  "framework": "解讀分析式風格.md",
  "audio_file": "audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution.wav",
  "social_hook": null,
  "knowledge_concepts_used": [
    "self-sovereign-identity",
    "digital-public-goods",
    "institutional-blockchain-adoption",
    "cross-border-identity-verification",
    "hyperledger-enterprise-blockchain",
    "trust-infrastructure",
    "permissioned-blockchain",
    "network-effect"
  ],
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-30T12:42:47.961Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/daily-news/2025-09-29-un-blockchain-digital-identity-infrastructure-revolution/segment087.ts"
    ]
  }
}