{
  "id": "2025-08-06-eip7702-transaction-simulation-security-gaps",
  "status": "draft",
  "category": "defi",
  "date": "2025-08-06",
  "language": "zh-TW",
  "title": "當錢包變成特洛伊木馬：EIP-7702如何讓交易模擬失去保護力？",
  "content": "古希臘哲學家赫拉克利特曾說：「人不能兩次踏進同一條河流。」這句話的深意在於，看似不變的事物，其本質可能已經悄然發生變化。在區塊鏈的世界裡，我們以為熟悉的錢包簽名機制，隨著EIP-7702的引入，已經成為了一條全新的「河流」。用戶還在用老方法「踏水」，卻不知道河床下暗流湧動，隱藏著前所未有的風險。\n\n想像你是一家高檔餐廳的常客。每次來，你都點同一道招牌菜，服務員也認識你，整個流程行雲流水。有一天，你照例點菜，服務員微笑著說：「今天有新的用餐方式，您只需要在這張紙上簽個名，我們就能為您提供更好的服務體驗。」你信任這家餐廳，便毫不猶豫地簽了字。然而，你不知道的是，這張紙上的小字條款不僅同意了用餐服務，還授權餐廳從你的銀行帳戶扣取額外費用，購買你並不需要的昂貴酒水。這就是最近發生的EIP-7702釣魚攻擊的真實寫照——一個6.6萬美元的慘痛教訓。\n\n表面上看，這是一次針對新技術特性的釣魚攻擊。但實際問題是：當我們為了提高用戶體驗而引入更強大的工具時，我們是否也同時構建了相應的安全防護機制？\n\n**第一，EIP-7702的「臨時授權」機制通常是怎麼運作的？**\n\n要理解這次攻擊，我們首先需要明白EIP-7702的核心創新：臨時代碼委託。傳統的以太坊錢包地址（EOA）只能執行簡單的轉帳操作，就像一把只能開一道門的鑰匙。而EIP-7702允許用戶在一筆交易中，臨時將自己的錢包地址「升級」成智能合約，獲得批量操作、gas代付等高級功能。\n\n這個機制的技術原理是這樣的：用戶簽名一個特殊的交易類型（0x04），其中包含一個`code`欄位。這個欄位中的位元組碼會在交易執行期間被臨時設定為用戶錢包的代碼，就像給普通鑰匙臨時安裝了一個多功能開鎖器。交易結束後，這個「升級」會被移除，錢包回到普通狀態。\n\n在正常情況下，這個機制非常有用。比如，用戶可以用一筆交易同時完成：代幣交換、流動性挖礦、收取獎勵等多個操作，大大提高了效率和用戶體驗。Uniswap的Universal Router就是利用這種能力，將複雜的DeFi操作簡化為一鍵完成。\n\n但問題就出現在這裡：用戶看到的是「在Uniswap上交換代幣」，實際簽署的卻是「授權執行任意代碼」。這就像你以為自己只是在餐廳點了一道菜，實際上卻簽署了一份空白支票。攻擊者正是利用了這種信任缺口，將惡意代碼偽裝成正常的Uniswap交易。\n\n攻擊的技術路徑通常是這樣的：攻擊者創建一個看起來像是Uniswap交換的交易，但在`code`欄位中注入惡意代碼。這個代碼會首先執行預期的代幣交換（讓交易看起來正常），然後悄悄地執行額外的轉帳操作，將用戶的其他代幣轉移到攻擊者控制的地址。由於整個過程都在同一筆交易中原子化執行，用戶很難察覺異常。\n\n**第二，錢包的交易模擬機制為什麼無法完全防範這種攻擊？**\n\n理論上，現代錢包的交易模擬功能應該能夠發現這種攻擊。MetaMask、Rabby等主流錢包都會在用戶確認交易前，使用Tenderly、Flashbots或自家的模擬引擎來「預演」交易結果，告訴用戶這筆交易會產生什麼影響。\n\n交易模擬的工作原理是：在一個臨時的區塊鏈分叉上執行交易，記錄所有的狀態變化，然後將結果翻譯成用戶可理解的格式。對於EIP-7702攻擊，模擬引擎確實能夠檢測到所有的代幣轉移，包括那些用戶未預期的轉帳。\n\n但問題出現在「翻譯」環節。當模擬結果顯示：「-1 ETH，+1500 USDC，-500 WETH，-10000 DAI」時，錢包的UI需要決定如何向用戶呈現這個信息。大多數錢包會優先顯示主要交易（ETH到USDC的交換），而將其他變化視為「次要」或「技術性」的調整。\n\n更致命的是，攻擊者會利用用戶對知名協議的信任。當錢包顯示「與Uniswap Universal Router交互」時，用戶會自然而然地認為這是安全的，即使看到額外的代幣變化，也可能認為是Uniswap複雜路由機制的正常表現。就像在熟悉的餐廳裡，即使帳單比平時高一些，你也可能認為是通脹或者用了更好的食材。\n\n此外，現有的模擬機制還面臨技術挑戰。EIP-7702的代碼委託創造了動態的執行環境，代碼的行為可能依賴於當前的區塊狀態、時間戳，甚至是特定的外部條件。靜態模擬很難捕捉到所有可能的執行路徑，特別是那些專門設計用來規避檢測的惡意邏輯。\n\n更深層的問題是，現有的安全模型建立在「代碼是已知和可信的」這個假設之上。我們信任Uniswap，是因為它的智能合約代碼是開源的、經過審計的、並且有良好的聲譽。但EIP-7702引入了「臨時代碼」的概念，打破了這個信任鏈。用戶需要信任的不再是一個已知的合約，而是一段可能從未被審查過的動態代碼。\n\n**第三，為什麼即使知道風險，大多數用戶還是會中招？**\n\n這個問題的根源在於三個心理陷阱：複雜性疲勞、權威偏見，以及即時滿足的誘惑。\n\n首先是複雜性疲勞。現代DeFi用戶每天都要面對大量的技術概念：gas費、滑點、流動性池、智能合約等等。EIP-7702又增加了「臨時代碼委託」這個新概念。當一個新技術被包裝在熟悉的界面（比如Uniswap的UI）中時，用戶的認知系統會自動簡化處理：「這是Uniswap，Uniswap是安全的，所以這個操作是安全的。」\n\n權威偏見則放大了這個問題。Uniswap作為DeFi領域的權威品牌，其名字本身就是一種安全保證。攻擊者深知這一點，所以會精心設計攻擊，讓惡意交易看起來像是與Uniswap的正常交互。就像詐騙分子會冒充銀行客服一樣，利用的是人們對權威機構的本能信任。\n\n最狡猾的是即時滿足的誘惑。攻擊者往往會設計一些看起來非常誘人的機會：空投申領、限時套利、高收益挖礦等等。在「機會稍縱即逝」的心理壓力下，用戶很容易跳過仔細檢查的步驟，快速完成交易。這就像限時搶購活動中，消費者往往會忽略商品的詳細說明，直接點擊購買。\n\n更深層的問題在於，我們對「安全」的理解還停留在傳統的框架中。在傳統金融系統中，安全主要來自於機構的信譽和監管的保護。但在去中心化的世界裡，安全需要每個用戶具備一定的技術理解能力。這種轉變對大多數人來說都是困難的。\n\n從博弈論的角度看，這是一個典型的資訊不對稱問題。攻擊者投入大量時間研究技術漏洞和心理弱點，而普通用戶只是想要完成一個簡單的交易。這種不對稱的投入必然導致攻擊者在這場「貓鼠遊戲」中佔據優勢。\n\n更令人擔憂的是，隨著賬戶抽象和EIP-7702等新技術的普及，這種攻擊的門檻會越來越低，而用戶需要掌握的安全知識卻越來越多。我們正在創造一個對專業知識要求極高的「去中心化」系統，這本身就是一個矛盾。\n\n**結語：在信任與驗證之間尋找新的平衡**\n\n法國哲學家保羅·維利里奧曾經說過：「每發明一種新技術，同時也發明了相應的災難。」船的發明帶來了沉船，飛機的發明帶來了空難。EIP-7702的發明，也帶來了新形態的數位災難。\n\n但這並不意味著我們應該因噎廢食。關鍵在於，我們需要建立與技術複雜性相匹配的安全機制。這不僅包括技術層面的改進——比如更智能的交易模擬、更清晰的風險提示，更重要的是認知層面的升級。我們需要重新定義什麼是「用戶友好」：是讓用戶在不理解風險的情況下完成複雜操作，還是幫助用戶建立正確的風險認知？\n\n也許，真正的解決方案不在於讓技術變得更加複雜和「智能」，而在於找到簡化與安全之間的平衡點。就像優秀的建築師不會為了展示技巧而設計複雜的結構，優秀的協議設計者也應該優先考慮用戶的認知負荷。\n\n當我們在建設去中心化的未來時，不妨時常問問自己：我們是在解放用戶，還是在綁架用戶？是在降低門檻，還是在轉移風險？這些問題沒有標準答案，但值得每一個參與者認真思考。畢竟，技術的最高境界不是炫耀複雜，而是化繁為簡——在給用戶更大自由的同時，也給他們足夠的保護。",
  "references": [
    "https://www.panewslab.com/zh/articles/8d7dbd2f-df75-447c-92b1-f30de5e92a6c",
    "https://eips.ethereum.org/EIPS/eip-7702",
    "https://docs.metamask.io/guide/",
    "https://docs.tenderly.co/",
    "https://docs.flashbots.net/flashbots-protect",
    "https://uniswap.org/developers",
    "https://ethereum.org/en/developers/docs/accounts/",
    "https://vitalik.ca/general/2021/01/05/rollup.html",
    "https://blog.ethereum.org/2023/10/31/road-to-account-abstraction"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": null,
  "social_hook": null,
  "feedback": {
    "content_review": {
      "status": "rejected",
      "score": 2,
      "reviewer": "reviewer_cli",
      "timestamp": "2025-08-08T03:01:59.857Z",
      "comments": "技術上說錯了，他們執行攻擊的方式是讓用戶簽署一堆 approve 在事後把錢轉走\u001b[D\u001b[D\u001b[D"
    }
  },
  "updated_at": "2025-08-08T03:01:59.857Z"
}