{
  "id": "2025-08-05-eip-0000-unified-multidimensional-fee-market",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-08-06",
  "language": "en-US",
  "title": "From “Separate Pricing” to “Uniform Payment”: How does EIP-0000 redefine the blockchain resource market?",
  "content": "In \"The Wealth of Nations,\" Adam Smith noted that division of labor is key to improving efficiency, but a side effect of this is a dramatic increase in complexity. When we break down a simple task into multiple specialized segments, while each segment becomes more efficient, the cost of coordinating them also rises exponentially. This economic insight, from over 200 years ago, is now perfectly embodied in the blockchain world.\n\nRecently, the Ethereum community released a new proposal called EIP-0000, co-proposed by Anders Elowsson and Vitalik Buterin. This proposal may seem technical, but it actually addresses a deeply human problem: how to enable ordinary users to smoothly utilize blockchain services without becoming \"fee market experts.\"\n\nImagine this scenario: You're a restaurant patron ordering a set meal. In the current Ethereum world, you can't simply say, \"I'd like a steak set meal, and I'm willing to pay a maximum of 500 yuan.\" Instead, you must set price limits for the steak, salad, soup, cutlery, waiter time, kitchen gas, and so on. To make matters worse, these prices change minute by minute and interact in complex ways. If you bid too low for any one item, the entire meal will fail.\n\nThis is the real dilemma facing Ethereum users today. Every time you send a transaction, you need to set a gas fee, a priority fee, and, if it involves a large amount of data, a separate blob fee. For the average user, this is as absurd as requiring everyone to become an energy market trader before they can drive a car.\n\nOn the surface, EIP-0000 is a proposal for technical optimization. But the real problem is that blockchain technology is hindering its own adoption due to excessive complexity, which stems largely from our obsession with \"precise control.\"\n\nFirst, how does the blockchain fee market typically work?\n\nTo understand the revolutionary nature of EIP-0000, we first need to understand how the current fee system has evolved.\n\nEthereum began simply, with only one resource: gas (computing power). Users set a gas price, and miners sort transactions by price, packaging them together. It's like an early telephone system, where you only pay for the time you use the phone.\n\nThen came EIP-1559, which introduced the concepts of a \"base fee\" and a \"priority fee.\" The base fee is automatically adjusted by the protocol, while the priority fee is a tip from the user to the miner. It's like Uber's dynamic pricing: a base fare plus a peak-time markup. While a bit more complex, most users still understand it.\n\nBut the real complexity came with the introduction of EIP-4844. This upgrade added a new resource type to Ethereum: blobs (large amounts of data storage). Suddenly, users needed to compete in two completely independent markets. It's like trying to bid for Uber fares and highway tolls simultaneously, with these two pricing systems completely out of sync.\n\nFor example, Layer 2 projects like Arbitrum or Optimism regularly submit large amounts of data to the Ethereum mainnet. Operators must monitor both the gas market (for executing transactions) and the blob market (for storing data) and set reasonable fee parameters for each. This not only increases operational complexity but also degrades the user experience.\n\nEven more ironically, this separate fee market can lead to wasted resources. When gas prices are high and blob prices are low, you might pay high execution fees for a small transaction while failing to take advantage of cheap storage resources. It's like setting separate prices for a hotel room and a restaurant. You end up paying a high price for the room, but go hungry because the restaurant is full.\n\n**Second, why is a unified fee market approach better?**\n\nEIP-0000 proposes an elegant and intuitive solution: users set a total fee cap, and then the protocol automatically allocates this budget across different resources.\n\nIt's like switching from an à la carte model to a set menu model. With an à la carte model, you need to make a precise judgment about the value of each dish and consider how they complement each other. With a set menu model, you simply decide how much you're willing to pay for the entire meal, and the restaurant will provide the best combination.\n\nTechnically, the core of this mechanism is the \"unified budget constraint.\" The user specifies a max_fee, and the protocol calculates the cost of all resources required for the transaction (gas + blobs + possible future resources). As long as the total cost does not exceed the user's budget, the transaction is considered valid.\n\nThe benefits of this design are multiple. First, it improves capital efficiency. In the old system, users had to set aside funds for each resource separately, often resulting in insufficient allocations for some resources and insufficient allocations for others. A unified budget acts like a pool of funds that can be flexibly allocated based on actual needs.\n\nSecond, it simplifies the user experience. Ordinary users no longer need to understand the differences between technical concepts such as gas and blobs, nor do they need to monitor multiple price curves. Just like when using cloud services, you don't set prices for CPU, memory, and storage separately, but instead choose a single, overall instance specification.\n\nThe most important issue is future scalability. As the Ethereum roadmap progresses, more resource types may be introduced, such as state rental, zero-knowledge proof computing, and dedicated hardware access. Under the current multi-dimensional pricing system, each additional resource type means further complexity in the user experience. A unified pricing market provides a scalable framework, allowing new resources to be seamlessly added without increasing the user's cognitive burden.\n\nThe development of AWS provides a good analogy. Early cloud services required users to pay separately for compute, storage, and bandwidth, resulting in complex and unpredictable pricing. Later EC2 instance types (such as t2.micro and m5.large) effectively implemented a \"flat-rate\" model, with a single price covering all necessary resource combinations. This simplification has significantly boosted the adoption of cloud computing.\n\n**Third, why do most people misunderstand this change?**\n\nDespite the clear advantages of a flat-rate market, I predict many will be uneasy about it, or even opposed. There are deep psychological and cognitive reasons behind this reaction.\n\nFirst, there's the **illusion of control**. Humans naturally prefer detailed control, believing that more fine-grained control means better outcomes. This is similar to how some drivers prefer manual braking to automatic braking, believing they can make better decisions than machines. But the reality is that in complex systems, excessive microcontrol often backfires. Most users lack the time or expertise to optimize multi-dimensional fee parameters, and forcing them to do so will only cause trouble.\n\nSecondly, there's the psychological trap of loss aversion. Economists have found that people are more sensitive to potential losses than certain gains. Separate fee markets give users the illusion that they can \"save costs\" by precisely controlling each fee. While a unified fee market is actually more efficient, it leaves users feeling they have less room for optimization, creating psychological resistance.\n\nThe most fundamental misunderstanding stems from confusing technical complexity with user value. In the blockchain community, technical complexity is often seen as a sign of \"professionalism.\" Being proficient in manipulating multiple fee parameters is considered a sign of being a \"power user.\" This culture leads community members to view simplification as \"dumbing down\" rather than improvement.\n\nHowever, this approach overlooks a crucial fact: the best technology should be transparent. Users should focus on their goals (transferring funds, trading, using dApps), not on becoming experts in the underlying infrastructure. Just as you don't need to understand every detail of the engine to drive a car, you don't need to understand how the TCP/IP protocol works to use the internet.\n\nMore dangerously, this \"cult of complexity\" could hinder mainstream adoption of blockchain technology. If we insist on requiring every user to become an expert in the fee market, blockchain will remain a niche toy, not a world-changing infrastructure.\n\nFrom a game theory perspective, the current multi-dimensional fee system creates a variant of the \"Tragedy of the Commons.\" Each protocol expects users to pay higher fees for their specific resources, but no one takes responsibility for the overall user experience. The result is a decline in overall system efficiency, reduced user satisfaction, and ultimately, every participant suffers.\n\n**Philosophical Reflection: The Philosophy of Simplicity**\n\nFrench mathematician Blaise Pascal once wrote, \"I write this long letter because I have no time for short messages.\" This statement reveals a profound truth: true simplicity requires greater thought and effort.\n\nThe EIP-0000 proposal effectively embodies this \"difficult simplicity.\" At the user interface level, it offers significant simplification; however, at the protocol level, it requires more complex resource allocation algorithms, more sophisticated economic model design, and more robust block construction mechanisms. This is a \"complexity shift\"—a shift of complexity from the user side to the protocol side, from humans to machines.\n\nThis shift reflects the general law of technological progress. Early cars required drivers to manually adjust the carburetor and crank the starter. Modern cars hide all this complexity, allowing users to simply press the accelerator and brake. Early computers required users to write machine language, while modern graphical interfaces allow ordinary people to accomplish complex tasks.\n\nHowever, we must not ignore the risks associated with this shift. When complexity is hidden, users may lose their understanding of how the system works, leaving them helpless when problems arise. More importantly, a unified system can mask resource misallocation, forcing users to pay for services they don't need.\n\nPerhaps true wisdom lies in finding the right balance between simplicity and control. EIP-0000 may not be a perfect solution, but it represents the right direction: making technology serve people, not the other way around. In pursuing the ideals of decentralization and permissionlessness, we should not forget another equally important goal: making these powerful tools truly accessible to ordinary people.\n\nWhen discussing the future of blockchain, perhaps we should ask less, \"What can we build?\" and more, \"Who should we build for?\" After all, the greatest technology doesn't empower experts, but empowers ordinary people.",
  "references": [
    "https://www.panewslab.com/zh/articles/bfe5c685-ca53-4e64-982f-cefaee96d667",
    "https://ethereum.org/en/developers/docs/gas/",
    "https://eips.ethereum.org/EIPS/eip-1559",
    "https://eips.ethereum.org/EIPS/eip-4844",
    "https://docs.aws.amazon.com/ec2/latest/userguide/instance-types.html",
    "https://ethereum.org/en/roadmap/",
    "https://vitalik.ca/general/2021/01/05/rollup.html",
    "https://solana.com/docs/core/fees",
    "https://docs.avax.network/dapps/smart-contracts/gas-fees",
    "https://docs.cosmos.network/main/basics/gas-fees",
    "https://research.paradigm.xyz/MEV",
    "https://www.usenix.org/conference/nsdi21/presentation/flashbots"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market.wav",
  "social_hook": "📊 Adam Smith foresaw today's problems 200 years ago! EIP-0000 offers a revolutionary solution to the blockchain world's dilemma of \"division of...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-06T02:56:15.136Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-05-eip-0000-unified-multidimensional-fee-market/segment068.ts"
    ]
  }
}