{
  "id": "2025-07-15-ethereum-roadmap-investment-thesis",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-07-16",
  "language": "en-US",
  "title": "New Logic of Ethereum Investment: The Economic Engine Behind the Technical Roadmap",
  "content": "Have you ever wondered why smart investors are beginning to view Ethereum as \"real estate in the digital world\"? In 2025, Ethereum is undergoing a strategic transformation no less than \"The Merge\". This is not a simple technical upgrade, but a complete economic model reconstruction plan. Looking at the investment logic from the technical roadmap Imagine that what you hold is not a cryptocurrency, but the \"equity\" of a digital city that continues to appreciate in value. Ethereum's technical roadmap for the next two years is the blueprint for the construction of this city. Phase 1: zkEVM Layer1 Integration (Q4 2025-Q2 2026) Technical Goal: 99% of blocks verified within 10 seconds, and zero-knowledge proof verification costs reduced by 80% It's like building a super-efficient subway system for a congested city. Currently, Ethereum is like a busy highway. Whenever there is heavy traffic, tolls soar and driving time increases. The integration of zkEVM is equivalent to building a dedicated expressway, which not only significantly reduces the \"toll\" (gas fee), but also allows each transaction to be confirmed within 10 seconds. Economic significance: Supply reduction effect: More stablecoins (USDC, USDT) return to the Ethereum main chain for use, driving up daily Gas consumption and directly increasing ETH combustion. Demand expansion effect: The compliant privacy protection provided by zero-knowledge proof clears the way for traditional financial institutions to enter DeFi. Network effect: Better user experience attracts more users and developers, forming a positive cycle. Phase II: RISC-V execution architecture (second half of 2025-2030) Technical goal: Smart contract execution efficiency increased by 3-5 times, and Gas cost reduced by 50-70%. If Ethereum's EVM is an old but reliable engine, then RISC-V is a high-performance new engine. It's like upgrading the engine of a classic old car to the latest high-efficiency engine, which not only maintains the original reliability but also greatly improves performance and fuel efficiency. Economic significance: Lowering the usage threshold: Lower Gas costs make small transactions feasible and reactivate user groups squeezed out by high fees. Unlocking new application scenarios: high-frequency transactions, real-time games, AI reasoning and other applications that were previously impossible due to high costs will become possible. Increased usage frequency: Cheaper transaction costs will significantly increase the frequency of network usage, forming a positive cycle of ETH demand. Phase 3: Layer1-Layer2 ecological collaboration (Q4 2025-2027) Technical goals: Reduce cross-layer transaction costs by 90%, cross-layer confirmation within 10 seconds, and the unified liquidity pool TVL exceeds 200 billion US dollars. This is equivalent to connecting a scattered urban agglomeration through a high-speed railway and a unified financial system. Imagine if the transfer of funds between Hong Kong, Shenzhen and Guangzhou only takes 10 seconds and the transaction fee is close to zero, then these three cities will form a unified super economy. Economic significance: Liquidity aggregation: The $120 billion of liquidity currently scattered across various Layer 2s will be unified, creating a network effect of 1+1>2. Improved capital efficiency: The DeFi protocol can more efficiently utilize the liquidity of the entire ecosystem and improve overall capital efficiency. Ecosystem value: The unified liquidity pool will make the Ethereum ecosystem the world's largest decentralized financial market. Phase 4: Validator economic optimization (second half of 2025-2027) Technical goal: The staking threshold is reduced from 32 ETH to 1 ETH, and the annualized rate of return is increased from 4-6% to 6-8%. This is like opening up a real estate investment club that only the rich can participate in to more ordinary investors. Originally you needed to buy a whole apartment building to be a landlord, but now you only need to buy a small apartment to start collecting rent. Economic significance: Lower participation threshold: More people can participate in ETH staking, and the staking rate is expected to increase from 25% to more than 40% Supply lock-up effect: About 48 million ETH will be locked in staking, significantly reducing the circulating supply in the market Income assetization: ETH evolves into a \"digital bond\", and the annualized yield of 6-8% provides fundamental support for its valuation Phase 5: Sharding technology returns (2026-2028+) Technical goal: Combining zkEVM+sharding to achieve millions of transactions per second, and reduce data availability costs by 99% This is the ultimate realization of Ethereum's vision of a \"world computer\". Imagine if we could build a decentralized network with processing power comparable to the sum of all the global banking systems, what would that be like? Economic significance: Large-scale adoption: Millions of TPS processing power lays the foundation for large-scale adoption of Web3 Extreme cost optimization: 99% cost reduction will make blockchain technology truly popular in every corner of the world Redefine value: Ethereum will no longer be just a blockchain, but the infrastructure of the global digital economy Triple support for investment logic 1. Supply side: multiple reduction mechanisms Strengthened burning mechanism: Each transaction will burn a certain amount of ETH, and the increase in usage brought about by technological upgrades will directly drive up the amount of burning. Increased staking lock-up: Lower staking thresholds and higher yields will attract more ETH to enter the staking state and reduce the circulating supply. This is like a company that continuously repurchases its shares while increasing its shareholder dividend rate. 2. Demand side: Increased use value and reduced costs: The gas fees brought about by technological upgrades have been greatly reduced, allowing more people to afford to use Ethereum. Improved experience: 10-second confirmation and seamless cross-layer interaction make the blockchain experience close to traditional Internet applications. Expanded application scenarios: The emergence of new application scenarios such as high-frequency transactions, real-time games, and AI reasoning will create new demands. 3. Network effect: Ecosystem collaboration Developer attraction: Better development tools and lower deployment costs attract more developers to enter the Ethereum ecosystem. User network effect: more applications and better experience, forming a positive cycle of user growth. Institutional adoption: the privacy protection and compliance capabilities provided by zero-knowledge proof pave the way for large-scale institutional adoption. Differentiation advantages with competitors Ethereum vs Solana: a showdown of architectural philosophies Ethereum's modular route: through Layer 2 professional division of labor, Layer 1 focuses on security and decentralization. It's like building a multi-layered city, each layer has a specific function. Solana's monolithic route: concentrate all functions on one chain and pursue extreme performance. It's like building a super-efficient monolithic building. Advantages of Ethereum: Stronger decentralization guarantees (millions of validators vs thousands of validators) More mature ecosystem (TVL is more than 3 times that of Solana) Stronger anti-censorship capabilities Deeper capital market foundation The strategic significance of the technology roadmap Ethereum's technology roadmap is actually a \"deepening moat\" strategy: While maintaining the advantages of decentralization, achieve performance balance with high-performance chains Establish stronger network effects through ecosystem integration Provide the necessary compliance and privacy protections for institutional-level applications Risks and Challenges Execution risks Technical complexity: These upgrades are huge engineering challenges, and any delays or technical problems may affect the expected results. Difficulty of coordination: Although the decentralized development model is an advantage, it may also lead to slower development and deployment. Competitive risks Pace of innovation: Competitors are also innovating rapidly, and Ethereum needs to maintain its technological leadership. Market share: Emerging Layer 1 may seize market share in specific areas. Regulatory risks Policy uncertainty: Changes in global regulatory policies may affect the adoption of Ethereum. Staking centralization: The concentration of large staking service providers may attract regulatory attention. Inspiration for investors Short-term perspective (2025-2026) Focus on catalysts: zkEVM integration and initial deployment of RISC-V may become price catalysts. Staking opportunities: Validator economic optimization provides retail investors with lower-threshold staking opportunities. Medium-term perspective (2026-2027) Ecosystem maturity: The realization of L1-L2 synergy will significantly enhance the value of the entire ecosystem. Institutional adoption: The improvement of privacy and compliance functions will attract more institutional funds. Long-term perspective (2028+) Infrastructure status: The maturity of sharding technology will establish Ethereum as a global digital infrastructure. Value redefinition: ETH may evolve into a \"reserve asset\" for the digital economy. Conclusion: The cornerstone of the digital economy Ethereum's technical roadmap is not just a collection of technical upgrades, but a complete economic model reconstruction plan. It builds a self-reinforcing value creation mechanism through three dimensions: supply reduction (burning, staking), demand expansion (better user experience, new application scenarios), and network effects (ecosystem collaboration). The core logic of this roadmap is: let Ethereum evolve from a \"decentralized application platform\" to \"the infrastructure of the global digital economy.\" In this process, the role of ETH will also change from \"digital currency\" to a hybrid of \"digital bonds + equity.\" Of course, this transformation process is full of challenges, and technical execution, market competition, and regulatory policies are all uncertain factors. But just like every major technological revolution in history, the platforms that can continue to innovate and adapt while maintaining their original intentions are often the ones that ultimately win. Ethereum's technical roadmap depicts an imaginative future for us: a global digital economic system in which everyone can participate fairly, with extremely low costs and high efficiency. And ETH is the \"equity proof\" of this system. For investors, understanding the economic logic of this roadmap may be more important than simply paying attention to price fluctuations. Because in this digital economic revolution, the real wealth will belong to those who can understand and participate in the construction of infrastructure.",
  "references": [
    "https://www.panewslab.com/zh/articles/rttm57g5",
    "https://ethereum.org/en/roadmap/",
    "https://ethroadmap.com/",
    "https://github.com/ethereum/pm",
    "https://coinledger.io/tools/solana-vs-ethereum",
    "https://cryptoslate.com/ethereum-vs-solana-in-2025-why-decentralization-may-surpass-speed-in-defis-next-chapter/",
    "https://cointelegraph.com/magazine/ethereum-is-poised-to-catch-up-with-bitcoin-and-solana-in-2025/",
    "https://www.coingecko.com/research/publications/solana-vs-ethereum-2025",
    "https://www.ledger.com/academy/what-is-the-ethereum-roadmap-next-upgrades",
    "https://medium.com/hashkey-capital-insights/opportunities-in-the-ethereum-roadmap-devcon-and-pectra-upgrades-7ae3f0d435dd",
    "https://vitalik.ca",
    "https://ethresear.ch",
    "https://ethereum-magicians.org"
  ],
  "audio_file": "audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis.wav",
  "social_hook": "🔥 Why is smart money starting to treat ETH as \"digital real estate\"? The big transformation of zkEVM in 2025 is about to reconstruct the entire...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-19T01:30:07.721Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-15-ethereum-roadmap-investment-thesis/segment072.ts"
    ]
  }
}