{
  "id": "2025-07-19-zktls-web2-web3-bridge",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-07-20",
  "language": "en-US",
  "title": "zkTLS: When web browsers become blockchain’s “trusted witnesses”",
  "content": "Have you ever thought about what it would be like if your bank account balance, social media data, or credit score could directly guarantee your loan application in the DeFi world without revealing any privacy? This sounds like a science fiction novel, but a technology called \"zkTLS\" (zero-knowledge transport layer security) is making this dream a reality.\n\nIn 2024, zkPass received $12.5 million in Series A financing and has generated more than 2 million zero-knowledge proofs. The ZKON network has established a bridge between Web2 and Web3 in the Mina ecosystem. TLSNotary has redesigned the entire architecture and is ready to support TLS 1.3. These seemingly technical advances actually herald a revolution: Web2's private data will soon enter the Web3 world securely.\n\n## Open the black box: What problem does zkTLS solve?\n\nLet's first understand a basic problem: the blockchain is smart, but it has a fatal \"myopia\" - it can only see the data on its own chain and knows nothing about the outside world.\n\nImagine that you are making investment decisions in a room without windows. You need to know the stock price, exchange rate, weather and other information outside, but you can only rely on others (Oracle oracle) to tell you. The question is: how do you know that this person is not cheating you? And what if this person asks for a high price or is very slow?\n\nThis is the \"Oracle problem\" of the blockchain. Traditional solutions, such as Chainlink, are effective, but have several pain points:\n\n1. **High cost**: Each data query requires payment to multiple nodes\n\n2. **Slow speed**: Multiple nodes need to reach a consensus to determine the authenticity of the data\n\n3. **Limited data range**: Only \"popular\" data that is widely needed can be provided\n\nThe emergence of zkTLS is like equipping everyone with a \"trusted telescope\", allowing you to \"see\" the real situation of the outside world directly, privately and at low cost.\n\n## The science behind the magic: How does zkTLS work?\n\nTo understand zkTLS, we need to first understand two basic concepts: TLS (Transport Layer Security Protocol) and zero-knowledge proof.\n\n**TLS: The \"Secure Envelope\" of the Internet**\n\nWhenever you see the little lock icon in front of a URL in your browser, you are using TLS. It is like a secure envelope that cannot be pierced, ensuring that the communication between you and the website cannot be eavesdropped or tampered with. When you check your bank balance, social media posts, or e-commerce prices, these data are transmitted encrypted via TLS.\n\n**Zero-knowledge proof: \"I know the secret, but I won't tell you what it is\"**\n\nZero-knowledge proof allows you to prove that something is true without revealing specific details. Just like you can prove \"my bank balance is over $100,000\" without telling others how much your balance is.\n\n**zkTLS: The perfect combination of the two**\n\nThe core innovation of zkTLS is that it allows you to generate a cryptographic proof for the data of any HTTPS website, proving \"I did get this data from this website, and the data has not been tampered with\", while selectively hiding sensitive information.\n\nLet me give you a specific example:\n1. You want to apply for an unsecured loan on a DeFi platform\n2. You need to prove that your monthly income exceeds a certain threshold\n3. You use zkTLS to connect to the bank website and obtain salary data\n4. zkTLS generates a certificate: \"This person's monthly income exceeds X dollars\"\n5. The DeFi platform verifies this certificate and approves your loan application\n6. Throughout the process, the platform never sees your specific income, bank account information, or any other private data\n\n## The Three Kingdoms of Technical Route: MPC vs Proxy vs TEE\n\nJust like there were different political routes during the ancient Warring States period, zkTLS also has three main technical implementation routes, each with its own advantages and disadvantages:\n\n**Multi-party computation (MPC) route: the most secure but most complex**\n\nRepresentative projects: TLSNotary, DECO (Chainlink)\n\nIt's like forming a jury to verify data. In the MPC model, multiple participants jointly participate in the establishment and verification process of the TLS connection, and no party can see the complete data alone.\n\nAdvantages:\n- Highest security, no reliance on any single point of trust\n- Strongest cryptographic guarantees\n\nDisadvantages:\n- Huge computational overhead (DECO requires 475MB of communication to verify 2KB of data)\n- Long processing time (may take 50 seconds)\n- High implementation complexity\n\n**Proxy route: balance performance and security**\n\nRepresentative projects: Reclaim Protocol, zkPass\n\nIt's like finding a trusted intermediary to help you verify data. The proxy mode introduces a middle layer to assist in proof generation, greatly improving performance.\n\nAdvantages:\n- Fast processing speed (Reclaim can generate proof in 2-4 seconds)\n- Good user experience, no need to download applications\n- Relatively simple to implement\n\nDisadvantages:\n- Requires trust in proxy nodes\n- Security relies on the honest behavior of the proxy\n\n**Trusted Execution Environment (TEE) route: hardware protection**\n\nIt is like using a special \"anti-eavesdropping\" safe to process data. TEE uses hardware-level security features to protect the data processing process.\n\nAdvantages:\n- Lowest computing and network overhead\n- Best performance\n\nDisadvantages:\n- Dependence on specific hardware manufacturers\n- Shifting trust from software to hardware suppliers\n\n## Market status: An ecosystem with many players\n\nIn 2024-2025, the zkTLS ecosystem is growing rapidly, and various projects are breaking through in different directions:\n\n**Funding and adoption**\n\n- zkPass: $12.5 million in Series A financing, has generated 2 million zero-knowledge proofs, and supports more than 70 data sources\n\n- PADO Labs: $3 million in financing, focusing on MPC-TLS technology\n\n- zkFetch: Deployed on multiple blockchains such as Arbitrum, Sui, Polygon, etc., serving more than 20 projects\n\n**Technology maturity**\n\n- TLSNotary: As the earliest pioneer, it has rebuilt its architecture from scratch and is ready to support TLS 1.3\n- DECO: Developed by Chainlink, it provides the strongest security guarantee, but the computational cost is higher\n- Reclaim Protocol: It has gone the furthest in the proxy model and provides the best user experience\n\n**Application scenario expansion**\n\nCurrently, more than 20 projects have integrated zkTLS in the following areas:\n- Identity verification and KYC process\n- DeFi unsecured loans\n- Social network verification\n- Crypto asset proof\n- Medical data sharing\n- Physical asset tokenization\n\n## Practical Application: Leap from Imagination to Reality\n\nLet’s see how zkTLS creates value in the real world:\n\n**Scenario 1: Unsecured DeFi Loans**\n\nTraditionally, applying for a loan in DeFi requires excess collateral. But with zkTLS, you can:\n\n1. Connect to your bank or payroll platform\n\n2. Prove your credit score, monthly income, or employment status\n\n3. Get a credit-based unsecured loan\n\n4. Protect your private data throughout the process\n\n**Scenario 2: Decentralized Identity Verification**\n\nBuilding an identity system in Web3 has always been a challenge. zkTLS allows you to:\n1. Prove your legal identity from government websites\n2. Prove your academic credentials from educational institutions\n3. Prove your skills certification from professional platforms\n4. Create a verifiable but private decentralized identity\n\n**Scenario 3: Dynamic NFTs and Games**\n\nImagine an NFT whose properties change based on your real-world achievements:\n1. Your fitness NFT updates based on your sports tracking data\n2. Your investment NFT reflects your portfolio performance\n3. Your learning NFT shows your progress on an online course platform\n\n**Scenario 4: Compliance and Regulation**\n\nFor financial services that need to meet regulatory requirements:\n1. Prove that users have completed KYC without revealing specific identity information\n2. Prove that transactions comply with anti-money laundering regulations, but protect transaction privacy\n3. Provide necessary compliance proof for regulators while protecting user privacy\n\n## Challenges and limitations: There is no perfect technology\n\nDespite its bright prospects, zkTLS still faces several important challenges:\n\n**Technical challenges**\n\n1. **Performance bottleneck**: The computational cost of MPC solutions is still high, limiting large-scale adoption\n\n2. **Complexity**: Developing zkTLS applications requires deep cryptographic knowledge\n\n3. **Standardization**: Different projects use different protocols and lack unified standards\n\n**Trust and security**\n\n1. **Trust assumption**: Both proxy mode and TEE mode introduce new trust assumptions\n\n2. **Website compatibility**: Not all websites support zkTLS technology\n3. **Quantum Threat**: Current cryptographic schemes may not be able to withstand future quantum computing attacks\n\n**Market and Adoption**\n\n1. **User Experience**: For ordinary users, there is still a threshold to understand and use zkTLS\n\n2. **Legal Uncertainty**: In some jurisdictions, the use of this technology may face legal challenges\n\n3. **Data Source Cooperation**: Need to establish a partnership with traditional Web2 platforms\n\n## Competitive Landscape: zkTLS vs Traditional Oracle\n\nLet's compare the difference between zkTLS and traditional Oracle solutions:\n\n**Cost-effectiveness**\n- Traditional Oracle: Need to pay for multiple nodes, and the cost increases linearly with the query frequency\n- zkTLS: One-time proof generation cost, can be repeatedly verified, and the marginal cost is close to zero\n\n**Data Range**\n- Traditional Oracle: mainly provides popular public data (prices, exchange rates, etc.)\n- zkTLS: can access data from any HTTPS website, including personalized and private data\n\n**Privacy protection**\n- Traditional Oracle: data is usually public, with limited privacy protection\n- zkTLS: built-in privacy protection, can selectively disclose information\n\n**Instantaneity**\n- Traditional Oracle: needs to wait for consensus from multiple nodes, with high latency\n- zkTLS: can generate proofs instantly, latency depends on specific implementation\n\n**Trustworthiness**\n- Traditional Oracle: relies on economic incentives from multiple nodes\n- zkTLS: relies on cryptographic proofs and trust assumptions of technical implementation\n\n## Future Outlook: Web2 and Web3 Integration Accelerator\n\n**Short-term Development (2025-2026)**\n\n1. **Technology Maturity**: Popularization of TLS 1.3 support, significant performance improvement\n\n2. **Standardization Process**: Establishment of industry standards, improvement of interoperability\n\n3. **Mainstream Adoption**: More DeFi and Web3 applications begin to integrate zkTLS functions\n\n**Medium-term Vision (2026-2028)**\n\n1. **Ecosystem Integration**: Deep integration with major Web2 platforms (social media, financial services)\n\n2. **Regulatory Framework**: Governments and regulators begin to recognize and regulate the use of zkTLS\n\n3. **User Experience Optimization**: Seamless user experience, ordinary users do not need to understand technical details\n\n**Long-term Impact (2028+)**\n\n1. **Data sovereignty**: Ownership and control of personal data are returned to the hands of users\n2. **New business model**: A new business model based on verifiable private data emerges\n3. **Blurring the boundaries between Web2 and Web3**: Seamless integration of the two worlds, unified user experience\n\n## Investment and development opportunities\n\nThe zkTLS ecosystem provides multiple levels of opportunities for different participants:\n\n**Technology developers**\n- Develop more efficient zkTLS protocols and implementations\n- Create developer-friendly tools and SDKs\n- Design optimization solutions specifically for specific application scenarios\n\n**Application developers**\n- Build innovative DeFi products based on zkTLS\n- Develop new identity verification and KYC solutions\n- Create Web3 applications that combine real-world data\n\n**Enterprises and institutions**\n- Explore the integration of existing Web2 services into the Web3 ecosystem\n- Develop blockchain solutions that meet regulatory requirements\n- Leverage zkTLS technology to improve data security and user privacy\n\n**Investors**\n- Follow the development of zkTLS infrastructure projects\n- Invest in innovative applications based on zkTLS technology\n- Participate in the long-term value growth of ecosystem tokens\n\n## Conclusion: When the browser becomes the eyes of the blockchain\n\nzkTLS is not only a technological innovation, it represents an important milestone in the integration of Web2 and Web3. It solves the long-standing \"information island\" problem of blockchain, allowing smart contracts to securely access real-world data while protecting user privacy.\n\nThe real significance of this technology is that it turns everyone's browser into a \"trusted witness\" of the blockchain. Every legal activity you do online - from bank transactions to social interactions, from learning progress to health data - can become your \"verifiable asset\" in the digital world.\n\nWhen zkPass talks about 2 million zero-knowledge proofs, when the ZKON network builds bridges in the Mina ecosystem, and when TLSNotary prepares to support the next generation of TLS protocols, they are actually building a more open, private, and connected digital future.\n\nIn this future, your data truly belongs to you, and you can choose how to use it and what to prove to whom without sacrificing privacy or security. The rich data of Web2 and the decentralized finance of Web3 will merge seamlessly, creating new possibilities that we can hardly imagine today.\n\nzkTLS teaches us an important lesson: in the digital world, the strongest proof often comes from your daily network activities. When technology allows us to safely \"prove without leaking\", we are truly close to an ideal digital society that is both open and private.",
  "references": [
    "https://web3caff.com/archives/119042",
    "https://bwetzel.medium.com/tls-oracles-liberating-private-web-data-with-cryptography-e66e5fad7c34",
    "https://medium.com/zkpass/zktls-the-cornerstone-of-verifiable-internet-da8609a32754",
    "https://www.gate.io/learn/articles/zk-tls-shaping-the-future-of-secure-data-transmission/4466",
    "https://www.prnewswire.com/apac/news-releases/series-a-funding-secures-12-5m-for-zkpass-to-drive-zktls-oracle-protocol-302281736.html",
    "https://www.zkon.xyz/blog/zkon-wrapped-2024",
    "https://blog.reclaimprotocol.org/posts/zktls-canon",
    "https://www.shoal.gg/p/zktls-verifiable-data-composability",
    "https://chain.link/education-hub/zero-knowledge-proof-projects",
    "https://www.coindesk.com/press-release/2025/05/21/sophon-unveils-zktls-based-social-oracle-to-integrate-private-web2-data-onchain"
  ],
  "audio_file": "audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge.wav",
  "social_hook": "🔥 Bank balance becomes DeFi collateral in seconds, zero privacy leakage! zkTLS turns browser into \"digital notary\", Web2 assets directly connected...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-21T10:56:13.978Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-zktls-web2-web3-bridge/segment092.ts"
    ]
  }
}