{
  "id": "2025-08-07-eip-7999-unified-multidimensional-fee-market",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-08-08",
  "language": "en-US",
  "title": "EIP-7999: When Ethereum's \"billing unit\" upgrades from one dimension to a multi-dimensional world",
  "content": "Have you ever wondered why, at the supermarket, meat and vegetables are charged by weight, but mineral water is charged by the bottle, and some imported goods are taxed as a percentage of their value? This reflects a profound economic principle: different resources should be priced differently because they impose fundamentally different costs on the system.\n\nInterestingly, Ethereum, the world's most complex decentralized computer, has long used a single unit called \"gas\" to charge for all operations. It's like a restaurant that says, \"Everything is charged by the calorie,\" regardless of whether you order steak, salad, or wine. This sounds fair, but in practice it creates all sorts of strange problems.\n\nOn August 5, 2025, Ethereum co-founder Vitalik Buterin and developer Anders Elowsson proposed EIP-7999, a proposal that could fundamentally alter Ethereum's economic model. This proposal isn't just a technical optimization; it's more like a \"Copernican Revolution\" in economics—an upgrade of our understanding of blockchain billing from a one-dimensional world to a multi-dimensional one.\n\n## The Troubles of a Decentralized Supermarket: Everyday Resource Misallocation\n\nImagine you own a unique \"decentralized supermarket\" with a few strange rules:\n\nFirst, all items can only be purchased with a single currency called \"supermarket currency,\" and the price of \"supermarket currency\" automatically adjusts hourly based on customer traffic. When there are many customers, everything becomes more expensive; when there are fewer customers, everything becomes cheaper.\n\nSecond, your supermarket has different types of resource constraints: freezer space (similar to blockchain storage), number of checkout counters (similar to computing power), and parking spaces (similar to bandwidth). Strangely, regardless of the resource a customer needs, the billing method is the same.\n\nNow here's the problem: one day, a large crowd suddenly arrives looking for frozen food, and the freezer fills up instantly, causing the price of \"supermarket coins\" to skyrocket. Now, a customer who simply wants to buy a stick of gum (who doesn't need a freezer at all) will have to pay exorbitant prices to check out.\n\nThis is precisely the dilemma Ethereum currently faces. When an NFT project begins to frantically mint (consuming a large amount of computational resources), even Layer 2 systems simply trying to upload some data (primarily consuming bandwidth) will be forced to pay exorbitant fees due to skyrocketing gas prices. The apparent problem is \"excessive gas fees,\" but the real issue is \"overly crude resource pricing.\"\n\n## First, how does Ethereum currently \"charge\"?\n\nTo understand the revolutionary nature of EIP-7999, we must first understand how the current system works.\n\nCurrently, Ethereum is like a logistics company with only one unit of measurement: weight. Whether you're shipping diamonds (computationally intensive), cotton (volume-intensive but lightweight), or steel (heavy and space-consuming), you're charged a flat fee based on weight. This system, called EIP-1559, is indeed fairer than the previous auction system, but it's still essentially a one-size-fits-all approach.\n\nSpecifically, each transaction consumes different types of resources:\n\nExecution Gas: Like CPU time, it's used to execute smart contract calculations. When you trade on Uniswap, the system needs to calculate exchange rates, check balances, and update status, all of which consume execution gas.\n\nCalldata: Like network bandwidth, it's used to transmit transaction data. Layer 2 systems primarily consume this type of resource, as they need to \"post\" large amounts of data to Ethereum as proof.\n\nState Storage: Like hard drive space, it's used to permanently store data. Every time you create a new token or modify smart contract state, Ethereum's \"hard drive\" permanently expands a bit.\n\nThe problem is that these three resources \"damage\" the network in completely different ways. Execution gas is used up once it's gone, leaving no trace; state storage, on the other hand, permanently increases the size of each node's hard drive. Charging them at the same price is like selling diamonds and cotton at the same price.\n\nA classic example is the \"inscription craze\" of 2023. A large number of users engraved inscriptions on Ethereum, primarily consuming calldata resources but driving up gas prices for all types of transactions. DeFi users and regular transfer users alike were forced to pay for this \"data upload frenzy.\"\n\n## Second, what solution does EIP-7999 propose?\n\nThe answer is \"separate resource pricing, user-paid flat rate.\" This sounds contradictory, but it's actually a brilliant design.\n\nImagine going to a high-end restaurant. Each dish on the menu lists the different resources it consumes: \"Truffle Risotto (Precious Ingredients: High, Chef Time: Medium, Washing: Low).\" But as a guest, you don't need to pay separately for \"Precious Ingredients,\" \"Chef Time,\" and \"Cleaning.\" You simply say, \"I'm willing to spend a maximum of 500 yuan,\" and the restaurant intelligently allocates that 500 yuan to cover all costs.\n\nThe EIP-7999 mechanism is roughly as follows:\n\n**Separate Pricing**: The system tracks the supply and demand of different resources, such as execution gas, calldata, and storage, separately, with each resource having its own price adjustment mechanism. If execution gas demand is high, the base gas fee increases; if calldata demand is low, the base calldata fee decreases.\n\n**Unified Frontend Experience**: Users only need to set a single parameter: \"max_fee\" (the maximum amount of ETH I'm willing to pay for this transaction). There's no need to separately estimate the usage and price of various resources.\n\n**Smart Allocation**: Block builders face a \"multi-dimensional knapsack problem.\" They need to select a set of transactions from the transaction pool that does not exceed the limits of any resource and maximizes revenue. The system automatically allocates appropriate amounts from the user's \"max_fee\" to various resources.\n\nFor example, suppose you initiate a Layer 2 data upload transaction, which primarily consumes calldata and very little execution gas. In the old system, if the execution gas price spikes due to NFT minting, you'll have to pay a higher price. In the new system, your transaction costs are primarily determined by the price of calldata, and the surge in execution gas prices will have little impact on you.\n\nThis is like \"price discrimination\" in economics, but the better kind—pricing each resource based on its true scarcity, rather than a one-size-fits-all average price. Cloud service providers like AWS and Google Cloud already do this: they charge separately for CPU time, storage space, and network traffic, while still maintaining a simple user interface.\n\n## Third, why did this \"obviously better\" solution emerge only now?\n\nThere's an interesting paradox here: EIP-7999 seems like an obvious improvement, so why didn't Ethereum implement it sooner? The answer reveals a profound law of technological development: **Complex systems must begin with simple mistakes**.\n\nFirst, there's \"cognitive limitations.\" In the early days of Ethereum, understanding of blockchain resources was rudimentary. Much like early computers operating solely on the command line, the focus was on \"getting the damn thing running,\" not on optimizing the user experience. While a single gas fee was crude, it was simple and reliable, making it the best option at the time.\n\nSecond, there's the accumulation of \"technical debt.\" EIP-1559 is already a major reform, and coupled with EIP-4844's introduction of separate blob gas pricing, Ethereum currently has two coexisting fee systems: EIP-1559 for traditional transactions and EIP-4844 for blob data. One of the goals of EIP-7999 is to unify these two systems, but this requires a significant redesign of the underlying logic.\n\nThe third is the \"cost of complexity.\" Multi-dimensional resource pricing makes block packaging an NP-hard problem (roughly equivalent to the difficulty of the traveling salesman problem). This means that only the packagers with the greatest computing power and the best algorithms can effectively compete, potentially leading to further centralization of packaging. This is a real trade-off: more efficient resource allocation vs. a more decentralized network structure.\n\nFinally, there's \"path dependency.\" All existing tools—wallets, browsers, APIs, development frameworks—are designed around a single gas price. Changing the underlying fee logic would require upgrading the entire ecosystem, which incurs significant coordination costs.\n\nBut why is the time ripe now? Because of competitive pressure. In 2024, Ethereum's fee revenue was $2.48 billion, but Solana's grew by 2,838%, and Tron's doubled. Solana uses a \"localized fee market\" (competition within a specific account affects only that account's fees), while Cosmos uses an \"app chain\" (each dApp has its own chain and fee market). Facing these more agile competitors, Ethereum must upgrade its pricing model.\n\nThis reminds us of an important truth: perfection is often a powerful enemy. If Ethereum had waited for a complex solution like EIP-7999 to launch, it might still be on paper today. Starting with a rough, workable solution and then gradually optimizing it is the inevitable path for the development of all complex systems.\n\n## Historical Echoes: The \"Dimensional Curse\" and \"Dimensional Blessing\" in Economics\n\nInterestingly, the story of EIP-7999 repeats itself repeatedly throughout history.\n\n**Telecommunications Lesson**: Early telephone systems charged by the length of a call, regardless of whether you were using voice, fax, or data. Later, as network technology advanced, telecom companies began to separate billing: voice, SMS, and data usage each had different prices. Now, 4G/5G have gone a step further, offering QoS (Quality of Service) tiers, allowing users to pay for priority access to important data packets.\n\n**A Parallel Evolution of Cloud Computing**: In the 1990s, hosting services were essentially a single \"pay per server\" model. The emergence of AWS ushered in a revolution in \"pay per usage\" pricing: separate pricing for CPU, memory, storage, and network bandwidth. Now, this is even more detailed, with specialized pricing based on different types of computing tasks (CPU-intensive vs. memory-intensive vs. GPU-intensive).\n\n**A Financial Market Analogy**: In the early days of stock trading, there was only a single fee. As the market becomes more complex, differential pricing has emerged based on various dimensions, such as transaction amount, transaction frequency, and market vs. limit orders. High-frequency transactions even charge based on latency: a service with a 1 millisecond delay has a different price than a service with a 10 millisecond delay.\n\nBut there's a \"curse of dimensionality\": increasing dimensionality leads to an explosion of complexity. Economics teaches us that, in theory, pricing should be customized for each user's needs, but in practice, excessive granularity can make the system unmanageable.\n\nThe wisdom of EIP-7999 lies in finding a balance: the underlying separation is granular enough to reflect real costs, but the top-level interface is simple enough to maintain usability. This is classic wisdom in system design: **Hide complexity where users can't see**.\n\n## Future Challenges: When \"Simple User Experience\" Meets \"Complex Backend Logic\"\n\nEIP-7999 sounds promising, but its implementation faces several fundamental challenges:\n\n**Game Theory Challenge**: Multi-dimensional resource markets will give rise to new MEV (Maximum Extractable Value) strategies. Clever arbitrageurs may discover cross-dimensional arbitrage opportunities, such as deliberately creating artificial scarcity of a resource to manipulate its price. This requires more sophisticated economic models to prevent.\n\n**The Art of Parameter Tuning**: The base price, adjustment speed, and capacity limit for each resource must be precisely set. Misconfiguration could lead to a resource being permanently in excess or permanently scarce. This isn't just a technical issue, but also one of economics and game theory.\n\n**Complexity of governance**: Currently, the Ethereum community only needs to reach consensus on a few parameters, such as the gas limit. In the future, governance decisions may need to be made on dozens of parameters across multiple dimensions, significantly increasing the difficulty of reaching consensus.\n\n**Reshaping the competitive landscape**: As mentioned earlier, multi-dimensional optimization will raise the threshold for block inclusion. This could lead to the concentration of block inclusion in a small number of technologically advanced players, creating tension with Ethereum's core principle of decentralization.\n\nBut the most fundamental challenge may be psychological: **The human brain is not well suited to processing multi-dimensional complexity**. Even though technically users only need to set a \"max_fee,\" when transactions fail or fees are abnormal, they still need to understand the multi-dimensional logic behind them to effectively debug. This places higher demands on both wallet developers and user education.\n\n## Conclusion: When Technological Philosophy Meets Economic Reality\n\nFrom a higher perspective, EIP-7999 represents more than just a technological upgrade; it represents a philosophical shift: an evolution from \"unified simplicity\" to \"precise complexity.\"\n\nJust like biological evolution, simple single-celled organisms gradually develop complex multi-organ systems, each with specialized functions, yet functioning in a coordinated manner. Ethereum is undergoing a similar \"organ differentiation\" process: its \"organs\" of execution, storage, and data transmission are beginning to develop specialized \"metabolism\" mechanisms.\n\nBut this metaphor also reminds us that failures in complex systems are often more catastrophic than those in simpler ones. In a multi-organ organism, a failure in any one organ can be fatal; whereas single-celled organisms, while simple, are more resilient.\n\nThe success of EIP-7999 ultimately depends on whether the Ethereum community can strike a balance between \"precision\" and \"robustness.\" If implemented properly, it could usher in a new era of blockchain economics; if mishandled, it could become a negative example of over-engineering.\n\nRegardless, this proposal reminds us of an important truth: technological progress is not linear but spiral. Sometimes, we need to start with simple but workable solutions, accumulating sufficient experience and lessons before we can construct truly elegant solutions.\n\nAs Wittgenstein said, \"What can be said, let it be said clearly; what cannot be discussed, let us remain silent.\" In the blockchain world, we are learning how to clearly \"speak\" the complex concept of resource scarcity. EIP-7999 may be an important lesson in learning this language.",
  "references": [
    "https://www.panewslab.com/zh/articles/dsta4s61s5eo",
    "https://bitcoinethereumnews.com/ethereum/ethereum-introduces-unified-fee-market-with-eip-7999-proposal/",
    "https://cointelegraph.com/news/ethereum-proposes-unified-fee-simplify-transaction",
    "https://cryptopotato.com/vitalik-buterin-anders-elowsson-propose-eip-7999-for-ethereum-fee-overhaul/",
    "https://www.bitget.com/news/detail/12560604898621",
    "https://blockzeit.com/vitalik-buterin-proposes-multidimensional-fee-structure-for-ethereum/"
  ],
  "framework": "",
  "audio_file": "audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market.wav",
  "social_hook": "🛒 Why do supermarkets charge for meat by weight, mineral water by the number of bottles, and imported goods by value? EIP-7999 brings this...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-08T03:14:38.101Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment092.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment093.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment094.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment095.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment096.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment097.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-07-eip-7999-unified-multidimensional-fee-market/segment098.ts"
    ]
  }
}