{
  "id": "2025-01-20-taiko-preconfirmation-revolution",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-07-21",
  "language": "en-US",
  "title": "Taiko Pre-Confirmation Revolution: A Technological Breakthrough That Ends the Ethereum L2 Waiting Era",
  "content": "Have you ever wondered why it takes several minutes to actually complete after clicking \"Confirm Transaction\" when using Uniswap or Aave? This \"waiting hell\" that drives countless DeFi users crazy is the biggest pain point facing the current Ethereum Layer 2 solution. Today, we are going to talk about a technological innovation that may completely change this status quo - Taiko's preconfirmation mechanism.\n\n## What is the \"soft finality\" problem?\n\nTo understand the meaning of preconfirmation, we must first figure out what the \"soft finality\" problem is.\n\nImagine that you bought a cup of coffee online, and the store said, \"I received your order, but I have to wait for the bank to confirm the payment before I can start making it.\" In this case, your order is in an awkward state - the store knows you want to buy coffee, but is not sure whether the money has really arrived, so it dare not start to act.\n\nIn the current Layer 2 world, similar situations happen every day. When you make a transaction on Arbitrum or Optimism, L2 will immediately tell you that \"the transaction has been submitted\", but this is just a \"soft promise\". The real final confirmation needs to wait until the transaction is packaged on the Ethereum mainnet, and this process usually takes a few minutes to a few hours.\n\nThis kind of waiting is not only a psychological torture, but also a substantive business problem. For DeFi applications that need to respond quickly, this delay may cause arbitrage opportunities to disappear, liquidation failures, and even trigger chain reactions. Market fluctuations.\n\n## Taiko's \"Based Rollup\" Revolution\n\nTaiko proposed a revolutionary solution: Based Rollup with a pre-confirmation mechanism. The name sounds very technical, but its core concept is actually very simple - let the validators of the Ethereum mainnet directly participate in the transaction confirmation process of L2.\n\nThe traditional L2 architecture is like an independent little kingdom, with its own \"king\" (centralized sorter) to determine the transaction order, and then regularly report to the \"emperor\" (Ethereum mainnet). Taiko's Based Rollup is more like a municipality, where the ministers of the \"emperor\" (Ethereum validators) directly manage daily affairs.\n\nThis architectural change brings three key advantages:\n\n**Decentralization improvement**: No longer relying on a single sorter, but leveraging Ethereum's existing decentralized validator network. It's like moving from a dictatorship to a federation, with more decentralized power.\n\n**Enhanced security**: The security of transactions is inherited directly from the Ethereum mainnet, rather than relying on additional trust assumptions. This is equivalent to storing your assets in the central bank instead of a local bank.\n\n**Improved interoperability**: Collaboration with other components of the Ethereum ecosystem is more seamless, just like people who speak the same language can communicate more easily.\n\n## Preconfirmers: \"Couriers\" of the New Era\n\nIn Taiko's system, preconfirmers play a vital role. They are like \"next-day delivery\" service providers in the express delivery industry, willing to take on extra responsibilities and risks for faster services.\n\nSpecifically, pre-confirmers are Ethereum validators who pledge a certain amount of ETH or TAIKO tokens and then promise users: \"I guarantee that your transaction will be included in the next block, and the order is what I tell you now.\"\n\nThis promise is not just empty words, but is backed by real money. If the pre-confirmer breaks the promise - for example, the transaction is not included in the promised order, or it is not included at all - their pledged funds will be \"slashed\", that is, confiscated.\n\nThe cleverness of this mechanism is that it creates an economic incentive system:\n\n**Users get instant confirmation**: No need to wait for mainnet confirmation, the transaction is reliably guaranteed in the pre-confirmation stage.\n\n**Pre-confirmers earn income**: They can charge users a certain fee as a reward for providing fast confirmation services.\n\n**Overall network benefits**: Faster confirmation speed improves the user experience of the entire ecosystem, attracting more applications and users.\n\n## Economic model: diversified sources of income\n\nTaiko has designed a diversified income model for pre-confirmers, just like a successful business empire will not rely on a single source of income.\n\n**Pre-confirmation fee**: This is the most direct source of income. Users are willing to pay extra fees to get instant confirmation, just like they are willing to pay for SF Express's next-day delivery service.\n\n**Base fee sharing**: After Taiko's Ontake upgrade, pre-confirmers can get a considerable proportion of the base fee, which is equivalent to getting a \"dividend\" from network activities.\n\n**Sequencing rights auction**: Taiko plans to introduce the concept of \"sequencing tickets\", and pre-confirmers can purchase sequencing rights within a specific time period. This is like the airport's take-off and landing schedule, and airlines need to pay higher fees for the golden time period.\n\n**L2 PBS (proposer-builder separation)**: Pre-confirmers can outsource the work of block construction to professional builders and focus on verification and confirmation work. This division of labor and cooperation model can further improve efficiency and income.\n\n## Technical Implementation: The Miracle of 20 Milliseconds\n\nAt this point, you may ask: \"This sounds great, but can it really be done?\"\n\nThe answer is yes, and there is actual test data. On Taiko's Helder test network, pre-confirmation has achieved an amazing 20 millisecond response time. You know, this is 15 times faster than the time it takes for a human to blink (300-400 milliseconds)!\n\nEven with a conservative estimate, Taiko's pre-confirmation speed can reach about 260 milliseconds, which is an order of magnitude faster than the confirmation time of mainstream L2 such as Arbitrum.\n\nThis speed increase is not only a technical breakthrough, but also a qualitative leap in user experience. Imagine that when you trade on a DEX, you can see the result almost immediately after clicking confirm. It feels like jumping from the dial-up era to the 5G era.\n\n## Profound impact on the DeFi ecosystem\n\nThe popularization of pre-confirmation technology will have a profound impact on the entire DeFi ecosystem, and these changes may redefine our understanding of decentralized finance.\n\n**High-frequency trading becomes possible**: When the confirmation time is shortened to milliseconds, many high-frequency trading strategies that were previously common in traditional financial markets will become feasible in DeFi. This will bring higher liquidity and smaller spreads to the market.\n\n**Arbitrage efficiency is greatly improved**: Arbitrage is an important mechanism to maintain price balance in the DeFi market. Faster confirmation speed means that arbitrageurs can capture and correct price deviations faster, thereby improving the efficiency of the entire market.\n\n**Combinatorial experience optimization**: A major feature of DeFi is its \"Lego brick\" composability. When the response speed of each component is greatly improved, complex multi-step transactions will become smoother and the user experience will be significantly improved.\n\n**New application scenarios emerge**: Just as the upgrade from 3G to 4G has spawned an explosion of mobile Internet applications, pre-confirmation technology may also spawn new DeFi applications that we cannot imagine now.\n\n## Risks and Challenges: There is no perfect solution\n\nOf course, any technological innovation is not without cost, and the pre-confirmation mechanism also faces some potential risks and challenges.\n\n**Economic attack risk**: If collusion occurs between pre-confirmers, they may manipulate the order of transactions to obtain improper benefits. This is like employees of a courier company colluding to delay the delivery of certain packages to make a profit. However, Taiko's slashing mechanism and diversified validator network have largely reduced this risk.\n\n**Centralization concerns**: Although Based Rollup is more decentralized in theory, if only a few pre-confirmers provide services, the system may still face centralization risks. This requires economic incentives to encourage more participants to join.\n\n**Technical complexity**: The pre-confirmation mechanism increases the technical complexity of the system, which may bring new vulnerabilities and attack vectors. Like any complex mechanical system, the more parts there are, the greater the possibility of failure.\n\n**Regulatory uncertainty**: As DeFi becomes closer to the performance of traditional financial markets, regulators may impose stricter regulatory requirements on it. This change in the regulatory environment may affect the development direction of the pre-confirmation mechanism.\n\n## Comparison with other solutions\n\nTaiko is not the only player in the L2 expansion arena. Let's see how it compares with other major competitors:\n\n**vs. Optimism/Arbitrum**: These old L2s adopt a centralized sorter model. Although they can provide good performance in the short term, they face challenges in decentralization and censorship resistance in the long run. Taiko's Based Rollup fundamentally solves this problem.\n\n**vs. Shared Sorting Network**: Projects such as Espresso and Astria are also trying to solve the problem of sorter centralization, but they use independent shared sorting networks. In contrast, Taiko directly uses Ethereum's validator network to reduce additional trust assumptions.\n\n**vs. ZK Rollups**: ZK Rollups such as zkSync and Polygon zkEVM have advantages in security, but are usually slower in transaction confirmation speed. Taiko's pre-confirmation mechanism greatly improves the confirmation speed while maintaining high security.\n\n## Milestones in 2024 and Outlook for 2025\n\n2024 is a historic year for Taiko. On May 27, Taiko was successfully launched on the Ethereum mainnet, becoming the first Based Rollup, marking an important progress in the L2 technology roadmap.\n\nThe Ontake hard fork in October was an important node for technological breakthroughs, introducing initial support for transaction pre-confirmation and significantly improving the EIP-1559 implementation of L2. This upgrade not only improves the efficiency of block proposers, but also lays the foundation for the scalability of the network.\n\nLooking ahead to 2025, Taiko plans to implement the first complete pre-confirmation protocol at the beginning of the year. According to the cooperation plan with Nethermind, the pre-confirmation function will be deployed in two phases: the first phase will limit the pre-confirmation function to a group of authorized participants, and the second phase plans to gradually expand its scope of application.\n\nAt the same time, Taiko is also developing a next-generation rollup design called Gwyneth, which will have synchronous composability based on pre-confirmation. This represents the cutting-edge results of Taiko's research work in the second half of 2024, and will also be a key development direction in addition to the main chain.\n\n## Conclusion: The beginning of a new era\n\nBack to the coffee shop example we mentioned at the beginning. Taiko's pre-confirmation mechanism is like introducing an advanced real-time payment system. Once the customer places an order, the store can immediately confirm that the payment has been received and can start making coffee immediately. This immediacy not only improves the customer experience, but also improves the efficiency of the entire business process.\n\nOn a larger scale, pre-confirmation technology may become a key technology to push DeFi to the next stage of development. It not only solves the confirmation delay problem currently faced by L2, but also lays the foundation for building more complex and more responsive financial applications.\n\nOf course, the development of technology is never smooth sailing. The pre-confirmation mechanism still needs to undergo more practical tests, and the relevant economic models and governance mechanisms also need to be continuously improved in practice. But for now, this direction is full of hope.\n\nPerhaps in the near future, when we look back on the development of DeFi, we will mark 2024-2025 as an important turning point - this is the beginning of our farewell to the \"waiting era\" and the beginning of the \"instant era\". And Taiko's pre-confirmation revolution is likely to be one of the important forces driving this change.\n\nAfter all, in this fast-paced digital age, who is willing to wait for a few minutes for a simple transaction?",
  "references": [
    "https://news.qq.com/rain/a/20241118A06RJD00",
    "https://taiko.mirror.xyz/PhlvGdIaY3-ZQ1DqI9uM5LxrWGWLAzLI84rkxhvPKmM",
    "https://taiko.mirror.xyz/ejciROGOGM9L_DuuqM3KloZan0EQR73fJt8qzTZmVzg",
    "https://taiko.mirror.xyz/mg8H0IuGaG0S7aWHG1bPygYpaEDxqYmW-vyfmL9LeFY",
    "https://taiko.mirror.xyz/7dfMydX1FqEx9_sOvhRt3V8hJksKSIWjzhCVu7FyMZU",
    "https://4pillars.io/en/articles/preconfirmation-feat-taiko",
    "https://taiko.mirror.xyz/eRgfbv6rYoAYhFPzXWQIIMShaUO2yTfqT0BCc64Sgxc",
    "https://docs.taiko.xyz/taiko-alethia-protocol/protocol-design/contestable-rollup/",
    "https://blockchain.news/news/taiko-nethermind-advance-ethereum-rollup-infrastructure"
  ],
  "audio_file": "audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution.wav",
  "social_hook": "🚀 Are you still waiting for DeFi transactions? Taiko pre-confirmation technology is about to end the \"waiting hell\" of Ethereum L2! Say goodbye to...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-21T11:06:05.982Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-01-20-taiko-preconfirmation-revolution/segment078.ts"
    ]
  }
}