{
  "id": "2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-08-18",
  "language": "en-US",
  "title": "When Zero-Knowledge Proofs Are No Longer Just a Compression Tool: Why is Digital Sovereignty, Not Scaling, the Ultimate Battleground for ZK Technology?",
  "content": "The ancient Chinese philosopher Zhuangzi once said, \"Know the white, but guard the black.\" The profound meaning of this saying is that while it's important to know how to reveal, it's even more important to know how to conceal. In the digital age, this ancient wisdom has surprisingly found its most modern technological expression—zero-knowledge proofs (ZK). While we're still ecstatic about the airdrops of zkSync and Starknet, do we realize that we're witnessing a digital revolution even more profound than blockchain scaling?\n\nImagine this scenario: You're at a nightclub and want to prove you're over 18. Traditionally, you'd have to show your ID, revealing everything from your name, address, and birthday. Now, there's a \"digital bond\" technology that allows your phone to show the bondholder a green checkmark. This checkmark mathematically guarantees with absolute certainty that you are over 18, yet the bondholder knows nothing else about you. This is the beauty of zero-knowledge proofs—you can prove a fact without revealing any unnecessary details.\n\nOn the surface, this is a technical issue about improving blockchain performance; in reality, it's a philosophical question about redefining the boundaries of trust and privacy in the digital world.\n\nFirst, how is ZK technology generally understood today?\n\nIn most people's minds, zero-knowledge proofs are synonymous with ZK Rollups, and ZK Rollups are synonymous with \"making Ethereum faster and cheaper.\" This understanding isn't incorrect, but it's certainly overly narrow.\n\nAmong the most successful applications to date, ZK-Rollups are truly the most impressive commercial implementation of zero-knowledge proof technology. Like a brilliant \"compression master,\" they can bundle hundreds or even thousands of transactions into a concise proof, then tell the Ethereum mainchain, \"Trust me, these transactions are valid.\" The mainchain only needs to verify this small proof, rather than re-running all transactions, greatly improving processing efficiency.\n\nThe market's enthusiastic response is understandable. From StarkNet to zkSync, the technical competition among major teams has revolved almost entirely around \"EVM compatibility\" and \"gas fees.\" Capital has also invested its preferences with real money, creating a booming scene. But this also creates a kind of tunnel vision—we seem to assume that ZK's mission is solely to solve blockchain's scalability problem.\n\nIt's like using an iPhone solely for making phone calls. While the functionality is useful, it falls far short of the technology's true potential. When we view ZK simply as a \"compression tool,\" we overlook its essence as a \"trust tool.\" The revolutionary nature of ZK technology lies not in making existing systems more efficient, but in enabling us to build entirely new types of digital interactions.\n\nDawn Song, a computer science professor at the University of Berkeley, once said, \"Zero-knowledge proofs don't make the old world faster; they make a new world possible.\" The core characteristic of this new world is the shift of trust from \"trust in institutions\" to \"trust in mathematics.\"\n\n**Second, what are the three high-potential battlefields for ZK technology?**\n\nWhen we step outside the framework of scaling, three broader application areas for ZK technology become clear: verifiable computation, decentralized identity, and controllable transparency.\n\n**Verifiable Computation: Making AI Trustworthy**\n\nImagine you want to use a complex AI model to analyze your medical data. But how do you know the model hasn't been maliciously tampered with? How can you be sure that the results you receive are truly the output of the AI's honest computation? To explain it with a \"magic soufflé\" metaphor: you have a secret, complex recipe (the AI model), and your client wants to confirm that you've used only the promised high-quality organic ingredients. You bake a soufflé in a special glass oven (a ZK prover). When finished, the oven produces not only the soufflé (the result) but also a unique shimmering pattern on the glass (the proof). A food inspector can analyze the pattern on the glass and confirm with absolute certainty that you followed the correct recipe and ingredients, without ever needing to know your secret formula.\n\nThis is the power of ZKML (Zero-Knowledge Machine Learning). Pioneers like Modulus Labs are exploring how to generate zero-knowledge proofs for AI reasoning, allowing users to be confident that the AI results they receive have not been censored or manipulated. Projects like RISC Zero are building universal ZK virtual machines that enable the generation of ZK proofs for any type of computation, opening the door to decentralized, verifiable cloud computing.\n\n**Decentralized Identity: Your Web3 Native Passport**\n\nIn the current Web3 world, our \"identity\" is crudely simplified to a wallet address, unable to capture the complexities of social relationships and trustworthiness. ZK-DID allows us to engage in \"selective disclosure\"—proving to a DeFi protocol that your credit score is above a certain threshold without revealing your entire assets, proving you're a genuine user in a DAO vote without revealing your identity, and proving to a gaming platform that you're over 18 without showing your ID number.\n\nPolygon ID has built a complete open-source framework for this purpose, zkMe specializes in decentralized KYC solutions, and even large-scale experiments like Worldcoin are leveraging ZK technology to ensure the separation of \"personality verification\" from on-chain behavior. This will foster a native on-chain reputation system, transforming our digital identities into more than just cold, impersonal addresses, becoming a rich, three-dimensional \"soul\" controlled by our own sovereignty.\n\n**Controllable Transparency: From Radical Transparency to Smart Privacy**\n\nEthereum's transparency is a double-edged sword—it ensures fairness and accountability, but also exposes the financial status of all users. The future trend is for privacy features to be seamlessly integrated into mainstream smart contract platforms. Enterprises can conduct confidential supply chain financial settlements, DAOs can anonymously distribute salaries, and individuals can privately transfer assets.\n\nAztec Network is building an encrypted ZK-Rollup to bring a native privacy layer to Ethereum. Aleo is designed from the ground up for privacy, with the goal of creating a smart contract platform that is private by default. This requires a shift from \"full transparency\" to \"controlled transparency\"—data is private by default, but owners can grant access to specific parties as needed.\n\n**Third, why do most people underestimate the transformative potential of ZK?**\n\nUnderestimation of the potential of ZK technology often stems from three cognitive limitations: fear of technical complexity, the trap of linear thinking, and reliance on the status quo.\n\n**Fear of Technical Complexity**: Zero-knowledge proofs sound intimidating. The concepts of cryptography, mathematical proofs, and circuit design make most people daunted. In reality, users don't need to understand the TCP/IP protocol to access the internet, nor do they need to know AES encryption to communicate securely. The widespread adoption of ZK technology will similarly be achieved through abstracted tools and interfaces. Polygon ID's mobile wallet can already generate IDs in seconds, providing a user experience comparable to scanning a QR code.\n\n**Linear Thinking Trap**: Many people tend to view technological development linearly—ZK makes transactions faster, so its value lies in increased transaction speed. However, true technological revolutions are often nonlinear. They don't improve existing things, but rather enable entirely new things. For example, the value of the internet lies not in making email faster, but in enabling entirely new human activities, such as social networking, e-commerce, and remote work.\n\n**Status quo path dependency**: We've become accustomed to our current digital lifestyles—accepting data collection from giant tech companies, trusting the calculations of centralized institutions, and choosing between transparency and privacy. ZK technology challenges these seemingly \"natural\" assumptions, but changing underlying behavioral and business models requires time and education.\n\nFurther resistance comes from vested interests. The current digital economy is largely built on data asymmetry and information monopolies. Google's business model relies on knowing everything about its users, and banks' competitive advantage comes from exclusive control over customer data. The widespread adoption of ZK technology will redistribute this information power, and naturally, it will encounter strong institutional resistance.\n\nIn his book \"Why Nations Fail,\" MIT economist Daron Acemoglu argues that the greatest obstacle to institutional change is often not technological, but political-economic. The real challenge for ZK technology lies not in generating proofs faster, but in convincing existing power structures to accept a more decentralized future.\n\n**Philosophical Reflection: The True Meaning of Digital Sovereignty**\n\nWhen we discuss the future of ZK technology, we are actually discussing a more fundamental question: How much sovereignty should individuals have in an increasingly digital world?\n\nThe traditional digital world forces us to choose between efficiency and privacy, and to compromise between convenience and control. ZK technology offers us a glimpse into the possibility of a third path: a digital world that is both efficient and private, convenient yet maintains control.\n\nBut the technology itself is not neutral. ZK technology can be used to protect personal privacy, or it can be used to build more covert surveillance systems. The key lies in how we design and deploy these technologies, and the governance mechanisms we establish.\n\nAmerican cryptographer Matthew Green once said, \"Privacy isn't about hiding bad things, it's about protecting good things.\" Perhaps the ultimate value of ZK technology lies in its ability to protect \"good things\" while still being able to prove and verify the facts we claim.\n\nIn this sense, zero-knowledge proof is not just a technology but a philosophy—it teaches us that truth and privacy are not mutually exclusive, that trust and verification can coexist, and that individual sovereignty and collective collaboration can be unified. This is perhaps the best interpretation of Zhuangzi's \"know the white, guard the black\" in the digital age: we must have both the ability to prove the truth and the power to protect privacy.\n\nWhen evaluating ZK projects, beyond focusing on TPS and gas fees, it's worth asking more complex questions: Does it make our digital world more trustworthy? Does it strengthen our control over our identities and data? Does it contribute to a fairer and more individual-protective future? After all, what we are betting on is not just a technology, but a vision for digital civilization.",
  "references": [
    "https://www.panewslab.com/zh/articles/o6s8yx8c9kfz",
    "https://docs.polygon.technology/polygon-id/",
    "https://www.risczero.com/",
    "https://www.modulus.xyz/",
    "https://aztec.network/",
    "https://aleo.org/",
    "https://zk.me/",
    "https://worldcoin.org/",
    "https://eprint.iacr.org/2021/370.pdf",
    "https://arxiv.org/abs/2109.00528",
    "https://blog.succinct.xyz/introducing-sp1/",
    "https://www.paradigm.xyz/2022/04/zk-hardware",
    "https://a16zcrypto.com/posts/article/zero-knowledge-canon/",
    "https://vitalik.ca/general/2022/06/15/using_snarks.html",
    "https://hackmd.io/@aztec-network/ByzgNxBfd",
    "https://medium.com/aleo/zero-knowledge-primitives-verifiable-computation-in-aleo-2db5b8e76cb1"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty.wav",
  "social_hook": "🧠 From Zhuangzi's \"Know the White, Keep the Black\" to ZK Technology: When zero-knowledge proofs are no longer just a scaling tool but redefine...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-18T05:34:38.547Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-08-17-zero-knowledge-beyond-rollups-digital-sovereignty/segment068.ts"
    ]
  }
}