{
  "id": "2025-07-19-blockchain-parallel-computing-revolution",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-07-20",
  "language": "en-US",
  "title": "The blockchain parallel revolution: When the \"impossible triangle\" meets the parallel universe",
  "content": "Have you ever wondered why banks can process millions of transactions around the world at the same time, while blockchain is still struggling to process thousands of transactions per second? In 2024, a \"parallel revolution\" is quietly unfolding in the blockchain world, which not only solves the speed problem, but also completely redefines our imagination of decentralized computing.\n\nMonad Labs has just completed an epic financing of $225 million, which is the largest blockchain infrastructure investment in 2024. Solana's TVL soared 2000% in 2024, becoming the second largest DeFi ecosystem after Ethereum. At the same time, Sui and Aptos, two \"Move language rising stars\", are redefining the way smart contracts are written with a new object-oriented model. These seemingly independent developments actually point to the same revolutionary trend: blockchain is evolving from a \"single-threaded world\" to a \"multi-threaded universe\".\n\n## Breaking the shackles: Why does blockchain need \"parallel thinking\"?\n\nLet's first understand a basic question: Why is the traditional blockchain so slow?\n\nImagine a supermarket with only one checkout counter. No matter how many customers are in line, the cashier can only check out the customers one by one. If the person in front has not finished checking out, the person behind must wait. This is how traditional blockchains work - all transactions must be executed in sequence, one after another.\n\nThis design seems simple, but it creates a fundamental limitation: no matter how powerful your hardware is, the network's processing power is constrained by this \"serial execution\" mode. Ethereum can only process an average of 27 transactions per second, and Bitcoin only 7.\n\nModern supermarkets have long learned to open multiple checkout counters to allow customers to check out in parallel. The question is: Can blockchain also learn this trick?\n\nThe answer is yes, but it is much more complicated than you think.\n\n## A new solution to the \"impossible triangle\"\n\nThe blockchain world has a famous \"impossible triangle\" theorem: security, decentralization, and scalability, you can only have two of them at the same time. Traditionally, Bitcoin and Ethereum have chosen security and decentralization at the expense of scalability.\n\nBut parallel computing provides a new perspective: perhaps the problem is not to choose between the three, but that we need to redefine \"scalability\" itself.\n\nThe core idea of parallel computing is: if we can identify transactions that are independent of each other (such as Alice transferring money to Bob and Charlie transferring money to David at the same time), we can process them at the same time without waiting. It's like in a supermarket, if two customers buy completely different items, in theory they can check out at the same time without any conflict.\n\nThe key is: how to identify and handle these \"independences\"?\n\n## Three different parallel universe routes\n\nCurrently, the blockchain world is exploring three completely different parallel computing routes, each representing a different philosophy and technical trade-off:\n\n### Route 1: EVM compatibility - \"new wine in old bottles\"\n\n**Representatives: Monad, MegaETH**\n\nThe core idea of this route is: \"If the Ethereum ecosystem is already so rich, why not just make it faster, but start from scratch?\"\n\nMonad's approach is particularly interesting: it uses a technique called \"optimistic parallel execution\". Imagine that you are a very confident chef and you start preparing multiple dishes at the same time, assuming that they will not interfere with each other. If you later find that two dishes need to use the same pan, you rearrange the order.\n\nSpecifically:\n- **Speculative execution**: The system assumes that there is no conflict between transactions and executes multiple transactions at the same time\n- **Conflict detection**: Detect whether a conflict actually occurs during the execution process (for example, two transactions both modify the balance of the same account)\n- **Rollback re-execution**: If a conflict is found, the result of one of the transactions is canceled and re-executed in order\n\nMonad's $225 million financing shows the market's confidence in this approach. The key advantage is that existing Ethereum applications can be directly migrated without rewriting the code.\n\nBut this approach also has a price:\n- **Computational waste**: If conflicts are frequent, a lot of calculations will be wasted on rolling back\n- **Complexity**: The implementation of optimistic execution is extremely complex and prone to difficult-to-debug errors\n- **Hardware requirements**: Powerful hardware is required to support parallel computing\n\n### Route 2: Native parallelism - \"Reinventing the wheel\"\n\n**Representatives: Solana, Sui, Aptos**\n\nThe philosophy of this route is: \"Since you want to do parallel computing, why not design it for this from the beginning?\"\n\n**Solana's \"explicit dependency\" model**\n\nSolana requires developers to clearly state in each transaction: \"Which accounts do I want to read and which accounts do I want to modify.\" This is like telling the supermarket manager in advance: \"I want to buy milk and bread\", so that the manager can arrange you to the corresponding checkout counter in advance.\n\nThe advantage of this design is that it is extremely efficient - Solana can theoretically reach 65,000 TPS. In 2024, Solana's TVL soared 2000%, proving the practicality of this approach.\n\n**Sui's \"object-oriented\" revolution**\n\nSui goes a step further and views the entire blockchain state as composed of countless \"objects\". Each object has clear ownership, and only the owner can modify it. It's like assigning each customer a dedicated shopping cart, and shopping carts from different customers will never conflict.\n\nSui achieved a tenfold increase in TVL from $200 million to $2 billion in 2024, showing the huge potential of the object-oriented model.\n\n**Aptos's \"optimistic parallel\" evolution**\n\nAptos uses a technology called \"Block-STM\", which combines optimistic parallel execution and multi-version concurrent control. Simply put, it allows the system to process multiple versions of data at the same time, reducing the cost of rolling back when conflicts occur.\n\nBut the native parallel route also has challenges:\n- **Learning cost**: Developers need to learn new programming languages (Rust, Move)\n- **Ecological reconstruction**: Cannot directly use Ethereum's rich ecosystem\n- **Hardware threshold**: Solana's validators require extremely high hardware configuration\n\n### Route 3: Actor model school - \"distributed computing\"\n\n**Representatives: AO (Arweave), Internet Computer Protocol**\n\nThis route adopts a completely different idea: instead of letting one system handle multiple tasks in parallel, it is better to let multiple independent systems handle their own tasks, and then coordinate through message passing.\n\nImagine how modern companies operate: different departments (marketing, finance, R&D) operate independently and coordinate through emails and meetings. Each department can operate efficiently within, and the coordination between departments is asynchronous.\n\n**AO's \"super parallel computer\" **\n\nAO's design philosophy is to build a \"super parallel computer\" that completely separates computing, storage, and message passing:\n- **Computing unit**: responsible for executing program logic\n- **Storage unit**: Persistent storage based on Arweave\n- **Message unit**: responsible for communication between different processes\n\nThis separation allows each component to scale independently, theoretically achieving unlimited horizontal expansion.\n\n**ICP's \"subnet architecture\"**\n\nInternet Computer adopts the concept of \"subnet\", each subnet is an independent blockchain that can run its own smart contract (called \"Canister\"). Different subnets communicate securely through \"chain key cryptography\".\n\nAdvantages of the Actor model:\n- **Unlimited scalability**: Theoretically, the number of Actors can be increased indefinitely\n- **Fault isolation**: A problem with one Actor will not affect other Actors\n- **Asynchronous communication**: Reduces the overhead of synchronization waiting\n\nChallenges:\n- **Complexity**: Debugging and managing distributed systems is extremely complex\n- **Consistency**: Maintaining the consistency of global state becomes difficult\n- **Development paradigm**: A completely new way of thinking is required to design applications\n\n## Reality check: Data speaks\n\nLet's see how these technical routes perform in the real world:\n\n**Fund flows show confidence**\n- Monad: $225 million (largest blockchain infrastructure investment in 2024)\n- Aptos ecosystem: TVL grew 376% to $573 million\n- Sui ecosystem: TVL doubled in 3 months to over $2 billion\n\n**User adoption shows strength**\n- Solana: 7,000 new developers in 2024, surpassing Ethereum’s developer growth for the first time\n- Solana: Over 2.2 million daily active wallets, transaction fees remain at $0.00025\n- Sui: Ecosystem has nearly 200 dApps, stablecoin market cap reaches $415 million\n\n**Technical indicators prove viability**\n- Solana: 65,000 TPS maintained in real environment, network availability reaches 99.99%\n- Aptos: Created a Layer 1 historical record of 156 million transactions per day\n- Sui: While maintaining high performance, it has achieved an ecological prosperity of more than 150 projects\n\n## Developers’ Choice Dilemma\n\nFor developers, choosing which parallel computing route to take is a complex decision:\n\n**If you prioritize “fast launch”**\n- Choose the EVM compatible route (Monad)\n- Existing Solidity code can be directly ported\n- Leverage a mature development toolchain\n- But bear the early risks of a new network\n\n**If you pursue “extreme performance”**\n- Choose the native parallel route (Solana, Sui, Aptos)\n- Need to learn new programming languages and development paradigms\n- Able to achieve the highest performance indicators currently\n- But spend more time learning new technologies\n\n**If you want “unlimited expansion”**\n- Choose the Actor model route (AO, ICP)\n- Need to rethink the application architecture\n- Can achieve true decentralized computing\n- But face higher development complexity\n\n## Hidden challenges: not a panacea\n\nAlthough parallel computing is powerful, it is not without cost:\n\n**New security challenges**\n\nParallel execution introduces new attack vectors. In traditional serialization systems, the order of transactions is determined, and it is difficult for attackers to exploit timing issues. But in parallel systems, different execution orders may lead to different results, creating new opportunities for \"MEV attacks\" and \"front runner attacks\".\n\n**Debugging complexity**\n\nImagine debugging a problem in a kitchen with 1,000 chefs working at the same time. It is exponentially more difficult than debugging a kitchen with only one chef. Errors in parallel systems are often non-deterministic, difficult to reproduce and fix.\n\n**Hardware Arms Race**\n\nHigh-performance parallel computing requires powerful hardware support. Solana's validators need to be equipped with high-end CPUs, large-capacity memory, and fast storage. This may lead to new centralization risks: only resource-rich entities can run nodes.\n\n**Energy consumption considerations**\n\nAlthough parallel computing improves efficiency, powerful hardware equipment also consumes more electricity. This is an issue that cannot be ignored today when environmental awareness is increasing.\n\n## Competition: Who will have the last laugh?\n\nThe current competitive landscape presents interesting differentiated characteristics:\n\n**Solana: Master of balancing performance and ecology**\n- A huge DeFi ecosystem has been established\n- Outstanding performance in the fields of NFT and games\n- But it still needs to overcome the historical burden of network stability\n\n**Monad: \"Performance Upgrade Package\" for EVM Ecosystem**\n- Huge amounts of financing show the market's emphasis on EVM compatibility\n- The mainnet launch in 2025 will be a key test\n- Success or failure will determine the future of the EVM compatibility route\n\n**Sui & Aptos: A new generation of technology comparison**\n- The two heroes of the Move language ecosystem\n- Sui is temporarily ahead in TVL growth\n- Aptos continues to make breakthroughs in technological innovation\n\n**AO & ICP: Pioneer of future computing**\n- Represents the most radical technical route\n- Market acceptance is still being established\n- May become the next generation of Web3 infrastructure\n\n## Investment and Opportunities: Betting on the Future\n\nFor different types of participants, the parallel computing revolution provides multiple levels of opportunities:\n\n**Opportunities for technical developers**\n1. **Become a multi-technology stack expert**: Master multiple languages such as Solidity, Rust, and Move\n2. **Specialize in parallel computing optimization**: Learn how to design efficient parallel algorithms\n3. **Cross-chain development experience**: Understand the advantages and disadvantages of different parallel models\n\n**Opportunities for project founders**\n1. **Choose the right technology stack**: Choose the most suitable parallel architecture based on application characteristics\n2. **Leverage performance advantages**: Develop applications that are only possible in a high-performance environment\n3. **Seize the ecosystem**: Establish a leading position on emerging parallel chains\n\n**Investor opportunities**\n1. **Infrastructure investment**: Focus on infrastructure projects related to parallel computing\n2. **Ecosystem investment**: Invest in native applications built on parallel chains\n3. **Toolchain investment**: Focus on infrastructure such as development tools, wallets, and bridges\n\n## Looking to the future: The next chapter of parallel computing\n\n**Short-term outlook (2025-2026)**\n\n- Monad mainnet goes online to test the actual effect of EVM-compatible parallel computing\n- Solana ecosystem further matures and may challenge Ethereum's DeFi dominance\n- Sui and Aptos establish clearer differentiation in their respective areas of strength (gaming vs DeFi)\n\n**Medium-term vision (2026-2028)**\n\n- Cross-chain parallel computing becomes the standard: seamless interoperability between different parallel chains\n\n- New application categories emerge: innovative applications that are only possible in a parallel environment\n\n- Regulatory framework matures: governments begin to recognize and regulate the use of high-performance blockchains\n\n**Long-term impact (2028+)**\n\n- \"Blockchain performance\" is no longer a limiting factor: attention shifts to user experience and practicality\n\n- Traditional Internet applications begin to adopt blockchain backends on a large scale\n\n- New business models emerge: a new economic form based on truly decentralized high-performance computing\n\n## Conclusion: The Great Leap from Serialization to Parallelism\n\nThe blockchain parallel computing revolution is not just a technological upgrade, it represents a fundamental shift in the decentralized computing paradigm. From Bitcoin's \"one block at a time\" to Ethereum's \"global state machine\" and now the \"parallel universe\", each evolution has redefined our understanding of digital value and decentralization.\n\nThe real significance of this revolution is that it makes it possible for blockchain to achieve performance comparable to traditional systems for the first time without sacrificing decentralized characteristics. When Solana can process 65,000 TPS, when Sui's TVL doubles in three months, and when Monad receives $225 million in investment, they are not only demonstrating technical strength, but also proving an important argument: the \"impossible triangle\" may not be an unbreakable iron law.\n\nThe future Web3 world may be like this: you run migrated DeFi protocols on Monad, perform high-frequency transactions on Solana, play real-time strategy games on Sui, and run large-scale AI models on AO. Different parallel architectures will play their advantages in their respective areas of expertise, and cross-chain bridge technology will allow users to seamlessly shuttle between these \"parallel universes\".\n\nFor us today, understanding the significance of the parallel computing revolution may be more important than paying attention to the price fluctuations of any single project. Because in this great leap from serialization to parallelization, the real wealth will belong to those who can understand and participate in building the next generation of decentralized infrastructure.\n\nWhen blockchain is no longer limited by performance, and when decentralized applications can provide the same or even better user experience as traditional applications, we will truly enter the golden age of Web3. This era is characterized not by the complexity of technology, but by the transparency of technology-users no longer need to understand the underlying parallel computing mechanism to enjoy the benefits it brings.\n\nBlockchain parallel computing teaches us an important truth: real innovation often comes from rethinking basic assumptions. When the entire industry was accepting the assumption that blockchain was necessarily slower than traditional systems, the pioneers of parallel computing chose to challenge this assumption. Today, their success is redefining the boundaries of what is possible for blockchain.",
  "references": [
    "https://www.panewslab.com/zh/articles/1h41rt2m",
    "https://cointelegraph.com/news/monad-funding-optimistic-parallelization-blockchain",
    "https://www.coindesk.com/business/2024/04/09/blockchain-developer-monad-labs-raises-225m-led-by-paradigm",
    "https://blockworks.co/news/paradigm-leads-monad-parallel-evm-fundraise",
    "https://www.monad.xyz/",
    "https://cryptotvplus.com/2025/01/defi-tvl-surged-211-to-214b-in-2024-solana-jumped-2000/",
    "https://solanafloor.com/news/inside-solana-s-record-year-unpacking-the-milestones-behind-de-fi-s-growth-in-2024",
    "https://blog.sui.io/2-billion-tvl-milestone-defi/",
    "https://www.vaneck.com/us/en/blogs/digital-assets/sui-vs-aptos-competitive-analysis-and-price-prediction/",
    "https://messari.io/report/state-of-aptos-q2-2024",
    "https://defillama.com/chain/Solana",
    "https://messari.io/compare/aptos-vs-sui"
  ],
  "audio_file": "audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution.wav",
  "social_hook": "🚀 Banks process millions of transactions per second, but blockchain is stuck at a few thousand transactions? The 2024 \"Parallel Revolution\" is...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-21T10:44:04.306Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment092.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment093.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment094.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment095.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment096.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment097.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment098.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment099.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment100.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment101.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment102.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment103.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment104.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment105.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment106.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment107.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment108.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-07-19-blockchain-parallel-computing-revolution/segment109.ts"
    ]
  }
}