{
  "id": "2025-09-17-ethgas-infrastructure-financialization",
  "status": "translated",
  "category": "ethereum",
  "date": "2025-09-19",
  "language": "en-US",
  "title": "When Ethereum starts charging reservation fees: How ETHGas turns uncertainty into a commodity",
  "content": "Imagine this scenario: You want to dine at the hottest restaurant in town on Saturday night, but you have no idea how long the wait will be or how much a table will cost. It sounds absurd, but this is precisely the reality of using Ethereum right now.\n\nA recent innovation called ETHGas claims to completely change the game. But more importantly, ETHGas reveals a profound insight about modern technological development: the most successful innovations often don't solve technical problems, but rather redefine business models.\n\n## Examining the Evolution of Blockchain from the Perspective of Restaurant Reservations\n\nLet's first examine how the restaurant industry addresses the \"uncertainty\" problem:\n\n**Phase 1: First-Come, First-Served**\n- Customers wait in line, unsure of how long they'll be waiting\n- Restaurants cannot predict customer traffic\n- Both parties bear the cost of uncertainty\n\n**Phase 2: Reservation System**\n- Customers can guarantee a seat, but the experience remains uncontrollable\n- Restaurants can plan customer flow, but bear the risk of no-shows\n- Some uncertainty is transferred and managed\n\n**Phase 3: Guaranteed Fee System**\n- High-end restaurants begin charging \"reservation fees\" or \"experience fees\"\n- Customers pay for certainty\n- Restaurant pricing management needs\n\nNow let's look at the evolution of blockchain:\n\n**Phase 1: First-come, first-served (Bitcoin era)**\n- Transaction inclusion order determined by miners\n- Users have no control over confirmation times\n- Simple and crude fee mechanism\n\n**Phase 2: Bidding mechanism (Ethereum's current situation)**\n- Highest bidders receive priority\n- Fee predictability is poor, with 12-second confirmation times\n- User experience deteriorates dramatically during network congestion\n\n**Phase 3: Reservation mechanism (ETHGas model)**\n- Users can \"reserve\" transaction confirmations in advance\n- Uncertainty is transformed into a tradable commodity through financial instruments\n- Predictable experience and transparent fees\n\nETHGas' four core strategies:\n\n1. 1. Millisecond Pre-Confirmation: Reducing time from 12 seconds to 3 milliseconds\n2. Financialization of Blockspace: Creating a futures market for transaction confirmations\n3. Providing stable income for validators: Through the \"Commit Boost\" module\n4. Providing gas fee rebates to users: Through participating dApps\n\n[Pre-confirmation means validators provide a guarantee of certainty before a transaction is officially on-chain, similar to restaurant reservation confirmations.]\n\nThe underlying logic behind this evolution is a common one: transforming uncertainty from a free \"pain\" into a valuable \"commodity.\"\n\n## Certainty Premium: Why People Pay for Predictability\n\nIn economics, there's a key concept called the \"certainty premium\" (the extra cost people are willing to pay to reduce uncertainty). This explains why:\n\n- People prefer insurance to luck.\n- Businesses are willing to lock in costs by signing long-term contracts.\n- Investors prefer stable returns to high-risk, high-return options.\n\nETHGas is effectively creating a \"certainty premium\" market for Ethereum.\n\n**Pain Points of the Traditional Model:**\n- **User Pain Point**: Unsure when transactions will be confirmed and how much they will be charged\n- **Developer Pain Point**: Unpredictable user experience\n- **Validator Pain Point**: High income volatility, dependent on network congestion\n\n**ETHGas's Solution:**\n\nImagine ETHGas building a \"confirmation futures exchange\" for Ethereum. Validators can sell their positions in future blocks in advance, just like a farmer selling future wheat in advance.\n\nHow it works:\n\n1. **Supply Side (Validators): Sell \"Priority Trading Positions\" in Upcoming Blocks in Advance\n2. **Demand Side (Applications/Users): Purchase the Right to Validate Transactions During a Specific Timeframe\n3. **Intermediary (ETHGas): Manage Risk, Provide Liquidity, and Earn Service Fees\n4. **Derivative Services: Provide Gas Fee Insurance for Applications and Cashback for Users\n\nThe ingenuity of this model lies in the fact that all participants gain greater certainty, and certainty itself becomes a tradable commodity.\n\n## Why Now? A Critical Inflection Point in Technological Maturity\n\nThe timing of the emergence of ETHGas is no accident. It coincides with a critical inflection point in Ethereum's development:\n\n**The technical foundation is sufficiently mature:**\n- Ethereum 2.0 has completed the PoS transition, and the validator infrastructure is stable.\n- The Layer 2 ecosystem is booming, demonstrating the market's immense demand for scalability.\n- DeFi lockup value exceeds $100 billion, and the economic scale is sufficient to support complex financial instruments.\n\n**However, user experience remains a bottleneck:**\n- Gas fees fluctuate dramatically, making them unaffordable for ordinary users.\n- 12-second confirmation times cannot support high-frequency transaction applications.\n- Developers need deep blockchain knowledge to optimize the user experience.\n\nThis situation is similar to the smartphone market in 2007: the technical components were already mature (touch screens, mobile networks, microprocessors), but no one had integrated them into a product that was easy for ordinary people to use until the iPhone arrived.\n\nETHGas' strategy is similar: not inventing new technology, but rather reorganizing existing technology to make complex blockchain infrastructure as predictable as traditional financial services.\n\n## Counterintuitive Insight: This isn't a technical problem, it's a business model problem.\n\nWhen most people see Ethereum's high gas fees and slow confirmation times, their first reaction is, \"This is a technical problem that requires a technical solution.\" But ETHGas offers a counterintuitive perspective: **This is actually a business model problem**.\n\n**Technical solution ideas:**\n- Increase TPS [transactions per second]\n- Reduce transaction costs\n- Shorten confirmation times\n\n**Business model solution ideas:**\n- Make costs predictable\n- Make confirmation times guaranteed\n- Shift risk to participants better suited to bear the burden\n\nThe key difference is that technical solutions attempt to eliminate problems, while business model solutions attempt to manage them.\n\nThis reminds me of the birth of the insurance industry. Maritime trade in the 17th century was fraught with risks: ships sinking, cargo being looted, and bad weather. People's first reaction was to improve ship design and navigation technology. But the real breakthrough came from Lloyd's of London's innovation: **not eliminating risk, but distributing and managing it**.\n\nThe logic behind ETHGas is similar: not making Ethereum perfect, but making its imperfections manageable and predictable.\n\n## The Double-Edged Sword of Financialization: Opportunities and Risks Coexist\n\nThe most controversial aspect of the ETHGas model is the \"financialization of blockchain space.\" This raises a fundamental philosophical question: **Should we turn infrastructure into a financial commodity? **\n\n**Supporters' Arguments:**\n- Financial instruments can efficiently allocate resources\n- Market mechanisms are more flexible than technological optimization\n- User experience improvements are tangible\n\n**Opponents' Concerns:**\n- Potentially recreates the inequalities of traditional finance\n- Increases system complexity and introduces new risks\n- Deviates from the original purpose of blockchain decentralization\n\nHowever, history shows us that the financialization of infrastructure is often an inevitable trend:**\n\n- **Railway Era**: The shift from government investment to bond financing gave rise to modern capital markets\n- **Telecommunications Era**: The shift from state-owned monopolies to market competition drove technological innovation\n- The Internet Era: Transforming from a military network into a commercial platform, it created a completely new economic model.\n\nEvery instance of infrastructure financialization has been accompanied by controversy, but it has also driven the widespread application of technology.\n\nPotential Risks of the ETHGas Model:\n1. Complexity Risk: Excessive financial intermediaries could lead to systemic failures.\n2. Inequality Risk: Large institutions could enjoy greater advantages over individual users.\n3. Regulatory Risk: Financialization could lead to stricter regulatory scrutiny.\n\nHowever, it also offers unique advantages:\n1. Transparency: The blockchain's public nature makes all operations auditable.\n2. Composability: Decentralized protocols can compete and innovate.\n3. Globality: Unrestricted by geographic location, lowering barriers to entry.\n\n## Competitive Landscape: Who will become the blockchain's \"determinism provider\"?\n\nThe success of ETHGas depends largely on whether it can win the competition. There are currently three main solutions:\n\n**Layer 2 Scaling** (Arbitrum, Optimism, Polygon):\n- **Advantages**: Really improves performance and reduces costs\n- **Challenges**: Requires user and asset migration, resulting in dispersed liquidity\n\n**Native High-Performance Blockchain** (Solana, Sui, Aptos):\n- **Advantages**: Designed from scratch, superior technical architecture\n- **Challenges**: Requires rebuilding the entire ecosystem\n\n**Financialization of ETHGas**:\n- **Advantages**: Maintains Ethereum's network effects, no migration required\n- **Challenges**: Increases system complexity, requiring financial risk management\n\nHistorically, solutions that maintain network effects while improving the user experience tend to prevail.\n\nTake the development of the credit card industry, for example: Before the 1970s, each bank had its own credit card system, requiring merchants to install multiple POS terminals. Visa's innovation wasn't creating a better credit card, but rather creating an interbank network, allowing credit cards from different banks to be used at the same merchant network.\n\nETHGas' strategy is similar: not to replace Ethereum, but to enable Ethereum's different participants to collaborate more efficiently.\n\n## Practical Impact on Average Users\n\nIf ETHGas is successfully deployed, what changes will average users experience?\n\n**Short-Term Impacts:**\n- **Instant Confirmation**: Transactions no longer require a 12-second wait\n- **Fee Transparency**: Applications can be informed of exact gas costs in advance\n- **Contactless Payment**: Many applications may directly cover gas costs for users\n\n**Long-Term Impacts:**\n- **Application Innovation**: Developers can build applications that require instant feedback\n- **Business Model Change**: From \"user pays\" to \"app pays\"\n- **Financial Service Access**: Complex DeFi operations become as simple as using a bank app\n\nBut be aware of potential negative impacts:\n\n**Possible Issues:**\n- **Hidden Costs**: Gas costs may be passed on to users in other forms\n- **Service Dependency**: If ETHGas fails, all applications that rely on it will be affected.\nCentralization Trend: This could lead to a handful of large service providers dominating the pre-confirmation market.\n\nThe key lies in balance: Can we maintain system stability and openness while improving the user experience?\n\n## Conclusion: A Triumph of Pragmatism or a Compromise of Idealism?\n\nThe story of ETHGas raises a fundamental question about technological development: When ideals conflict with reality, which side should we choose?\n\nThe blockchain ideal is decentralization, permissionlessness, and censorship resistance. But the reality is that most users simply want cheap, fast, and reliable services. ETHGas chose reality, solving the user experience problem with financialization.\n\nThis choice is neither entirely right nor entirely wrong. This reflects a universal principle of technological development: **Successful technologies tend to be those that strike a balance between ideals and realities**.\n\nUltimately, ETHGas's success will depend on whether it can demonstrate that complex financial instruments can indeed lead to a simpler user experience. If it can achieve this, it could become a significant milestone in the evolution of blockchain infrastructure. If it fails, it could become a cautionary tale of excessive financialization.\n\nWhatever the outcome, ETHGas has already sparked an important discussion: How should we choose between pursuing technological purity and improving the user experience? The answer to this question will determine the future direction of blockchain technology.",
  "references": [
    "https://www.panewslab.com/zh/articles/e565185f-b829-4a1f-bcdc-cf32fd327c2a",
    "https://ethereum.org/en/developers/docs/gas/",
    "https://docs.ethgaslabs.com/",
    "https://eips.ethereum.org/EIPS/eip-4844",
    "https://ethereum.org/en/roadmap/danksharding/",
    "https://notes.ethereum.org/@vbuterin/proto_danksharding_faq",
    "https://ethresear.ch/t/based-preconfirmations/17353",
    "https://ethereum.org/en/developers/docs/consensus-mechanisms/pos/",
    "https://docs.btcs.com/",
    "https://ultrasound.money/",
    "https://l2beat.com/",
    "https://dune.com/hildobby/gas-prices"
  ],
  "framework": "解讀分析式風格.md",
  "knowledge_concepts_used": [
    "certainty-premium",
    "pre-confirmation",
    "network-effect"
  ],
  "audio_file": "audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization.wav",
  "social_hook": "🏪 Ethereum is starting to charge reservation fees! ETHGas aims to turn uncertainty into a commodity: A look at the evolution of blockchain...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-19T13:15:44.045Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/ethereum/2025-09-17-ethgas-infrastructure-financialization/segment077.ts"
    ]
  }
}