{
  "id": "2025-07-25-swift-xbmt-global-financial-infrastructure",
  "status": "translated",
  "category": "macro",
  "date": "2025-08-05",
  "language": "en-US",
  "title": "The WhatsApp and FedEx of the Financial World: Decoding SWIFT and XBMT: How Global Money Flows Are Connected",
  "content": "Have you ever wondered how, when you swipe your credit card to make a purchase abroad or transfer money to a friend overseas, the money \"flies\" from your account to another country in seconds? Most people think it's simple, but in reality, you've just tapped into a global financial infrastructure more complex than the internet. Today, we'll discuss two systems you may never have heard of, yet they impact your life every day: SWIFT and XBMT.\n\nImagine this scenario: Your friend in New York urgently needs 10,000 RMB, and you decide to transfer it to them through your bank. You assume the bank will \"package\" your money and send it directly to them, just like express delivery. But the reality is, your money might go through 3-5 different banks, each charging a fee. The entire process takes 2-5 business days, and in the end, your friend might only receive 9,200 yuan.\n\nThis is why we need to understand SWIFT and XBMT—they represent the \"postal system\" of the traditional financial system and the \"logistics revolution\" of modern fintech, respectively.\n\n## SWIFT: The \"WhatsApp Group\" for Global Banks\n\n### What is SWIFT?\n\nSWIFT stands for \"Society for Worldwide Interbank Financial Telecommunication.\" It sounds official, but think of it as a \"WhatsApp Group\" for global banks.\n\n**Important first point: SWIFT doesn't transfer money, it only sends messages. **\n\nThis is a common misconception. SWIFT acts like a translator and postman between banks, ensuring that banks worldwide can communicate securely using the same \"language.\" When your bank wants to tell your bank in New York, \"Please transfer 10,000 RMB to Zhang San,\" they send a highly encrypted, standardized message via SWIFT.\n\n### From the Telegraph Era to the Digital Age\n\nBefore SWIFT (before 1973), international communication between banks primarily relied on telegraphs. Imagine a bank employee typing out a transfer instruction on an old-fashioned typewriter, sending it via telegram to a bank in another country, and then the recipient manually entering the information into the system. This process was not only painfully slow but also prone to errors.\n\nIn 1973, 239 banks from 15 countries decided to band together to solve this problem, and SWIFT was born. Today, SWIFT connects over 11,000 financial institutions worldwide, covering over 200 countries, processing over 47.6 million messages daily and supporting the movement of approximately $5 trillion in funds.\n\n### How SWIFT Works: A Three-Tier Architecture\n\n**Layer 1: Message Standardization**\nSWIFT has created a \"financial language.\" For example, MT103 is a customer transfer message, while MT202 is an interbank transfer message. Just as everyone agrees to communicate in English at international conferences, SWIFT enables banks around the world to send messages using the same format.\n\n**Layer 2: Secure Transmission Network**\nSWIFT doesn't use the regular internet; instead, it builds its own dedicated encrypted network. Each message undergoes multiple layers of encryption, ensuring that only the sender and receiver can read it.\n\n**Layer 3: Corresponding Bank Relationship**\nThis is the most complex part. What if ICBC wants to send a message to Citibank in the US, but they don't have a direct business relationship? It's like wanting to send a WhatsApp message to a stranger, but you're not a direct contact. A \"middleman\"—a corresponding bank—is needed. ICBC might first send the message to HSBC (due to their business relationship), which then forwards it to Citibank.\n\n### SWIFT Limitations: Why are your international transfers so slow and expensive?\n\n**Time Issue**: SWIFT only sends the message; the actual money is transferred through the central bank systems or interbank accounts. These systems have limited operating hours, don't work on weekends, and cross-time zone transactions are even more complex.\n\n**Layered Fees**: Each participating bank charges a fee. Your transfer might go through three or four banks, each charging between $20 and $50, for a total of up to $200 in fees.\n\nLack of transparency: You can't know in real time where your money is or when it will arrive.\n\n## XBMT: The \"FedEx\" of Fintech\n\n### What is XBMT?\n\nXBMT stands for \"Cross Border Money Transmitters.\" If SWIFT is the traditional \"postal system,\" then XBMT is the modern \"FedEx\"—they use technological innovation to make cross-border transfers faster, cheaper, and more transparent.\n\nRepresentative companies include Wise (formerly TransferWise), Remitly, and Western Union's digital services. They serve over 14.8 million customers worldwide and handle more than 50 currencies in over 80 countries.\n\n### XBMT's Core Innovation: The \"Dual Pool System\"\n\n**A Magical Illusion**\nWhen you transfer 10,000 RMB from China to the US through Wise, you think Wise \"converts\" your RMB into US dollars and then sends them to the US. But in reality, Wise uses a clever \"dual pool system\":\n\n1. You deposit 10,000 RMB into Wise's bank account in China.\n2. Wise simultaneously pays the recipient the equivalent amount in US dollars from its US bank account.\n3. Your money never actually leaves China; Wise simply balances the account internally.\n\n**The Art of Liquidity Management**\nThis system sounds simple, but the underlying algorithm is incredibly complex. Wise needs to:\n- Predict the inflow and outflow of funds in every currency and country\n- Maintain sufficient funding pools in dozens of countries around the world\n- Hedge exchange rate risk in real time\n- Ensure instant payments at all times\n\nJust as FedEx needs to establish a global network of logistics centers to predict package flows, XBMT needs to establish a global network of funding pools to predict fund flows.\n\n### How does XBMT break the monopoly of traditional banks?\n\n**Cost Revolution**\nWise claims to be eight times cheaper than traditional banks. This is because they bypass multiple layers of banking intermediaries and directly use local bank accounts. According to World Bank data, the average cost of international remittances from traditional banks is 6.25%, while XBMT typically charges only 1-2%.\n\n**Increased Speed**\n60% of SWIFT GPI payments are processed within 30 minutes, and almost 100% within 24 hours. However, XBMT companies can achieve settlements within minutes because they use local banking systems and don't require cross-border clearing.\n\n**Increased Transparency**\nXBMT companies typically provide real-time tracking, allowing you to know the status of your funds at all times, just like tracking a courier package.\n\n## The New Battleground of Geopolitics: The Weaponization of Financial Infrastructure\n\n### Russian Sanctions: The Political Power of SWIFT\n\nFollowing Russia's invasion of Ukraine in 2022, European and American countries kicked several Russian banks off the SWIFT system. This decision has been called a \"financial nuclear bomb\" because it virtually cuts off Russia from the global financial system.\n\nImagine how your social and business activities would be impacted if you suddenly lost access to WhatsApp? This is the impact of the SWIFT sanctions on Russia. While Russia can conduct international trade through other means (such as direct bilateral agreements, using cash, or through third-country banks), these methods are much slower, more expensive, and more risky.\n\n### China's Response: The CIPS System\n\nSeeing the potential for SWIFT to be weaponized, China accelerated the development of its own cross-border payment system—the Cross-Border Interbank Payment System (CIPS). To date, CIPS has connected over 1,000 financial institutions in over 100 countries and regions worldwide.\n\nHowever, CIPS and SWIFT are not direct competitors. Many CIPS participants still use SWIFT for underlying communications. CIPS is more like a dedicated \"highway\" for RMB transactions, while SWIFT remains the \"backbone\" for processing multi-currency transactions.\n\n## The Challenge of Blockchain: The Next Generation of Financial Infrastructure?\n\n### Stablecoins: 24/7 Global Payments\n\nThe traditional SWIFT system is subject to banking hours and weekends, but blockchain networks operate 24/7. When you use USDT or USDC for a cross-border transfer, you're effectively bypassing the entire traditional banking system.\n\n**Atomic Settlement**\nThis is blockchain's core advantage over SWIFT. In traditional systems, \"sending instructions\" and \"actually transferring funds\" are separate, creating time lags and risks. But on a blockchain, ownership of funds is transferred instantly the moment a transaction is confirmed, with no intermediate state.\n\n**Programmable Money**\nStablecoins are not just digital cash; they're \"programmable money.\" You can configure smart contracts to automatically execute actions on your money when certain conditions are met. For example, automatically transferring monthly living expenses to family members or automatically exchanging currency when the exchange rate reaches a certain level.\n\n### Blockchain Limitations\n\n**Scalability Issue**\nBitcoin can only process 7 transactions per second, Ethereum about 15, and SWIFT about 550 transactions per second. While Layer 2 solutions exist, large-scale adoption still faces technical challenges.\n\n**Regulatory Uncertainty**\nRegulatory policies on cryptocurrencies and stablecoins are still evolving, creating compliance risks.\n\n**Interoperability Challenge**\nDifferent blockchain networks lack standardized ways to interconnect, just as different brands of mobile phones cannot communicate directly.\n\n## Practical Impact on Ordinary People\n\n### A Blessing for Overseas Workers\n\nThere are 280 million international migrants worldwide, who remit over $700 billion back home annually. For these individuals, the emergence of XBMT is revolutionary.\n\n**Cost Comparison:**\n- Traditional Bank: Transfer fees typically $6-12 for a $100 transfer\n- Western Union: Fees typically $4-8\n- Wise: Fees typically $1-2\n\nFor a worker in Dubai who sends $500 monthly to family in India, using XBMT could save $600-1,000 annually.\n\n### Internationalization Opportunities for Small Businesses\n\nPreviously, only large companies could afford complex international payment systems. Now, even an eBay store owner can easily accept payments from around the world or pay overseas suppliers.\n\n**Real-World Example:**\nA small Taiwanese electronics company previously received payments from US customers through a bank. Each $1,000 transaction incurred a $50-$80 fee, with payments taking 3-5 days to arrive. After using the XBMT service, fees were reduced to $15-20, with payments arriving the same day.\n\n## Three-Level View of the Future: Evolution or Revolution?\n\n### Level 1: Coexistence and Competition\n\nIn the short term (the next 5-10 years), SWIFT, XBMT, and blockchain systems will coexist. Just like today, you can choose to travel to the same destination by plane, high-speed rail, or car, different payment methods suit different needs:\n\n- **Large-value B2B transactions**: Still primarily using SWIFT\n- **Personal cross-border remittances**: XBMT companies dominate\n- **Cryptocurrency transactions**: Primarily on the blockchain\n- **Programmed payments**: Smart contracts and stablecoins\n\n### Second Layer: Technological Convergence\n\nIn the medium term (10-20 years), we may see the convergence of these technologies. For example:\n- SWIFT may integrate blockchain technology to achieve faster settlements.\n- XBMT companies may use stablecoins as intermediary currencies.\n- Central bank digital currencies (CBDCs) may become a new settlement layer.\n\n### Layer 3: Paradigm Shift\n\nIn the long term (20+ years), we may see the emergence of a completely new financial infrastructure. Imagine a world where every country has its own CBDC, which can directly connect to each other via a decentralized protocol, without any intermediaries.\n\n## Opportunities for Investors and Entrepreneurs\n\n### Infrastructure Investment\n\n**Blockchain Infrastructure**: Invest in protocols that support cross-chain communication, Layer 2 solutions, or companies providing enterprise-grade blockchain services.\n\n**Compliance Technology**: As regulatory requirements become increasingly complex, there is a huge demand for software that helps financial companies automate their compliance efforts.\n\n**Liquidity Management**: A technology company providing intelligent liquidity management solutions to XBMT.\n\n### Startup Opportunities\n\n**Vertical Market**: Specialized payment solutions for specific industries (such as cross-border e-commerce, gaming, and freelancers).\n\n**Emerging Market**: Providing leapfrog financial services in regions with relatively underdeveloped financial infrastructure.\n\n**Web3 Finance**: Building a bridge between traditional finance and decentralized finance.\n\n## Risks and Challenges\n\n### Systemic Risks\n\n**Concentration Risk**: SWIFT's monopoly means any problems there could impact the global financial system.\n\n**Counterparty Risk**: Mismanagement by XBMT could result in client losses.\n\n**Technical Risk**: While blockchain systems are theoretically more secure, technical risks such as smart contract vulnerabilities and 51% attacks still exist.\n\n### Regulatory Risks\n\nCross-border payment regulatory policies vary significantly across countries, creating compliance costs and uncertainty. Regulation is likely to become more stringent in the future, particularly in areas such as anti-money laundering and counter-terrorist financing.\n\n## Conclusion: Understanding the Financial World's \"Plumbing and Electricity Systems\"\n\nMost people never consider how their plumbing and electrical wiring work until the water and electricity go out. SWIFT and XBMT are like the financial world's \"plumbing and electricity systems\"—invisible at ordinary times, yet they underpin the operation of the modern economy.\n\nUnderstanding these systems is important not only for satisfying curiosity but also for recognizing:\n\n1. **Financial infrastructure determines economic efficiency**: Faster, cheaper payment systems facilitate trade and investment.\n\n2. **Technological innovation is reshaping the financial landscape**: From SWIFT to XBMT to blockchain, each technological leap creates new business opportunities.\n\n3. **Geopolitics and financial technology are inextricably linked**: Controlling financial infrastructure is controlling the lifeline of global trade.\n\nNext time you swipe your credit card overseas or transfer money to a friend abroad, consider this: dozens of servers, several banks, and regulators from multiple countries are likely working together to make this transaction happen. This seemingly simple action actually connects to one of the most complex and important infrastructure systems in human history.\n\nThis is why understanding SWIFT and XBMT is more than just financial knowledge; it's a window into how the modern world works. While others are still complaining about bank transfer fees, you can already analyze the problem from an infrastructure perspective and anticipate potential solutions.\n\nIn this era of rapidly evolving financial infrastructure, mastering this knowledge will not only make you more effective in social situations but may also help you identify the next investment opportunity or entrepreneurial venture. After all, every infrastructure upgrade fosters new business models and wealth creation opportunities.",
  "references": [
    "https://www.panewslab.com/zh/articles/ctsulojh",
    "https://www.swift.com/",
    "https://www.swift.com/products/swift-gpi",
    "https://remittanceprices.worldbank.org/",
    "https://worldmigrationreport.iom.int/what-we-do/world-migration-report-2024-chapter-2/international-remittances",
    "https://wise.com/community/remittancereport2023",
    "https://www.voronoiapp.com/money/US-Dollar-Dominates-Global-Payment-Network-SWIFT-2820",
    "https://www.ey.com/en_us/insights/banking-capital-markets/how-new-entrants-are-redefining-cross-border-payments",
    "https://www.imf.org/en/Blogs/Articles/2024/01/03/how-training-and-advice-can-speed-cross-border-payments-and-cut-costs",
    "https://www.mckinsey.com/industries/financial-services/our-insights/a-vision-for-the-future-of-cross-border-payments-web-final",
    "https://www.fxcintel.com/research/reports/the-top-100-cross-border-payment-companies",
    "https://documents1.worldbank.org/curated/en/099122223114525255/pdf/P1787031652e720041b10c1e6520fe2f8d0.pdf"
  ],
  "audio_file": "audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure.wav",
  "social_hook": "🌍 Every time you swipe your card to transfer money overseas, how does your money move so instantly? Behind the scenes, there's a financial...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-05T02:17:03.739Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment092.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment093.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment094.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment095.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment096.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment097.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-25-swift-xbmt-global-financial-infrastructure/segment098.ts"
    ]
  }
}