{
  "id": "2025-08-22-stablecoin-programmable-yield-infrastructure-revolution",
  "status": "translated",
  "category": "macro",
  "date": "2025-08-24",
  "language": "en-US",
  "title": "When the \"Digital Dollar\" Meets Programmatic Returns: Why Stablecoins Are Redefining Financial Infrastructure",
  "content": "The ancient Greek philosopher Heraclitus said, \"You cannot step into the same river twice.\" The profound meaning of this saying is that things that appear unchanging are actually constantly changing. Today, when we talk about \"stablecoins,\" most people still understand them as \"digital versions of the US dollar\"—a token designed to keep the price of one dollar stable. But a deeper transformation is taking place: stablecoins are evolving from \"digital dollars\" to \"programmable yield infrastructure.\" This is more than just a technological upgrade; it's a redefinition of the very nature of financial infrastructure.\n\nImagine this scenario: Your friend, Mr. Zhang, is a cautious investor who has been keeping most of his funds in the USDC stablecoin, believing this allows him to participate in DeFi while avoiding the volatility of cryptocurrency. But he recently discovered a platform called OpenEden, which also offers a $1 stablecoin, but boasts an annualized return of 4-5%—this return comes from the platform's investments in US Treasury bonds, and even has an \"A\" credit rating from Moody's. Further perplexing, another friend is \"mining\" points on the USD.AI platform, promising future airdrops. The platform's unique feature is that it uses AI technology to provide credit services for artificial intelligence hardware. Mr. Zhang is puzzled: Are these still \"stablecoins\"? Why is it that, even though it's all just $1, some offer interest, some have complex business models, and some even have points systems?\n\nOn the surface, this is a question about how new-generation stablecoin projects attract users through \"points mining\" and \"airdrop opportunities\"; in reality, it's a cognitive revolution in how we rethink financial infrastructure in the digital age.\n\nFirst, how do stablecoins typically work?\n\nTo understand this revolution, we need to first examine the operating logic of traditional stablecoins. First-generation stablecoins like USDC and USDT are essentially \"digital versions of bank deposits,\" but with one key difference: users don't earn any interest.\n\nCircle's USDC business model is incredibly simple: users exchange $1 in cash for one USDC token, which Circle then invests in US Treasury bills or money market funds, earning an annualized return of 4-5%. This profit belongs entirely to Circle, while users receive a \"digital dollar.\" It's like depositing your money in a bank, which then invests it and earns interest, but doesn't pay you any interest.\n\nFrom an economic perspective, this is a classic \"seigniorage\" model—a profit derived from the privilege of issuing currency. Historically, governments have enjoyed this privilege because they have a monopoly on the issuance of fiat currencies. However, in the decentralized world of crypto, this monopoly is being challenged.\n\nAnother problem with traditional stablecoins is capital inefficiency. While USDC offers stability, it comes with a high opportunity cost for holders—in an environment where the Federal Reserve's benchmark interest rate is 5%, holding zero-yielding USDC is equivalent to losing 5% of real purchasing power annually.\n\nThe deeper issue lies in the trust structure. USDC's stability relies on Circle's promises and regulatory oversight, but these promises can fail in extreme circumstances. The brief devaluation of USDC to $0.87 during the collapse of Silicon Valley Bank in 2023 exposed the fragility of this centralized trust model.\n\n**Second, why are the approaches of the new generation of stablecoin protocols better?**\n\nEmerging stablecoin protocols are redefining the meaning of \"stability.\" Their innovation lies not in better maintaining the price of $1, but in creating an infrastructure that can share returns, improve capital efficiency, and reduce systemic risk.\n\nTake OpenEden's USDO as an example. It is not just a stablecoin, but a \"tokenized money market fund.\" Users holding USDO effectively hold shares of U.S. Treasury bonds. The key innovation lies in the distribution of returns: the interest earned on these bonds is not monopolized by the issuer, but is automatically distributed to all holders through a \"rebasing\" mechanism. Your USDDO balance automatically increases based on Treasury bond yields, much like holding a savings account with automatically compounding interest.\n\nEven more impressive is USD.AI's model. Rather than simply investing in Treasury bonds, this protocol provides credit services for AI hardware. GPU renters can use their hardware as collateral to obtain USD loans, while stablecoin holders receive the interest. The genius of this model lies in its direct connection between stablecoins and a high-growth sector of the real economy (AI infrastructure), creating a sustainable source of high returns.\n\nFrom a technical perspective, these protocols all employ a \"modular architecture.\" Unlike traditional stablecoins, which focus on a single function, new protocols modularize functions such as stability maintenance, yield generation, cross-chain interoperability, and compliance management, allowing for flexible combinations based on diverse needs. The Noble Protocol even builds a dedicated blockchain specifically for stablecoins and RWAs (real-world assets), enabling seamless interoperability with other blockchains through Cosmos' IBC protocol.\n\nCritically, these protocols introduce a \"points system\" as an innovative mechanism for community building and the distribution of governance tokens. Users earn points by providing liquidity, utilizing protocol features, and other activities, which are then converted into governance tokens. This not only avoids the securities law risks of direct token sales but also ensures that protocol governance remains in the hands of real users, not speculators.\n\n**Third, why do most people misunderstand this change?**\n\nMisunderstandings about the new generation of stablecoins stem primarily from three cognitive traps: functional fixation, the zero-sum game assumption, and a narrow understanding of the concept of \"stability.\"\n\nFirst, functional fixation. Most people are accustomed to defining stablecoins as \"cryptocurrencies with stable prices.\" This is like defining a car as \"a faster carriage.\" They capture superficial features but miss the fundamental innovation. The essence of a new generation of stablecoins isn't a \"better digital dollar\" but rather a \"programmable financial infrastructure.\"\n\nThis fixed mindset leads people to evaluate new protocols using the wrong criteria. They ask, \"How stable is this stablecoin's price?\" or \"Are its fees lower than USDC?\" But this is like evaluating an iPhone solely based on call quality and battery life; it misses the revolutionary value of smartphones as \"handheld computers.\"\n\nThe second misconception stems from a zero-sum game assumption. Many believe that the success of new stablecoin protocols will inevitably come from taking market share from USDC and USDT, which is simply a redistribution of the existing market. However, this approach ignores the potential for \"creating new demand.\"\n\nTake USD.AI, for example. It isn't competing with USDC for the \"digital dollar\" market, but rather creating a brand new market for \"AI hardware financial services.\" When AI companies can use GPUs as collateral to gain liquidity without having to sell equity and dilute control, this creates a financial demand that previously didn't exist. McKinsey predicts that the AI hardware market will reach $400 billion by 2030. This massive asset class requires specialized financial infrastructure to provide liquidity.\n\nThe most profound misunderstanding lies in a narrow understanding of the concept of \"stability.\" Most people believe that the core value of a stablecoin lies in price stability, but this understanding confuses means with ends. The true end is not price stability but the reliability of its functions as a \"store of value\" and \"medium of exchange.\"\n\nNobel laureate in economics, Friedman, once pointed out that true monetary stability comes from stable purchasing power, not fixed nominal prices. In an inflationary environment, the nominally \"stable\" dollar actually loses purchasing power. In contrast, a \"stable currency\" that can keep pace with inflation, or even moderately outperform it, is more \"stable\" in its true value preservation function.\n\nBehavioral economist Kahneman's \"anchoring effect\" theory can explain this cognitive bias. Once people establish \"1 dollar = 1 token\" as the anchor for a stable currency, it becomes difficult to break away from this framework and understand more complex value models. But as Kahneman said, \"We don't see the world as it is, but as we expect to see it.\"\n\n**Conclusion: When Financial Infrastructure Meets Programmed Thinking**\n\nFrench philosopher Michel Searle once said, \"We don't use technology; we co-evolve with it.\" When we discuss a new generation of stablecoins, we are actually witnessing a larger evolution: the transformation of financial infrastructure from a static tool to a dynamic ecosystem.\n\nThe core of this transformation lies not in technological innovation per se, but in a shift in mindset. From \"maintaining stability\" to \"creating value,\" from \"single function\" to \"modular integration,\" from \"issuer-led\" to \"holder-benefited\"—each shift reflects a deepening understanding of the nature of finance.\n\nOpenEden has received an A rating from Moody's, Framework Ventures led an investment in USD.AI, and Paradigm backed Noble—the involvement of these top institutions is no accident. They see more than \"the next airdrop opportunity\" than a paradigm shift in digital financial infrastructure. As the regulatory environment becomes increasingly clear (such as with the EU's MiCA regulations), the technical framework matures, and market demand continues to grow, we may be standing at a turning point in financial history.\n\nBut we must also remain clear-headed: any new venture carries risks and uncertainties. Technology may have vulnerabilities, regulations may evolve, and markets may experience volatility. True wisdom lies not in blindly chasing trends, but in understanding the nature of change and finding the logic of certainty amidst uncertainty.\n\nPerhaps, when we look back on this era, we'll discover that 2024 wasn't just a \"year of abundant stablecoins,\" but also the beginning of the era of programmability for financial infrastructure. After all, the most profound changes are often not earth-shattering, but rather subtle and gradual—like a river that's constantly shifting, seemingly calm but actually flowing.",
  "references": [
    "https://www.panewslab.com/zh/articles/c06c7aa2-5bfe-48b9-b4c9-61f8c9016ba2",
    "https://openeden.com/",
    "https://www.usd.ai/",
    "https://levelfi.xyz/",
    "https://falconstable.com/",
    "https://perena.io/",
    "https://nobleassets.xyz/",
    "https://resolv.xyz/",
    "https://eur-lex.europa.eu/eli/reg/2023/1114/oj",
    "https://www.moodys.com/research/Moodys-assigns-A-rating-to-OpenEdens-tokenized-US-Treasury-product--PBC_1388832",
    "https://framework.ventures/",
    "https://paradigm.xyz/",
    "https://blog.cosmos.network/what-is-ibc-def44d7b5018"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution.wav",
  "social_hook": "🚀 As stablecoins evolve from being just \"digital dollars\" to \"programmable yield infrastructure,\" we're witnessing a redefinition of the very nature...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-24T02:00:40.611Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-22-stablecoin-programmable-yield-infrastructure-revolution/segment067.ts"
    ]
  }
}