{
  "id": "2025-07-21-genius-act-stablecoin-regulation",
  "status": "translated",
  "category": "macro",
  "date": "2025-07-21",
  "language": "en-US",
  "title": "When Stablecoins Become Government Money: How the GENIUS Act Turns the Digital Dollar into a Surveillance Tool",
  "content": "Have you ever wondered why a bill called \"GENIUS\" sounds like it's going to promote innovation, but could actually kill one of the most important innovations in the cryptocurrency world? Imagine if WeChat Pay was suddenly required to use only government bonds as reserves, and every transaction had to be reported to the government. Would you still think it was the original WeChat Pay? This is exactly what the US GENIUS Act (Guaranteeing Economic Nurturing Innovation in US Stablecoins) wants to do to stablecoins. The bill is ostensibly to \"promote innovation\" and \"protect consumers\", but the underlying logic is to transform stablecoins from potential competitors to the US dollar into a tool to strengthen US dollar hegemony. From \"silver bills\" to central banks: history is always surprisingly similar Let's go back to ancient China. Imagine the Ming and Qing dynasties, when merchants from all over the country could issue their own \"silver bills\", some of which were reputable and some were unreliable. Eventually, in order to unify the currency and prevent financial chaos, the government began to centrally manage the right to issue currency. This seems to be for stability, but it also means that the government has gained absolute control over the monetary system. The logic of the GENIUS Act is exactly the same. The current stablecoin market is like the \"silver bills from all over the country\" period-Tether, Circle, Binance USD and other stablecoins are competing for development, some are highly transparent, and some are questionable. The US government now wants to play the role of a \"central bank\" and unify the management of these \"digital silver bills\". But what is different this time is that these \"banknotes\" are not only used in the United States, but are digital currencies used worldwide. By controlling stablecoins, the United States is actually controlling the infrastructure of the global digital economy. Three \"poison\" clauses: seemingly reasonable regulatory traps The core of the GENIUS Act has three clauses, each of which seems reasonable, but combined together they form an ingenious monitoring and control system. The first poison: mandatory reserves of U.S. Treasury bonds The bill requires stablecoin issuers to invest their reserves mainly in U.S. Treasury bonds. This is like stipulating that all electronic wallet companies must keep users' money in designated government banks. On the surface, this guarantees the safety of funds-U.S. Treasury bonds are indeed one of the safest assets in the world. But in reality, this creates an artificial, multi-hundred-billion-dollar demand for U.S. Treasuries. Imagine if the world's major stablecoins (worth more than $150 billion) all had to use U.S. Treasuries as reserves. This is equivalent to forcing the world to pay for the U.S. government's debt. This not only consolidates the international status of the dollar, but also provides a stable source of funds for the U.S. government. The second poison: bank-level compliance requirements The bill requires stablecoin issuers to follow the same KYC (know your customer) and AML (anti-money laundering) regulations as banks. This sounds reasonable - who doesn't want the financial system to be safer? But the problem is the cost of compliance. Setting up a stablecoin company that meets bank-level compliance requirements requires tens of millions of dollars in initial investment and millions of dollars in compliance operating costs each year. This is like setting up a new telecommunications company, which not only needs to build infrastructure, but also must meet the same regulatory requirements as China Mobile and China Unicom. As a result, only financial giants like JPMorgan Chase and Goldman Sachs have the resources to operate a stablecoin that meets the requirements. Innovative cryptocurrency companies will be shut out by high compliance costs. The third poison: transaction monitoring and data collection The most hidden but also the most dangerous is the transaction monitoring requirement. The bill requires detailed recording of relevant information about each transaction, including the sender, recipient, amount, time, and possible purpose of the transaction. This creates an unprecedented financial surveillance system. Unlike traditional banks, blockchain technology makes all transactions publicly traceable. Combined with KYC requirements, the government will be able to track any transaction of anyone in real time and build a complete financial behavior portrait of everyone. This is like requiring WeChat Pay to record not only what you bought, but also when you bought it, where you bought it, who you bought it with, and even why you bought it, and then report all this information to the government. Triple impact: investors, companies, and ordinary people can't escape Impact on cryptocurrency investors: from freedom to siege For cryptocurrency investors, the changes brought about by the GENIUS Act are fundamental. In the short term, the market may be polarized. \"Official stablecoins\" that meet the requirements of the bill will be favored by institutional investors, and funds will flow into products issued by traditional financial institutions such as JPM Coin and Fidelity stablecoins. But at the same time, stablecoins that do not meet the requirements will face tremendous pressure and may be transferred to other jurisdictions or simply withdraw from the US market. Imagine if starting tomorrow, you can only use government-certified electronic wallets, and other payment tools you are used to using have become \"illegal\" or \"high-risk\" options. You may choose an official wallet for compliance, but you will find that every transaction is recorded and every payment may be reviewed. In the long run, this will lead to a split in the cryptocurrency market. On one side is the highly regulated, transparent but privacy-deficient \"white market\" that primarily serves institutional investors and risk-averse retail investors. On the other side is the less regulated but less liquid \"gray market\" that serves users who seek privacy and decentralization. DeFi users face unique challenges. The core philosophy of many decentralized financial protocols is permissionless and censorship-resistant. But if major stablecoins become permissioned, freezeable assets, the foundations of DeFi will be shaken. This could drive the development of new, truly decentralized stablecoins, but these new products may face illiquidity and technical risks in the early stages. Impact on businesses: Big players rejoice, innovators are out For businesses, the GENIUS Act creates clear winners and losers. The winners are traditional financial giants. Companies such as JPMorgan Chase, Goldman Sachs, and Fidelity already have a sound compliance system and sufficient capital. The implementation of the bill is more like an umbrella for them to eliminate competitors. They can quickly launch stablecoin products that meet the requirements and use regulatory advantages to seize the market. The losers are innovative cryptocurrency companies. Although companies such as Circle and Paxos have been deeply involved in the stablecoin field for many years, facing bank-level compliance requirements, they need to significantly increase compliance investment or cooperate with traditional financial institutions. Smaller innovators may be directly squeezed out. It's like in the online car-hailing industry, suddenly requiring all drivers to have a professional driver's license, the vehicles must be of a designated brand, and the company must have the same operating qualifications as traditional taxi companies. As a result, only large companies like Didi and Uber can survive, and innovative small companies will disappear. For companies that use stablecoins for cross-border payments, the impact is complex. On the one hand, clear regulation may reduce compliance risks and allow more traditional companies to dare to use stablecoins. But on the other hand, the transparency requirements of transactions may expose the business secrets of enterprises, and KYC requirements may increase the complexity and cost of transactions. Impact on ordinary people: Stability in exchange for surveillance For ordinary people, the impact of the GENIUS Act is the most far-reaching, because it involves fundamental issues of financial privacy and personal freedom. In the short term, ordinary users may feel more \"secure\". Government-backed stablecoins are unlikely to collapse suddenly like Terra/UST, and the security of funds is better guaranteed. For users who mainly use stablecoins for value storage and simple payments, this may be a positive change. But the price is the loss of privacy. Under the new regulatory framework, every stablecoin transaction you make will be recorded in detail. The government not only knows what you bought, but also when you bought it, who you traded with, and may even infer why you made the transaction. Imagine if you use WeChat Pay to buy a political book, donate to a charity, or buy a health product. This information will not only be recorded, but may also be analyzed and used by government departments. In the world of stablecoins, this kind of monitoring will become more precise and comprehensive. The deeper impact is the erosion of financial autonomy. One of the original visions of cryptocurrency is to give individuals complete financial autonomy-your money truly belongs to you without going through any intermediary. But the GENIUS Act is actually rebuilding this intermediary system, except that the intermediary has changed from traditional banks to government-regulated stablecoin issuers. International Game: The Last Struggle for US Dollar Hegemony? The GENIUS Act is not only a domestic regulatory policy, but also an important part of international currency competition. From the US perspective, this is a strategic move to maintain the international status of the US dollar. With the popularity of digital payments, if the United States cannot control the main digital dollar (stablecoin), it may lose control of the global monetary system. By passing the GENIUS Act, the United States is actually saying: \"If you want to use the digital dollar, you must follow our rules.\" But this strategy may backfire. Other countries, especially China, Russia, and BRICS countries, may see this as a further extension of US financial hegemony, thereby accelerating the development of alternatives. China's digital RMB (e-CNY) project may therefore gain more international support. If the US stablecoin becomes too regulated and restrictive, other countries may be more willing to use China's digital currency for international trade. Although the EU's MiCA regulatory framework also regulates stablecoins, it is relatively more balanced, protecting consumers without having obvious geopolitical purposes like the GENIUS Act. This may give the EU more opportunities for international cooperation in the field of digital currency. More importantly, the GENIUS Act may lead to the development of truly decentralized stablecoins. If mainstream stablecoins are brought under the U.S. regulatory system, users and developers seeking true decentralization and censorship resistance will be more motivated to develop and use algorithmic stablecoins or other innovative solutions. Implementation Challenges: Ideals are rich, but reality is skinny Even if the GENIUS Act is passed, its implementation faces huge challenges. Technical challenges are the first and foremost. To build a system that can monitor global stablecoin transactions in real time requires a huge technical infrastructure and international cooperation. The decentralized nature of blockchain means that transactions can occur anywhere in the world, and how to ensure that all transactions are correctly recorded and reported is a huge technical problem. The challenge of enforcement should not be underestimated. If Tether or other major stablecoins refuse to comply with the GENIUS Act and instead operate in other jurisdictions, how will the U.S. government enforce the law? This could trigger a global regulatory arbitrage competition, with stablecoin issuers moving to more regulatory-friendly regions. The challenge of international cooperation is the most complex. The effective implementation of the GENIUS Act requires the cooperation of other countries, but many countries may see this as an attempt by the United States to impose its regulatory standards on the world. This could lead to further fragmentation of the international financial system. The challenge of the time window is also critical. It may take 2-3 years from the proposal of the bill to its final implementation. During this period, technology will continue to develop, and new stablecoins and decentralized financial products will continue to emerge. By the time the bill is actually implemented, the problems it targets may no longer be major issues. Reflection: The eternal game between innovation and control The GENIUS Act reveals a deeper problem: Where is the balance between innovation and control in the digital age? Supporters will say that appropriate regulation is necessary. If stablecoins are not regulated, they may indeed be used for illegal activities such as money laundering, tax evasion, and terrorist financing. Moreover, unregulated stablecoins may also face technical risks or fraud risks, and ordinary users need protection. Opponents believe that excessive regulation will stifle innovation. The value of cryptocurrencies and stablecoins lies in the fact that they provide an alternative to the traditional financial system. If these alternatives are eventually incorporated into the traditional regulatory system, what is the point of innovation? This game is not new. Throughout history, every major financial innovation has sparked similar debates. From the initial paper money to credit cards to online banking, they have all gone through a process from distrust to regulation to acceptance. Cryptocurrencies and stablecoins are also going through the same process. But the difference this time is that this innovation is global and decentralized. The traditional national regulatory model may no longer be applicable. The GENIUS Act may be an attempt by the United States to extend the traditional regulatory model into the digital age, but whether this attempt will succeed remains to be seen. Advice for Investors and Users How should investors and users respond in this uncertain environment? For cryptocurrency investors: 1. Diversify risks: Don't put all your funds into a single type of stablecoin. Consider holding both \"official\" stablecoins and other alternatives that meet the requirements of the GENIUS Act. 2. Pay attention to international developments: Pay attention to the development of digital currencies in other countries and regions, especially the EU's MiCA framework and China's digital RMB. 3. Technical learning: Understand different types of stablecoin mechanisms, including fiat-collateralized, cryptocurrency-collateralized, and algorithmic stablecoins, and prepare for future changes. For corporate users: 1. Compliance preparation: If your business relies on stablecoins, start preparing compliance processes that meet stricter KYC/AML requirements. 2. Diversified strategy: Do not rely on a single payment track, consider a combination of multiple cross-border payment solutions. 3. Privacy protection: Assess the sensitivity of business data and consider which transactions may require higher privacy protection. For ordinary users: 1. Understand the trade-offs: Make wise choices between stability and privacy, and choose the right products based on your needs. 2. Keep learning: Financial technology is developing rapidly, keep up with new technologies and new products. 3. Diversified choices: Do not concentrate all financial activities on one product or platform. Conclusion: Where is the future of digital money? The GENIUS Act represents an extension of traditional financial regulatory thinking into the digital age. It attempts to keep new technologies within a controllable framework while maintaining the vitality of innovation. But it is still uncertain whether this attempt will succeed or give rise to new, more decentralized alternatives. What is certain is that the trend of digital money is irreversible. Whether it is a central bank digital currency (CBDC) issued by the government or a privately issued stablecoin, digital forms of money will become an important part of the future financial system. The GENIUS Act is just a node in this transformation process. It reflects the different views of different interest groups on how digital money should work: should it remain decentralized and privacy-protected, or should it be included in the traditional regulatory and control system? The answer to this question will be determined not only by governments and large financial institutions, but also by millions of users, developers, and investors through their choices. In this sense, everyone involved in digital finance is shaping the future of money. The next time you use a stablecoin to make a payment or investment, remember: you are not just making a transaction, you are also voting for the future of digital money. And this vote will determine whether we are moving towards a more open and innovative financial world, or a safer but more controlled financial system. The fate of the GENIUS Act will ultimately be judged by history. But what is certain is that no matter what the outcome, the digital money revolution will not stop. It will only continue to develop in different forms and in different places. And all of us are witnesses and participants in this revolution.",
  "references": [
    "https://www.panewslab.com/zh/articles/6ydkwr8di698",
    "https://www.congress.gov/bill/118th-congress/house-bill/stablecoin-regulation",
    "https://www.federalreserve.gov/publications/other-reports/files/stablecoin-report-20211101.pdf",
    "https://www.treasury.gov/resource-center/data-chart-center/Pages/index.aspx",
    "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52020PC0593",
    "https://www.ecb.europa.eu/euro/html/digitaleuro.en.html",
    "https://www.pbc.gov.cn/en/3688110/3688172/4157443/4293696/2021071614584691871.pdf",
    "https://www.bis.org/publ/othp42.pdf",
    "https://www.imf.org/en/Publications/fintech-notes/Issues/2021/02/11/Central-Bank-Digital-Currencies-4-Questions-and-Answers-50103",
    "https://www.coindesk.com/policy/2024/stablecoin-regulation",
    "https://www.bloomberg.com/news/articles/stablecoin-regulation-crypto",
    "https://www.ft.com/content/stablecoin-genius-act",
    "https://cointelegraph.com/news/genius-act-stablecoin-regulation-us",
    "https://decrypt.co/genius-act-stablecoin-treasury-backing",
    "https://www.reuters.com/business/finance/us-stablecoin-regulation-genius-act/"
  ],
  "audio_file": "audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation.wav",
  "social_hook": "🚨Stablecoin monitoring alert! The truth about the GENIUS Act is revealed\n\nIf WeChat Pay requires government bond reserves + reports every...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-21T10:31:00.274Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment092.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment093.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment094.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment095.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment096.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment097.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment098.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment099.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment100.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment101.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment102.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment103.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment104.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment105.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment106.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-21-genius-act-stablecoin-regulation/segment107.ts"
    ]
  }
}