{
  "id": "2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing",
  "status": "translated",
  "category": "macro",
  "date": "2025-09-30",
  "language": "en-US",
  "title": "When Companies Become \"Private Central Banks\": Decoding the Financial Infrastructure Revolution Behind Tether's $500 Billion Valuation",
  "content": "Have you ever wondered how a company with fewer than 100 employees can boast higher profit margins than most central banks? When Tether, the world's largest stablecoin issuer, sought funding at a $500 billion valuation, it wasn't just an astronomical figure; it signaled the fundamental restructuring of financial infrastructure we're witnessing.\n\nMeanwhile, cloud services giant Cloudflare announced it would launch its own stablecoin, the NET Dollar, signaling a deeper trend: traditional businesses are shifting from \"using financial services\" to \"owning financial infrastructure.\"\n\nThe core question of this transformation is: What happens to our existing financial order when businesses can become their own \"private central banks\"?\n\nFirst, how profitable is Tether's \"money printing\" model?\n\nLet's first understand Tether's astonishing business model. In 2024, Tether achieved a net profit of $13.7 billion, with a profit margin of 99%. What does this mean?\n\nTraditional banks typically have profit margins between 10-15%, and even the most profitable investment banks rarely exceed 30%. Tech giants like Apple have profit margins of around 25%, and Google around 21%. Tether's 99% profit margin breaks virtually all industry norms.\n\nThe operating logic of the stablecoin business model is actually quite simple:\n\n1. Collecting US dollars: Users deposit US dollars into Tether and receive an equivalent value in USDT tokens.\n2. Investing and Earning Interest: Tether invests these US dollars in safe assets like US Treasury bonds, earning an annualized return of 4-5%.\n3. Providing Services: Users use USDT for transactions, and Tether charges minimal transfer fees.\n4. Retaining Interest: The key here is Tether retains all investment returns, while users only receive a 1:1 redemption option.\n\nThis is equivalent to Tether earning risk-free returns on over $100 billion in \"interest-free deposits\" worldwide. The interest earned from Treasury bonds alone generates over $4 billion in annual revenue, while operating costs are relatively minimal.\n\n**Historical Analogy: How is this similar to medieval bill merchants?**\n\nThis model reminds me of medieval bill merchants. At the time, merchants would issue bills redeemable in different cities, avoiding the risk of carrying physical gold and silver. Bill merchants earned fees and could use the funds for other investments.\n\nBut the scale and efficiency of modern stablecoins far exceed historical precedent. Tether's annual profit is equivalent to the GDP of a medium-sized country, yet its staff is only one-thousandth that of a traditional bank.\n\nThis trend toward the dematerialization of finance is redefining the boundaries of \"banking.\" When software can replace most manual processes, the cost structure of financial services undergoes a fundamental shift.\n\n**Second, why did Cloudflare issue its own stablecoin?**\n\nCloudflare CEO Matthew Prince offered a key insight: \"For decades, the internet's business model has been built on advertising platforms and bank transfers. The next era of the internet will be driven by pay-per-use, fractional payments, and microtransactions.\"\n\nThis statement reveals the true motivation behind companies issuing stablecoins: **Controlling payment infrastructure means controlling a core part of the business ecosystem**.\n\nImagine the payment pain points Cloudflare faces:\n\n- Lengthy settlement cycles with thousands of partners worldwide\n\n- High cross-border payment fees (averaging over 6%)\n\n- Reliance on the time constraints of the traditional banking system (business days, time zone differences)\n\nLack of direct control over the payment process\n\n[Enterprise Stablecoin] provides a systemic solution to these problems:\n\n**Instant Settlement**: Partners can settle payments 24/7, eliminating bank operating hours.\n**Cost Control**: Bypassing traditional financial intermediaries, cross-border payment costs are reduced to less than 1%.\n**Ecosystem Lock-in**: When the entire business network uses a single settlement currency, powerful network effects are generated.\n**Programmability**: Smart contracts can automate payments, such as automatically releasing funds upon service delivery completion.\n\nThe deeper strategic implication is that owning the payment infrastructure means controlling the ecosystem. When suppliers and partners become accustomed to using Cloudflare Coin, switching costs can become prohibitive.\n\n**Third, a paradigm shift from \"asset creation\" to \"trading-oriented\" approaches**\n\nMy research has revealed that cryptocurrency investing is undergoing a fundamental strategic shift.\n\nThe \"Asset Creation\" Era (2017-2022):\n- VCs invest in new blockchain projects and tokens\n- The logic is: If the project succeeds, the token price will rise, and investors will profit.\n- The problem is: over 95% of projects ultimately fail.\n\nThe \"Transaction-Oriented\" Era (2025):\n- VCs invest in infrastructure that takes a fee from all transactions.\n- The logic is: Instead of betting on which token will rise, it's better to invest in platforms that \"collect tolls.\"\n- The advantage is: regardless of market fluctuations, infrastructure can consistently generate profits.\n\nIt's like the gold rush: the real money wasn't made by the miners, but by the shovel sellers. Both Tether and Cloudflare are selling \"shovels\"—providing the infrastructure for others' transactions.\n\n**Data supports this trend**:\n- The top 20 VCs controlled 60% of cryptocurrency limited partner funding in 2025\n- Digital Asset Treasuries (DATs) have raised over $15 billion, focusing on liquidity management and arbitrage trading\n- Infrastructure projects command valuation multiples significantly higher than application projects\n\n**Fourth, how does regulatory clarity change the rules of the game?**\n\nA key turning point was the passage of the GENIUS Act in the United States (July 2025), the nation's first comprehensive stablecoin regulation law.\n\n**Core Requirements of the Act**:\n- 100% reserve backing (cash, U.S. Treasury bonds, and other liquid assets)\n- Monthly public disclosure of reserve composition\n- Large tech companies cannot issue stablecoins directly and must partner with regulated financial institutions\n- Clear anti-money laundering compliance requirements\n\nThis regulatory framework has different impacts on different types of companies:\n\n**Beneficiaries**:\n- **Traditional banks**: Can leverage existing regulatory licenses and compliance experience\n- **Regulated stablecoin issuers** (e.g., Circle, Paxos): Legally recognized model\n- **Fintech companies**: Can provide \"stablecoin-as-a-service\" solutions\n\n**Challengers**:\n- **Large tech companies**: Cannot issue directly and must seek banking partners\n- Decentralized projects: Difficulty meeting stringent compliance requirements\n- Offshore issuers: Potential market access restrictions\n\nThe importance of global regulatory coordination\n\nThe Financial Stability Board (FSB) also released recommendations for global stablecoin regulation, emphasizing the principle of \"same activities, same risks, same regulation.\" However, regulatory progress varies across countries:\n\n- **US**: Passed the GENIUS Act, a relatively friendly approach\n- **EU**: More stringent MiCA regulations\n- **China**: Strictly restricts private stablecoins and promotes the digital RMB\n- **Emerging Markets**: Regulatory frameworks are still evolving\n\nSuch regulatory fragmentation could create \"digital currency groups,\" much like today's currency zones.\n\n**Fifth, Practical Challenges of Technical Infrastructure**\n\nCompanies need to address complex technical and operational challenges to successfully issue stablecoins:\n\n**1. Reserve Management and Proof**\n- Requires collaboration with a qualified custodian (e.g., BNY Mellon)\n- Implementing a real-time Proof of Reserve (PoR) system\n- Using oracle technology to bring offline asset data on-chain\n\n**2. Identity and Compliance**\n- Smart contracts must integrate KYC/AML checks\n- May require a permissioned blockchain or identity verification layer\n- Automated transaction monitoring and sanctions screening\n\n**3. Minting and Destruction Mechanisms**\n- Role-Based Access Control (RBAC)\n- API integration with enterprise treasury systems\n- Automated minting and redemption processes\n\n**4. Interoperability and Bridging**\n- Compatibility with other stablecoins and DeFi protocols\n- Security considerations for cross-chain technology\n- Abstracting gas fees to provide a seamless user experience\n\nThese technical requirements explain why most enterprises choose to partner with existing stablecoin infrastructure providers rather than building from scratch.\n\n**Sixth, Historical Lessons: The Rise and Fall of Private Currency Systems**\n\nHistorical private currency experiments offer important lessons:\n\n**Successful Cases**:\n- **Medieval Bill System**: Focused on solving specific transaction problems and operated efficiently within merchant networks\n- **19th-Century Company Note**: Created value within a closed ecosystem but provided redemption channels with external systems\n\n**Failed Cases**:\n- **US \"Wildcat\" Banknotes (1837-1863)**: Lacked transparent reserve backing and experienced significant value fluctuations\n- **Private Credit Currency**: Attempted to completely replace fiat currency, ultimately destroyed by government power\n\n**Key Success Factors**:\n1. **Clear Use Case**: Solve specific payment friction problems rather than pursue universal acceptance.\n2. **Transparent Reserve Management**: Users need to be able to verify the existence and quality of the backing assets.\n3. **Bridge to Fiat Currency**: Provide clear entry and exit mechanisms.\n4. **Regulatory Cooperation**: Collaborate with governments, not confront them, and seek regulatory approval.\n\nModern corporate stablecoins have heeded these historical lessons, focusing on ecosystem optimization rather than currency replacement.\n\n**Seventh, Far-Reaching Impact on the Global Financial System**\n\nThe rise of corporate stablecoins will reshape global financial infrastructure:\n\n**Impact on Traditional Banks**:\n- **Payment Business Offload**: Direct settlement for businesses reduces reliance on bank transfers\n- **Role Transformation**: From payment service providers to custodians and compliance service providers\n- **New Partnership Opportunities**: Providing stablecoin infrastructure services to businesses\n\n**Impact on Cross-Border Trade**:\n- **Settlement Time**: Shortened from T+3 to real-time settlement\n- **Cost Reduction**: Cross-border payment costs will drop from 6% to below 1%\n- **Supply Chain Finance Innovation**: Smart contracts enable automated trade financing\n\n**Impact on Monetary Policy**:\n- **Pressure on Central Bank Digital Currency (CBDC): The success of private stablecoins may force central banks to accelerate CBDC development.\n- **Strengthening of US Dollar Hegemony**: Most stablecoins are anchored to the US dollar, which may further consolidate the dollar's position.\n- **Risk of Regulatory Arbitrage**: Companies may choose to issue stablecoins in jurisdictions with more relaxed regulations.\n\n**Eighth, Analysis of Development Scenarios over the Next Five Years**\n\nBased on my research, I believe the most likely development path is:\n\n**2025-2026: Experimentation and Collaboration Phase**\n- Large enterprises establish stablecoin partnerships with banks\n- Pilot projects within closed B2B networks\n- Further refinement and clarification of the regulatory framework\n\n**2026-2028: Large-Scale Adoption Phase**\n- Emergence of industry alliance stablecoins (e.g., automotive industry chain stablecoins)\n- Establishment of cross-platform interoperability standards\n- Deep integration with traditional ERP systems\n\n**2028-2030: Ecosystem Maturity Phase**\n- A few dominant platforms form a network moat\n- AI agents gain independent payment capabilities\n- Micropayments and the machine economy become widespread\n\n**Key Risk Factors**:\n- Regulatory Fragmentation: Different countries adopt incompatible regulatory frameworks.\nTechnological Failure: Major smart contract vulnerabilities or oracle failures.\nGeopolitical Tensions: Digital currencies become tools for economic sanctions.\nCentral Bank Counterattack: The widespread rollout of CBDCs could compress the space for private stablecoins.\n\nNinth, Recommended Investment and Participation Strategies\n\nFor different participants, I recommend the following strategies:\n\nFor Investors:\nInfrastructure over Applications: Invest in payment rails, custody services, and compliance technologies.\nRegulatory Compliance Premium: Prioritize projects with clear legal status.\nNetwork Effect Identification: Focus on platforms that can create lock-in effects.\n\nSpecific Investment Targets:\n**Stablecoin Infrastructure**: Circle (USDC), Paxos, Tether\n\n**Payment Technology**: Stripe, Chainlink, Polygon\n\n**Compliance Solutions**: Chainalysis, TRM Labs\n\n**Escrow Services**: Coinbase Custody, Anchorage\n\n**For Businesses**:\n\n**Assessing Payment Pain Points**: Identify the most expensive and inefficient current payment processes\n\n**Choosing a Partnership Model**: Decide whether to build your own, partner, or leverage existing solutions\n\n**Phase-Based Implementation**: Start with low-risk internal settlement and gradually expand to external partners\n\n**For Policymakers**:\n\n**Balancing Innovation and Stability**: Promoting financial innovation while preventing systemic risks\n\n**International Coordination**: Collaborating with other countries to establish interoperable regulatory frameworks\n\n**Regulatory Sandbox**: Providing a controlled testing environment for innovative projects\n\n**Tenth, Conclusion: What Are We Witnessing?**\n\nTether's $500 billion valuation and Cloudflare's NET Dollar aren't isolated incidents, but rather signs of a larger trend: **Enterprises are becoming their own financial infrastructure providers**.\n\nThe core logic of this shift is financial disintermediation: when technology can replace most of the functions of traditional financial institutions, why pay high intermediary fees?\n\nHowever, unlike the \"disruptive innovations\" of early cryptocurrencies, today's enterprise stablecoins are more of an \"incremental improvement\": they aren't intended to replace the existing financial system, but rather to build a more efficient operating layer on top of it.\n\n**Three Key Insights**:\n\n1. **Infrastructure Over Assets**: True value comes from providing transaction services, not holding specific tokens.\n\n2. **Compliance Is a Competitive Advantage**: In a regulatory environment, compliance becomes a defensive moat.\n\n3. **Network Effects Determine Winners**: Ultimately, the platforms that can lock in the most participants will emerge victorious.\n\n**Implications for Everybody**:\n\nWhile these changes are primarily occurring in the B2B space, they will ultimately impact everyone:\n\n- Faster and cheaper cross-border remittances\n- More transparent supply chains and product pricing\n- New job opportunities and business models\n- Decreasing Dependence on Traditional Banking Services\n\nWe are witnessing not just the application of new technologies but the evolution of the very infrastructure of commercial civilization. In this process, individuals and organizations that can adapt and leverage new tools will gain a significant advantage, while those that cling to old models may be marginalized.\n\n**Final Thought**: When every large corporation has its own \"private central bank,\" what will happen to the very concept of money? Perhaps the answer isn't a single world currency, but a diverse ecosystem of currencies connected by smart contracts, where value can flow freely across different corporate \"currency zones.\"\n\nThis future is no longer far off. In fact, it's already begun.",
  "references": [
    "https://www.panewslab.com/zh/articles/420b770a-0804-4aab-9b84-72822ec3b687",
    "https://www.panewslab.com/zh/articles/d0464ec7-703f-407c-bef8-ac3cc32d0d59",
    "https://tether.to/",
    "https://www.circle.com/usdc",
    "https://cloudflare.com/",
    "https://www.weforum.org/stories/2025/07/stablecoin-regulation-genius-act/",
    "https://www.fsb.org/2023/07/high-level-recommendations-for-the-regulation-supervision-and-oversight-of-global-stablecoin-arrangements-final-report/",
    "https://makerdao.com/",
    "https://frax.finance/",
    "https://aave.com/",
    "https://stripe.com/",
    "https://chainlink.com/",
    "https://polygon.technology/",
    "https://www.theblock.co/",
    "https://messari.io/",
    "https://coinbase.com/custody",
    "https://www.anchorage.com/",
    "https://chainalysis.com/",
    "https://www.trmlabs.com/"
  ],
  "framework": "解讀分析式風格.md",
  "audio_file": "audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing.wav",
  "social_hook": "💰 With fewer than 100 employees, profit margins surpass those of central banks? Behind Tether's $500 billion valuation, we're witnessing a...",
  "knowledge_concepts_used": [
    "stablecoin-business-model",
    "financial-disintermediation",
    "enterprise-payment-infrastructure",
    "network-effects",
    "regulatory-arbitrage",
    "private-money-systems",
    "digital-asset-treasuries",
    "cross-border-payment-efficiency",
    "smart-contract-automation",
    "proof-of-reserve",
    "genius-act-regulation",
    "fsb-global-framework",
    "central-bank-digital-currency",
    "machine-economy",
    "venture-capital-paradigm-shift",
    "financial-infrastructure-ownership"
  ],
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-30T13:03:20.218Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment084.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment085.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment086.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment087.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment088.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment089.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment090.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment091.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment092.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment093.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment094.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment095.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment096.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment097.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment098.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-09-28-corporate-stablecoin-paradigm-shift-private-money-printing/segment099.ts"
    ]
  }
}