{
  "id": "2025-07-15-treasury-stablecoin-shadow-money-system",
  "status": "translated",
  "category": "macro",
  "date": "2025-07-16",
  "language": "en-US",
  "title": "When stablecoins become “shadow central banks”: How the $260 billion parallel currency system is reshaping global finance",
  "content": "Have you ever thought that a company called Tether holds more U.S. Treasuries than most countries? Or that the $33 trillion in transactions that flow through the blockchain every day exceeds the sum of Visa and Mastercard? We are witnessing a silent financial revolution. Stablecoins backed by U.S. Treasuries are building a $260 billion \"shadow money system\" that not only changes the definition of money, but may also reshape the entire global financial landscape. \"Central Banks\" in Parallel Universes Let me explain this phenomenon with a simple metaphor. Imagine the traditional dollar system is a huge bank, with the Federal Reserve as the head office and major commercial banks as branches. Every transaction needs to be cleared and settled through this huge system. Now, stablecoins have created a \"parallel universe\" banking system. When you hand over $100 to Tether or Circle, instead of putting the money in a safe, they immediately go to buy U.S. Treasury bonds. Then, they give you a \"digital receipt\" - a stablecoin, which can be traded anywhere in the world at any time, just like cash. This seemingly simple process actually creates a whole new form of currency. The stablecoin in your hand is no longer a \"bank deposit\" in the traditional sense, but a \"digital Treasury certificate\". Its value is not supported by the credit of the bank, but by the credit of the U.S. government. The scale can no longer be ignored The scale of this \"shadow money system\" has reached an astonishing level. At present, the total circulation of stablecoins such as USDT and USDC has reached 220-256 billion US dollars, accounting for about 1% of the US M2 money supply. But what is more amazing is its frequency of use. The annual turnover rate of traditional bank deposits is about 12 times, while the annual turnover rate of stablecoins is as high as 150 times. This means that although stablecoins only account for 1% of the money supply, their importance in actual transactions far exceeds this proportion. According to forecasts by Standard Chartered Bank and the U.S. Treasury, by 2028, the total size of stablecoins could reach $2 trillion, accounting for about 9% of U.S. M2. This is equivalent to the size of current institutional dedicated money market funds. Mirror of History: From \"Wildcat Banks\" to \"Eurodollars\" This phenomenon is not uncommon in history. In the 19th century, the United States experienced the \"Wildcat Bank Era\", when thousands of state banks issued their own banknotes, each with a different credit rating and requiring a discount when trading. A more recent example is the \"Eurodollar Market\" that emerged in the 1960s. This refers to US dollar deposits held in banks outside the United States. They are free from the direct control of the Federal Reserve and have created a huge offshore dollar market. Stablecoins can be said to be \"Eurodollars in the digital age.\" They also bypass the traditional banking system and create a global network of US dollar circulation. But unlike Eurodollars, stablecoins are not deposits, but digital assets based on blockchain technology, with the characteristics of instant settlement, programmability and global accessibility. Three levels of systemic impact The impact of stablecoins on the financial system can be divided into three levels: The first level: changes in the money creation mechanism Traditional money creation is mainly achieved through bank lending. Banks take in deposits and then lend to businesses and individuals, creating new money in the process. But the mechanism of stablecoins is completely different: they do not \"create\" money, but \"convert\" money. When someone buys a stablecoin with US dollars, the underlying US dollars are used to buy Treasury bonds, and the stablecoin becomes a new payment tool. This is equivalent to converting funds that were originally \"sleeping\" in the banking system into high-speed digital currency. The second layer: the challenge of the interest rate transmission mechanism The traditional way for the Federal Reserve to control interest rates is by influencing the lending costs of banks. But the interest rate of stablecoins is mainly determined by short-term Treasury yields, not interbank lending rates. It's like building a whole new water supply system next to the traditional water pipe system. When the Fed tries to adjust the water pressure, the new system may not respond in full sync, which increases the complexity of monetary policy. The third layer: new risks to financial stability The redemption mechanism of stablecoins is different from traditional bank deposits. When large-scale redemptions occur, stablecoin issuers may need to sell a large amount of Treasury bonds in a short period of time. Considering the $150-200 billion in Treasury bonds currently held by stablecoin issuers, this risk of \"chain fire\" should not be underestimated. In March 2020, at the beginning of the outbreak, even the U.S. Treasury market experienced a liquidity crisis, and the Federal Reserve had to intervene urgently. If there is a large-scale redemption of stablecoins in the future, a similar crisis may recur. A new weapon in geopolitics The rise of stablecoins also has profound geopolitical implications. For the United States, stablecoins actually strengthen the global hegemony of the U.S. dollar. In the past, central banks and governments of other countries have tried to reduce their dependence on the U.S. dollar by \"de-dollarizing\". But stablecoins make it easy for ordinary people to hold and use dollars, which makes government-level \"de-dollarization\" efforts more difficult. Imagine if a country's government decided to restrict the use of the US dollar, but citizens could easily circumvent these restrictions through stablecoins, then the effectiveness of the government's policies would be greatly reduced. For other countries, stablecoins could lead to \"digital dollarization.\" When a country's citizens and businesses use a large number of US dollar stablecoins for transactions, the effectiveness of the country's central bank's monetary policy will be weakened. It's like inserting a \"foreign heart\" into the country's monetary system. Technological Revolution: \"Programmable Money\" vs. \"Dumb Money\" Stablecoins are not just digital dollars, they are \"programmable money.\" This means that they can be combined with smart contracts to realize automated financial services. For example, you can set up a smart contract to automatically invest the excess in a DeFi protocol to earn interest when your stablecoin balance exceeds $1,000. Or, you can set up an automatic payment system to automatically deduct rent from your stablecoin account every month. This kind of \"programmability\" is not available in traditional bank deposits. Traditional bank deposits are more like \"dumb money\" - they can only passively wait for manual operations. This technological difference may lead to the differentiation of the financial system: one is an efficient, automated, and globally interconnected \"programmable money\" layer, and the other is a traditional \"dumb money\" layer that requires manual intervention. The balancing act of regulation Faced with the rapid development of stablecoins, regulators are looking for a balance. They don't want to stifle innovation, nor do they want to let systemic risks get out of control. The most likely regulatory framework is \"parallel regulation\" - creating dedicated regulatory rules for stablecoins rather than simply applying existing banking or securities regulations. This framework may include: 1. Reserve requirements: Stablecoins are required to be 100% backed by high-quality assets, mainly short-term government bonds and cash. 2. Redemption guarantees: Guaranteed holders can redeem stablecoins at face value at any time. 3. Transparency requirements: Regularly publish detailed reserve composition and audit reports. 4. Systemic importance supervision: Implement prudential supervision similar to that of banks on large stablecoin issuers. 5. International coordination: Due to the global nature of stablecoins, coordinated cooperation among regulatory agencies of various countries is required. Three scenarios for the future According to my analysis, there are three possible scenarios for the future development of stablecoins: Scenario 1: Absorption scenario Stablecoins successfully absorb newly issued U.S. Treasury bonds to help the government finance its deficit. In this case, stablecoin issuers become important buyers of government debt, forming a mechanism of \"private sector absorbing public deficits\". Scenario 2: Crowding out Scenario Stablecoins compete with traditional buyers of government bonds (such as pension funds, insurance companies, and foreign central banks), which may distort the yield curve and affect the normal operation of financial markets. Scenario 3: Crisis Scenario Problems with a major stablecoin issuer trigger large-scale redemptions, leading to a liquidity crisis in the short-term government bond market. This may require emergency intervention by the Federal Reserve, as it did in March 2020. Actual impact on ordinary people What does the development of stablecoins mean for ordinary users? Benefits: 1. Cheaper cross-border remittances: Traditional remittance costs are usually 6-14%, while the cost of stablecoin remittances is only 0.05%. 2. 24/7 real-time settlement: not restricted by bank business hours, transactions can be conducted at any time. 3. Financial inclusion: even if you do not have a bank account, you can access the global financial system through stablecoins. 4. Programmability: you can set up automated financial services such as automatic savings, automatic investment, etc. Risks: 1. Issuer risk: if there is a problem with the stablecoin issuer, users may face losses. 2. Technical risks: technical risks such as smart contract vulnerabilities and hacker attacks. 3. Regulatory risks: changes in regulatory policies may affect the use of stablecoins. 4. Liquidity risk: In extreme cases, it may not be possible to redeem in time. New opportunities for investors For investors, the stablecoin ecosystem has created some new opportunities: 1. Zero interest vs. interest-bearing: You can choose to hold zero-interest stablecoins (such as USDT, USDC) for trading, or hold interest-bearing tokenized treasury products (such as tokenized T-bills) to earn income. 2. Equity of stablecoin issuers: Invest in the equity of stablecoin issuers such as Circle and Paxos, and share their profits from treasury bond income. 3. Infrastructure investment: Invest in the infrastructure that supports the stablecoin ecosystem, such as blockchain networks, wallet services, payment processing, etc. 4. Arbitrage opportunities: arbitrage by taking advantage of the price difference between stablecoins and traditional financial products. Central bank counterattack: acceleration of CBDC Faced with the rapid development of stablecoins, central banks of various countries are accelerating the development of central bank digital currencies (CBDC). CBDC can be seen as the central bank's \"counterattack\" against private stablecoins. They provide a risk-free digital currency option while maintaining the central bank's full control over monetary policy. But CBDC faces its own challenges: privacy protection, technical implementation, international coordination, etc. Moreover, the introduction of CBDC may affect the deposit base of commercial banks, which in turn will bring new financial stability risks. Conclusion: Evolution, not revolution Stablecoins are not a revolution of the existing financial system, but an evolution. Instead of overthrowing the dollar system, they may have strengthened the global status of the dollar. Instead of eliminating banks, they have created a more efficient payment and settlement network outside the banking system. The core of this evolution is \"efficiency\". Stablecoins provide faster, cheaper and more convenient financial services, which is the fundamental reason for their success. But efficiency improvements are often accompanied by a redistribution of risks. Stablecoins transfer certain risks from the banking system to the Treasury market and certain risks from the government to the private sector. The financial system of the future may be a hybrid: traditional banks handle complex credit operations, stablecoins handle high-frequency payments and settlements, and the central bank maintains policy control through CBDC. The three coexist and check and balance each other. In this process, the most important thing is to remain adaptable. Whether you are an investor, policymaker or ordinary user, you need to understand this emerging \"shadow money system\" and learn to find your place in it. Because whether we are ready or not, this parallel financial universe has quietly formed around us. It will not replace the existing financial system, but it will coexist with the existing system and may surpass it in some areas. The next time you use a stablecoin, remember: you are not just using a digital currency, you are also participating in a historic experiment that is changing the global financial landscape.",
  "references": [
    "https://www.panewslab.com/zh/articles/t2k8r910rj8m",
    "https://www.standardchartered.com/en/news-and-insights/",
    "https://www.treasury.gov/resource-center/data-chart-center/quarterly-refunding/",
    "https://www.federalreserve.gov/monetarypolicy/",
    "https://www.bis.org/publ/work905.pdf",
    "https://www.imf.org/en/Publications/",
    "https://www.financialstabilityboard.org/publications/",
    "https://www.brookings.edu/research/",
    "https://www.bankofengland.co.uk/quarterly-bulletin/",
    "https://www.ecb.europa.eu/pub/economic-research/"
  ],
  "audio_file": "audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system.wav",
  "social_hook": "🚨 Shocking: Tether holds more US debt than most countries! Stablecoins build a $260 billion \"shadow central bank\" with daily transactions of 33...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-19T01:30:09.243Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment078.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment079.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment080.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment081.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment082.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment083.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-07-15-treasury-stablecoin-shadow-money-system/segment084.ts"
    ]
  }
}