{
  "id": "2025-08-23-dat-digital-asset-treasury-regression-reflexivity",
  "status": "translated",
  "category": "macro",
  "date": "2025-08-24",
  "language": "en-US",
  "title": "When Wall Street meets Bitcoin \"treasury\": Why is the digital asset treasury strategy a financial innovation or a historical regression?",
  "content": "The ancient Chinese philosopher Lao Tzu once said, \"The opposite is the movement of the Tao; the weak is the use of the Tao.\" This means that things often develop in the opposite direction, and seemingly weak forces can actually be effective. This principle also applies in the financial world: While everyone is ecstatic about Wall Street's \"Digital Asset Treasury\" (DAT) strategy, we should perhaps ask a deeper question: Is this seemingly innovative financial engineering actually \"reversing the natural order,\" returning the nascent cryptocurrency market to its barbaric days?\n\nImagine this scenario: Your friend Xiao Chen opens a popular nightclub with long lines every night. Initially, the club has a unique music and atmosphere, but gradually, the lines themselves become its biggest selling point. People no longer come because they enjoy the music; they queue because they see long lines and think, \"This must be great!\" The more people line up, the more people want to join. Until one day, when the \"influencers\" start moving elsewhere, the lines vanish, and the nightclub closes. This is a reflection of the recent DAT craze on Wall Street: MicroStrategy pioneered the \"issue stock → buy Bitcoin → stock price rises → issue more stock\" model, inspiring countless imitators. But how long can this \"reflexive\" boom last?\n\n**On the surface, the DAT strategy represents a financial innovation for enterprise-scale digital asset allocation. In reality, it's Wall Street dragging the newly mature cryptocurrency market back into the speculative era of \"telling stories for stocks.\" **\n\n**First, how is traditional corporate treasury typically managed? **\n\nIn traditional corporate financial management, the \"treasury\" has a clear functional division. Much like a conservative housewife managing her household: short-term working capital is placed in bank deposits or money market funds to ensure liquidity; medium-term funds are invested in high-grade bonds or fixed deposits to balance safety and profitability; and long-term idle funds may be invested in stocks or real estate to pursue capital appreciation. This \"asset-liability matching\" logic has been in place for decades and, while conservative, is stable.\n\nThe traditional CFO's focus is on minimizing capital costs and managing financial risk. They calculate the weighted average cost of capital (WACC), create cash flow forecasts, consider bond maturity matching, and assess credit risk. These seemingly mundane tasks actually provide stable financial support for a company's core business. Like a good logistics corps, their value lies not in winning battles but in ensuring that the frontline troops have sufficient ammunition and supplies.\n\nAs early as 1958, Modigliani and Miller of MIT proposed the famous MM Theorem: under ideal market conditions, a company's value is unrelated to its capital structure. The underlying implication of this theory is that a company's value should derive from its operational capabilities, not its financial skills. Traditional corporate finance is based on this premise: reducing financial costs through sound cash management allows management to focus on creating value in the core business.\n\nBut the problem with this system lies in its \"opportunity cost.\" When inflation exceeds 2% and corporate cash earns only a 1% return, purchasing power is effectively eroded. When Bitcoin's annualized return reaches 80% while corporate cash sits in banks, earning meager interest, shareholders begin to question management's capital allocation skills. This is why MicroStrategy CEO Michael Saylor once said, \"Holding cash is waiting for poverty.\"\n\n**Second, why does the DAT strategy seem so attractive? **\n\nThe core logic of the DAT strategy can be summed up in one word: \"financial alchemy.\" MicroStrategy began this experiment in August 2020 and has since accumulated over 620,000 Bitcoins, with a market capitalization exceeding $62 billion. Even more astonishingly, the company's stock price has far outpaced the rise in Bitcoin itself, creating the so-called \"Bitcoin leverage effect.\"\n\nThe core mechanism of this strategy is a \"reflexive positive loop\": the company announces a Bitcoin purchase → the market interprets it as bullish on Bitcoin's prospects → the stock price rises → the company can issue new shares or bonds at a higher price → raise more funds to purchase more Bitcoin → further driving up the Bitcoin price → the stock price rises again. George Soros calls this phenomenon \"reflexivity\": participants' perceptions influence market conditions, and market conditions in turn influence participants' perceptions, creating a self-reinforcing feedback loop.\n\nFrom an investor's perspective, the DAT strategy addresses several practical issues. First, there's the issue of \"compliance access\": many institutional investors are unable to purchase Bitcoin directly due to regulatory restrictions, but they can purchase shares in publicly traded companies that hold Bitcoin. Second, there's the issue of \"leverage\": through corporate debt financing, investors can indirectly gain leveraged exposure to Bitcoin. The third is \"professional management\": corporate management is responsible for complex matters such as trading timing, safekeeping, and tax processing.\n\nMore importantly, the DAT strategy creates the effect of a \"synthetic Bitcoin ETF.\" Before the US SEC approved a Bitcoin spot ETF, MicroStrategy was effectively one of the primary channels for institutional investors to access Bitcoin. BlackRock's Larry Fink once said, \"Bitcoin is digital gold.\" DAT companies are like \"digital gold mining companies,\" providing convenient investment tools for investors who want gold exposure without directly holding it.\n\nMathematically, this strategy has indeed produced astonishing returns. MicroStrategy's BTC yield is expected to reach 25% in 2025, meaning the number of Bitcoins held per share has increased by 25%. This \"Bitcoin amplifier\" effect allows shareholders to benefit from both rising Bitcoin prices and an increase in the number of Bitcoins they hold.\n\n**Third, why do most people misunderstand this trend?**\n\nMisunderstanding the DAT strategy primarily stems from three cognitive biases: reflexivity blind spot, regulatory arbitrage illusion, and misjudgment of market maturity.\n\nThe first is the \"reflexivity blind spot.\" Most investors only see the positive aspects of the reflexive cycle, ignoring its double-edged sword nature. As Soros warned, \"During booms, lending increases, driving up land values, which in turn serve as collateral to support more lending. This process appears to go on indefinitely—but it doesn't.\" The same applies to the DAT strategy: when Bitcoin prices fall, companies' balance sheets deteriorate, stock prices plummet, and financing capacity decreases. They may even be forced to sell Bitcoin to repay debts, further depressing Bitcoin prices. This risk of a \"collapsing spiral\" isn't theoretical; it's mathematically inevitable.\n\nSecondly, there's the \"regulatory arbitrage illusion.\" Many believe the DAT strategy is a permanent innovation, but in reality, it's more of a transitional product for regulatory arbitrage. With the approval of Bitcoin spot ETFs, institutional investors now have a more direct and affordable way to gain Bitcoin exposure. Why pay corporate management fees, bear corporate governance risks, and endure the added volatility of stocks just to indirectly own Bitcoin? It's like insisting on taking a rough road after a highway is already available.\n\nThe most profound misunderstanding is a misjudgment of \"market maturity.\" Over the past few years, the cryptocurrency market has evolved from pure speculation to a stage based on fundamental analysis. DeFi protocols are beginning to generate real revenue and profits, Layer 2 solutions have measurable performance metrics, and NFT projects have analyzable user data. This is a sign of market growth, indicating that investors are beginning to analyze crypto projects using mature valuation methods like price-to-earnings (PE) and price-to-sales (PS) ratios.\n\nHowever, the DAT craze has dragged the entire market back to the \"PN\" (price-to-narrative) era—an era of speculation driven by paying for stories and concepts. Investors no longer care about the profitability of MicroStrategy's software business or analyze Bitcoin's fundamental supply and demand relationships. Instead, they simply pay a premium for the narrative of \"Bitcoin exposure.\" This regression is like sending a child, just learning to think rationally, back to believing in fairy tales.\n\nIn \"Thinking, Fast and Slow,\" behavioral economist Daniel Kahneman argues that when faced with complex problems, people often resort to simple heuristics instead of in-depth analysis. The popularity of the DAT strategy embodies this psychological mechanism: the simple equation \"buy MicroStrategy = buy Bitcoin\" allows investors to avoid the complex tasks of understanding blockchain technology, analyzing market structure, and assessing regulatory risks. However, this cognitive shortcut often leads to systematic decision-making errors.\n\n**Philosophical Reflection: When Financial Innovation Meets the Cycle of History**\n\nGerman philosopher Hegel once said, \"The only lesson history teaches us is that we never learn from history.\" When we examine the DAT phenomenon, it's hard not to think of the conglomerate boom of the 1960s and the dot-com bubble of the 1990s. In those eras, investors also paid frantic premiums for seemingly innovative business models, only to burst when reality failed to live up to expectations.\n\nBut perhaps this is precisely the necessary evolution of financial markets. Each seemingly \"backward\" speculative boom builds experience and infrastructure for the next true innovation. While the DAT strategy may end in a bubble burst, it has indeed driven institutional adoption of cryptocurrencies, established a precedent for enterprise-scale digital asset management, and provided regulators with a real-world example for policymaking.\n\nPerhaps true wisdom lies not in judging the DAT strategy's merits but in understanding its place in the history of financial evolution. As Darwin's theory of evolution teaches us, biological evolution isn't always a straight line. Sometimes, seemingly \"degenerate\" traits can be advantageous in specific environments. These traits may disappear when the environment changes, but they provide valuable adaptability for a species' survival.\n\nIn the historical journey of cryptocurrency from the fringe to the mainstream, the DAT strategy may play precisely such a transitional role. It's neither a destination nor a mistake, but rather a necessary experiment. When the experiment concludes, the market will retain valuable innovations and discard ineffective noise. As observers, the best attitude is to maintain curiosity and critical thinking, neither blindly following trends nor easily dismissing them, but rather striving to understand the underlying logic of this complex financial system. After all, understanding is more important than judgment, and learning is more valuable than taking sides.",
  "references": [
    "https://www.panewslab.com/zh/articles/8a28051e-7539-4f2f-8d5e-a6be363ed9db",
    "https://home.cib.natixis.com/navigating-a-new-era-of-corporate-finance-bitcoin-treasury-companies",
    "https://www.ainvest.com/news/bitcoin-corporate-treasury-asset-microstrategy-bold-strategy-reshaping-institutional-investment-2507/",
    "https://www.ainvest.com/news/microstrategy-bitcoin-treasury-strategy-high-conviction-play-digital-capital-financial-innovation-2508/",
    "https://www.onesafe.io/blog/microstrategy-bitcoin-corporate-treasury",
    "https://www.okx.com/learn/microstrategy-bitcoin-strategy-corporate-treasury",
    "https://novelinvestor.com/reflexivity-explaining-bubbles/",
    "https://accountend.com/soros-general-theory-of-reflexivity-a-deep-dive-into-financial-markets-and-human-behavior/",
    "https://hw.online/education/george-soros-and-his-theory-of-reflexivity/",
    "https://blogs.cfainstitute.org/investor/2016/12/19/soros-fallibility-reflexivity-and-the-importance-of-adapting/",
    "https://macro-ops.com/understanding-george-soross-theory-of-reflexivity-in-markets/",
    "https://hedgefundalpha.com/george-soros-investing-rules-and-the-theory-of-reflexivity/",
    "https://medium.com/mark-fasciano/on-bubbles-and-cannonballs-soros-reflexivity-theory-255230b5561b",
    "https://www.valuewalk.com/soros-lecture-reflexivity-application-markets/"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity.wav",
  "social_hook": "🏦⚡ When Wall Street meets Bitcoin's \"treasury,\" is it financial innovation or historical regression? How does Lao Tzu's \"reversal is the movement of...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-24T02:01:02.642Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/macro/2025-08-23-dat-digital-asset-treasury-regression-reflexivity/segment070.ts"
    ]
  }
}