{
  "id": "2025-08-22-brevis-zk-democratization-infrastructure",
  "status": "translated",
  "category": "defi",
  "date": "2025-08-24",
  "language": "en-US",
  "title": "When \"zero knowledge\" is no longer the exclusive domain of experts: How does Brevis make cryptography a basic infrastructure accessible to everyone?",
  "content": "19th-century French mathematician Évariste Galois once profoundly wrote, \"Mathematics has no kings.\" What he failed to add is that mathematics does have entry barriers—extremely high ones. For decades, zero-knowledge proofs (ZKPs) have been the \"bible\" of cryptography, truly understood and applied only by a select few experts with a solid mathematical foundation. Today, however, a platform called Brevis is rewriting this rulebook, transforming ZKPs from \"a cryptic theory in academic papers\" into \"an API accessible to every developer.\"\n\nImagine this scenario: Your friend Xiao Chen is a blockchain developer who wants to add privacy protections to his DeFi application. Traditionally, he would have needed to spend months learning elliptical curve cryptography, understanding the mathematical principles of various zero-knowledge proof protocols, implementing complex circuit designs himself, and then worrying about security vulnerabilities and performance optimization. But using Brevis' Pico zkVM, Xiao Chen only needed to write a few lines of code in the familiar Rust language to generate mathematically perfect zero-knowledge proofs. 8,000 daily active developers have already generated 50 million proofs using this platform, and these proofs are generated 70-155% faster than competitors. Xiao Chen was puzzled: This seemed too easy. Is it really secure?\n\nOn the surface, this is about the efficiency of a development tool that lowers the technical barrier to entry; in reality, it's about a civilizational shift, a shift from a \"trust-based society\" to a \"proof-based society.\"\n\nFirst, how does zero-knowledge proof traditionally work?\n\nTo understand the revolutionary nature of Brevis, we must first understand what zero-knowledge proof actually is. Simply put, it's a magical mathematical technique: I can prove to you that I know a secret, without revealing the secret.\n\nImagine you're playing a number guessing game. You think of a number between 1 and 100, and I claim to be able to guess it. But I don't want to tell you the answer directly, because that would reveal my \"magic.\" A zero-knowledge proof allows me to prove to you that I know a number without revealing its exact value. In cryptography, this \"secret\" might be your private key, your identity, or the result of a complex calculation.\n\nTraditional zero-knowledge proof implementations are like requiring anyone who wants to play magic to first become a math PhD. You need to understand group theory, elliptical curves, finite field arithmetic, polynomial commitment schemes... these concepts are beyond the pale of most software engineers. Even if you understand the theory, translating it into secure and efficient code still requires a high level of expertise. A single implementation error could compromise the entire system.\n\nThis is why, over the past decade, zero-knowledge proofs have been largely confined to academic labs and a handful of specialized companies. Just as early computers required specialized operators, zero-knowledge proofs require specialized cryptographers. While this specialization ensures security, it also severely limits the technology's widespread adoption and innovation.\n\nFrom an economic perspective, this is a classic example of the \"expertise barrier\" problem. When the cost of using a technology (including learning, implementation, and maintenance) is too high, it is mastered by only a select few and cannot realize its true social value. It's like language: Latin, while precise and beautiful, was ultimately replaced by more accessible modern languages precisely because it was too expensive to learn.\n\n**Second, why is Brevis's approach a better solution?**\n\nBrevis' core insight is that developers don't need to understand the mathematical principles of zero-knowledge proofs, just as you don't need to understand the details of the TCP/IP protocol to use the internet. The Pico zkVM they built is essentially a \"zero-knowledge proof compiler,\" wrapping complex cryptographic operations into a simple programming interface.\n\nThe technological breakthrough is reflected in three aspects. First, performance optimization: Pico performs 70-155% faster on CPUs than competitors such as RISC Zero and SP1, and achieves the fastest zero-knowledge VM performance on a single GPU. This isn't an incremental improvement, but an architectural innovation—they employ a modular \"glue + coprocessor\" design, seamlessly combining the efficiency of specialized circuits with the flexibility of general-purpose virtual machines.\n\nSecondly, Pico is developer-friendly: it supports the Rust language, meaning zero learning curve for blockchain developers. You don't need to learn a new domain-specific language, understand circuit design, or even know what an \"ellipse curve\" is. Simply write ordinary Rust code, and Pico will automatically compile it into efficient zero-knowledge proof circuits.\n\nMost importantly, it offers customization: this is the first zkVM to support customizable proof systems and prime number fields. Different application scenarios require different security parameters and performance trade-offs. Pico allows developers to fine-tune these parameters to their specific needs without modifying any underlying code. It's like Lego bricks—the same basic building blocks can be used to construct countless different architectures.\n\nFrom a business model perspective, Brevis adopts a \"platform strategy\" rather than an \"application strategy.\" They aren't building a specific zero-knowledge application, but rather the infrastructure that enables millions of applications. The network effect of this model is extremely powerful: the more developers use Pico, the more tools, tutorials, and best practices will form around it, attracting even more developers.\n\nThe data demonstrates the success of this strategy: nearly 8,000 daily active users, 50 million generated proofs, integration with five major blockchains, and adoption by mainstream projects such as PancakeSwap, Thena, and OpenEden. This isn't an experimental technical demo, but a proven infrastructure that has been tested in production environments.\n\n**Third, why do most people misunderstand this change?**\n\nThe misunderstanding of the Brevis phenomenon stems primarily from three cognitive biases: technological mysticism, security conservatism, and a lack of understanding of the nature of this \"infrastructure revolution.\"\n\nThe first is technological mysticism. Many people (including some technical professionals) subconsciously believe that the more difficult a technology is to learn, the more advanced it is, and that the easier it is to use, the less trustworthy it is. This thinking stems from a confusion between \"complexity\" and \"effectiveness.\" Just as many people consider the command line more professional than a graphical interface, some developers consider handwriting zero-knowledge circuits more secure than using advanced tools.\n\nHowever, this thinking overlooks a key fact: complexity is often a breeding ground for errors. Humans are more prone to error when tackling complex tasks, while machines (compilers, toolchains) are generally more reliable in this regard. The entire trend in modern software development is to manage complexity with tools, rather than letting humans directly confront it.\n\nThe second misconception stems from security conservatism. The cryptography community has always been known for its cautious approach, which is a good thing, but sometimes this caution can become a barrier to innovation. Whenever a new tool or method emerges, some people often question, \"Is this really as secure as handwritten circuitry?\"\n\nThis concern is understandable, but there's also a flip side: handwritten circuitry is inherently error-prone, and most developers simply don't have the skills to correctly implement complex zero-knowledge protocols. By contrast, widely tested compilers and toolchains are generally more reliable. Just as we wouldn't expect every website developer to hand-code a TCP/IP protocol implementation, it's unrealistic to expect every dApp developer to hand-code zero-knowledge circuitry.\n\nThe most profound misunderstanding stems from a lack of appreciation for the true nature of this \"infrastructure revolution.\" Many view Brevis as \"just another development tool,\" unaware of the paradigm shift it represents. Just as people in 1995 might have thought that \"the internet is just another way to communicate,\" people today might think that \"zero-knowledge proofs are just another encryption technology.\"\n\nBut the true significance of zero-knowledge proofs is that they allow us to collaborate without trusting each other. This isn't just a technological advancement; it's an advancement in how society is organized. When verification becomes easier than trust, we can build more open, transparent, and secure systems.\n\nHistorically, every major infrastructure revolution has followed the same path: initially accessible only to experts, then tools become accessible to everyone, and ultimately the technology becomes fundamental to how society functions. This is the case with the printing press, electricity, and the internet. Today, zero-knowledge proofs are undergoing a similar transformation, and Brevis is a key driver of this shift.\n\n**Conclusion: When Proofs Become the New Currency**\n\nGerman philosopher Martin Heidegger once said, \"Language is the home of existence.\" In the digital age, we might say, \"Proofs are the home of trust.\" When Brevis makes zero-knowledge proofs as easy as sending an email, we are effectively building a new social infrastructure—a collaborative system based on mathematical proofs rather than social trust.\n\nThe significance of this transformation goes far beyond technology. In traditional societies, trust is established and maintained through reputation, laws, and institutions—a process that is slow, expensive, and prone to abuse. In a system based on zero-knowledge proofs, trust becomes a mathematical problem: either it's proven, or it's not.\n\nOf course, the democratization of technology also brings new challenges. While more people have access to powerful tools, it also means greater potential for abuse. How to maintain the security and stability of the system while making the technology accessible is an ongoing challenge for Brevis and the entire zero-knowledge proof community.\n\nBut history teaches us that the general trend of technological progress is unstoppable. Printing democratized knowledge, the internet democratized information, and now zero-knowledge proofs are democratizing trust. In this process, infrastructure builders like Brevis play a crucial role—not only driving technological development but also shaping the collaborative models of future societies.\n\nPerhaps one day, when our grandchildren look back, they will be amazed at how much we relied on \"taking others' word\" to organize society. \"Using mathematics to prove everything that can be proven\" may become as natural to them as \"using Google to search for everything that can be found\" is to us. And when that happens, they will be grateful to pioneers like Brevis, who transformed \"zero knowledge\" from the privilege of experts into infrastructure available to everyone.",
  "references": [
    "https://www.panewslab.com/zh/articles/5da93026-8150-4924-84ec-98ec3b5060f8",
    "https://docs.brevis.network/",
    "https://www.panewslab.com/en/articles/5da93026-8150-4924-84ec-98ec3b5060f8",
    "https://mpost.io/brevis-unveils-pico-the-next-generation-of-zkvms/",
    "https://en.cryptonomist.ch/2025/02/12/brevis-presents-pico-v1-0-the-future-of-customizable-and-high-performance-zkvms-for-web3-applications/",
    "https://brevis.network/",
    "https://www.cointrust.com/market-news/brevis-unveils-pico-a-high-performance-modular-zkvm",
    "https://www.livebitcoinnews.com/brevis-unveils-pico-v1-0-a-modular-zkvm-for-scalability/",
    "https://cryptopotato.com/brevis-unveils-pico-the-next-generation-of-zkvms/",
    "https://arxiv.org/html/2408.00243v1",
    "https://5g.wilsoncenter.org/article/dont-trust-when-you-can-verify-primer-zero-knowledge-proofs",
    "https://www.infisign.ai/blog/zero-knowledge-proof-applications",
    "https://www.coindesk.com/opinion/2024/09/03/how-decentralized-ai-and-zero-knowledge-proofs-will-democratize-compute",
    "https://chain.link/education-hub/zero-knowledge-proof-use-cases"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure.wav",
  "social_hook": "🧠 Cryptography is no longer the exclusive domain of a few experts! Brevis is transforming \"zero-knowledge proofs\" from esoteric academic theory into...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-24T02:01:45.544Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-22-brevis-zk-democratization-infrastructure/segment069.ts"
    ]
  }
}