{
  "id": "2025-09-22-vitalik-low-risk-defi-ethereum-google-search",
  "status": "translated",
  "category": "defi",
  "date": "2025-09-22",
  "language": "en-US",
  "title": "When Vitalik Buterin Stops Scooping Up DeFi: Why Low-Risk DeFi Could Become Ethereum's \"Google Search\"?",
  "content": "Have you ever wondered why Ethereum founder Vitalik Buterin (V God, the creator and spiritual leader of the Ethereum blockchain) suddenly changed his stance in support of DeFi? This technical genius, who once publicly criticized DeFi as \"merely speculation and gambling,\" recently published a shocking article comparing low-risk DeFi to Google's search business—the core revenue source that supports the entire Google empire.\n\nThis is not a simple change of attitude, but a redefinition of the future development path of the entire cryptocurrency ecosystem. When the world's most knowledgeable person about Ethereum tells you that \"DeFi spring has arrived,\" what exactly is going on behind the scenes?\n\nFirst, what exactly has Vitalik changed his mind about? **\n\nVitalik admitted in the article, \"I've long been skeptical of DeFi because it doesn't seem to offer any real services.\" He noted that the main selling point of traditional DeFi is \"making money by trading highly speculative tokens or earning 10% to 30% returns through liquidity mining incentives.\"\n\nLiquidity mining refers to users depositing cryptocurrency into DeFi protocols to provide liquidity and receiving additional token rewards in return. This mechanism created a massive speculative bubble during the DeFi Summer of 2020.\n\nBut now, Vitalik has proposed a completely new concept: **low-risk DeFi**. This includes basic functions of payment and storage, synthetic assets (tokens created on the blockchain that represent real-world assets such as stocks, bonds, and commodities), fully collateralized lending, and the ability to exchange these assets.\n\nThis distinction is crucial. High-risk DeFi is about \"getting rich quick,\" while low-risk DeFi is about \"building better financial infrastructure.\" Just like the stock market has both speculation and infrastructure for business financing.\n\nSecond, why did Vitalik Buterin use Google as an analogy? **\n\nVitalik's analogy is brilliant: \"Google has made many interesting and valuable contributions to the world: the Chromium browser series, the Pixel phone, its AI work, the Go language, and so on. But in terms of revenue generation, these are not very profitable, and may even be loss-making. Instead, Google's largest revenue streams come from search and advertising.\"\n\nThis metaphor reveals an important insight: **Innovation and money-making projects are often not the same thing**. Google's AI research, open-source browser, and experimental hardware are all cool, but it's the \"boring\" but stable search advertising business that truly supports the company's operations.\n\nThe situation is similar for Ethereum. Privacy protocols like Tornado Cash, decentralized social networks like Lens Protocol, and prediction markets like Polymarket are all innovative, but the economic activity they generate is \"too little to support a $500 billion ETH economy.\"\n\nLow-risk DeFi, on the other hand, is like Google's search business: it may not look sexy, but it generates a lot of real economic value. When the world demands permissionless global payments, competitive savings rates, and access to major asset classes, this creates a massive, sustainable market.\n\n**Third, why is now a critical moment for DeFi infrastructure? **\n\nV God mentioned two important historical turning points:\n\n**The changing regulatory landscape**: \"Gary Gensler and others should be severely criticized for creating a regulatory environment in which the less useful your application, the safer you are; the more transparent your behavior and the clearer the assurances you provide to investors, the more likely you are to be considered a 'security.'\"\n\nGary Gensler, former Chairman of the U.S. Securities and Exchange Commission (SEC), took an extremely strict regulatory stance on cryptocurrencies during the Biden administration. His strategy was known as \"regulating through enforcement,\" meaning he expressed regulatory intent through prosecution and fines rather than providing clear regulatory guidance.\n\nThe Trump administration changed all of this. The new policy direction is \"technology-neutral regulation,\" meaning that the use of blockchain technology will not automatically render a project suspicious. This provides room for legitimate DeFi infrastructure to develop.\n\n**Increasing Technological Maturity**: \"Over time, protocol security gradually improves and risks decrease.\" Data shows that DeFi protocols experienced 40% fewer attacks in 2024 than in 2023. Established protocols like Aave and Compound have been operating for years and have withstood countless market stress tests.\n\nMore importantly, DeFi attacks are \"increasingly being pushed to the fringes of the ecosystem—where users are more experimental and speculative.\" This means that core, mature DeFi protocols are becoming increasingly secure.\n\n**Fourth, why does low-risk DeFi align with Ethereum's cultural values?**\n\nVitalik highlighted a key difference: unlike Google's advertising business, low-risk DeFi is culturally aligned with the goals of the Ethereum community.\n\nGoogle's advertising model presents a fundamental ethical problem: \"Advertising revenue encourages the company to collect as much data as possible from users and retain ownership of that data. This runs counter to the open-source and positive-sum ethos that has historically motivated its more idealistic values.\"\n\n[Positive-sum ethos] refers to a cooperative model in which all parties benefit, rather than a zero-sum game (where one party's gain must be at the expense of another).\n\nLow-risk DeFi, however, does not suffer from this issue. Its business model is completely transparent: users pay gas fees (transaction fees on the Ethereum network) to access the service, and the protocol earns fees by providing real value. There's no hidden data collection, no attention hijacking, and no opaque algorithms.\n\nMore importantly, low-risk DeFi directly advances Ethereum's core mission: global financial inclusion. When a small business in a developing country can earn US Treasury yields through a DeFi protocol, or when migrant workers can send remittances home at a lower cost, it's more than just making money—it's changing the world.\n\n**Fifth, what might low-risk DeFi evolve into?**\n\nVirginia's vision for the future is particularly interesting. He believes low-risk DeFi isn't the endgame, but rather the foundation for higher-level financial innovation:\n\n**Reputation-based lending**: \"Once we build a mature ecosystem for both financial and non-financial activities on-chain, exploring reputation-based, low-collateralized lending will become meaningful.\"\n\nImagine if all your economic activity was recorded on the blockchain—your income, spending, investments, social interactions—and AI could analyze this data to assess your credit risk without the need for traditional collateral. This would be revolutionary for the billions of unbanked people around the world.\n\n**Combining prediction markets with hedging strategies**: \"If prediction markets become more mature, we may start to see them used for hedging.\" In traditional finance, complex hedging strategies are only available to large institutions. But in DeFi, anyone can combine prediction markets, derivatives, and spot trading to build sophisticated risk management strategies.\n\n**Stable value beyond the dollar**: \"Most people entering the cryptocurrency space are not driven by the dollar's adoption. Over time, we can begin to shift the ecosystem toward other stable forms of value: basket currencies, 'stablecoins' directly based on the consumer price index, 'personal tokens,' and so on.\"\n\nThis vision is particularly far-sighted. While DeFi currently primarily focuses on \"moving dollars onto the blockchain,\" the long-term goal is to create a completely new store of value and medium of exchange. Imagine a stablecoin based on the CPI [Consumer Price Index, a key measure of inflation] whose purchasing power remains stable over time, rather than depreciating like fiat currency.\n\n**Sixth, why is this shift important to ordinary people?**\n\nOn the surface, this discussion is about technology and investment. But in reality, it's about reshaping the global financial system.\n\nThe traditional financial system has numerous problems: high cross-border transfer fees, exclusive investment barriers, opaque operations, and dependence on political stability. When your national currency depreciates, your savings shrink. When you want to invest in the US stock market, you might be denied based on your residency. When you try to transfer money abroad, banks charge high fees.\n\nThe low-risk DeFi ecosystem described by Vitalik Buterin offers an alternative: anyone with an internet connection can access global financial markets, earn competitive yields at transparent costs, and without relying on the permission of any centralized institution.\n\nThis isn't science fiction. Millions of people already use protocols like Aave, Compound, and Uniswap for their daily financial activities. As the technology matures and regulations become clearer, this number will only continue to grow.\n\nWhat should investors be concerned about? **\n\nIf Vitalik's analysis is correct, we are at a critical juncture in DeFi's transition from a speculative tool to infrastructure. This means:\n\n**Focus on Infrastructure Tokens**: Mature protocol tokens like ETH, AAVE [the governance token of the Aave protocol], and COMP [the governance token of the Compound protocol] are likely to benefit from the growing demand for infrastructure.\n\n**Stablecoin Ecosystem**: As more real-world use cases emerge, demand for stablecoins will grow significantly. In addition to USDC and USDT, we should also pay attention to more innovative stablecoin projects.\n\n**Layer 2 Solutions**: Low-risk DeFi requires a low-cost trading environment. Layer 2 networks like Arbitrum [ARB], Optimism [OP], and Polygon [MATIC] will be crucial infrastructure.\n\n**Risk Warning**:\n- DeFi protocols still carry smart contract risks\n- Regulatory policies are subject to change\n- Market volatility remains high\n- Safe use requires technical knowledge\n\nVirginia's article isn't investment advice, but rather a profound reflection on the direction of the industry. However, for understanding the future of Ethereum and DeFi, it may be the most important article in recent years.\n\nWhen the creator of Ethereum tells us that \"low-risk DeFi is the Google search for Ethereum,\" we'd better listen. Because if he's right, we're witnessing not just a technological trend but the beginning of a fundamental shift in the global financial system.",
  "references": [
    "https://www.panewslab.com/zh/articles/b020366a-3a64-4cc1-896a-b927ba0fd933",
    "https://vitalik.eth.limo/general/2025/01/20/defi.html",
    "https://aave.com/",
    "https://compound.finance/",
    "https://defillama.com/",
    "https://www.sec.gov/",
    "https://ethereum.org/"
  ],
  "framework": "解讀分析式風格.md",
  "audio_file": "audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search.wav",
  "social_hook": "🎯 Vitalik suddenly backs DeFi! From \"speculative gambling\" to \"Google search for Ethereum\"—Why does he see low-risk DeFi as a \"money-printing...",
  "knowledge_concepts_used": [
    "network-effect",
    "regulatory-arbitrage",
    "infrastructure-financialization",
    "platform-monetization",
    "protocol-maturity",
    "financial-inclusion",
    "synthetic-assets",
    "yield-sustainability"
  ],
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-09-30T13:12:44.988Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-09-22-vitalik-low-risk-defi-ethereum-google-search/segment065.ts"
    ]
  }
}