{
  "id": "2025-08-17-edgex-zk-revenue-monster-defi",
  "status": "translated",
  "category": "defi",
  "date": "2025-08-24",
  "language": "en-US",
  "title": "When the Revenue Monster Breaks Through DeFi's Cognitive Ceiling: How does edgeX Use ZK Technology to Redefine Perpetual Contract Trading?",
  "content": "British economist John Keynes once said, \"The hard part is not accepting new ideas, but shedding old ones.\" Applied to today's DeFi world, this statement should perhaps be understood this way: when a perpetual contract platform, operating for only a year, can generate monthly revenue exceeding that of established protocols with years of operation, we need to re-evaluate our existing understanding of what constitutes a good trading platform. Recently, a ZK-based perpetual DEX called edgeX generated $10.53 million in fee revenue in 30 days, far surpassing GMX's $3.85 million and dYdX's $1.92 million, becoming the new \"revenue monster\" of the DeFi world.\n\nImagine this scenario: Your friend Xiao Wang is a seasoned trader who has been trading perpetual contracts on a traditional centralized exchange. He constantly complained about exchange crashes, frozen funds, and long withdrawal waits. Meanwhile, his friend, Xiao Li, recently discovered a platform called edgeX. Not only does it offer the same smooth trading experience as centralized exchanges, but it also gives users complete control over their funds and offers lower fees than Hyperliquid. Even more remarkable, this platform hasn't even issued a token, yet its revenue has already surpassed that of most established DeFi protocols. Xiao Wang was puzzled: How did they do it?\n\nOn the surface, this question seemed to be about how a new trading platform could quickly rise to prominence in the fiercely competitive perpetual contract market. But the real issue is this: We are witnessing DeFi's fundamental evolution from \"experimental finance\" to \"institutional-grade infrastructure,\" and the combination of ZK technology and traditional financial expertise is creating a completely different competitive dimension.\n\nFirst, how do perpetual contract trading platforms typically operate?\n\nTo understand the revolutionary nature of edgeX, we must first examine how the perpetual contract market operates. Perpetual contracts are essentially \"futures contracts that never expire.\" Originally invented by BitMEX in 2016, they address the need for periodic position rotation in traditional futures trading.\n\nImagine a unique tug-of-war game: On one side of the rope are bullish traders, and on the other are bearish traders. A red line runs down the middle of the rope, representing the spot price (for example, Bitcoin's actual market price). The goal of tug-of-war isn't to pull the other side down, but to keep the rope (the contract price) as close to the red line (the spot price) as possible.\n\nWhen market sentiment is extremely optimistic, everyone wants to go long, and the long side becomes overwhelming, easily pulling the rope away from the centerline. At this point, the referee (the trading platform) activates a \"funding rate\" mechanism: the overpowered party (the long side) pays a fee to the opposing party (the short side), aiming to attract more shorts and return the rope to a balanced position.\n\nTechnically, traditional sustainable DEXs face the \"impossible trinity\" challenge: decentralization, high performance, and low cost. Early protocols like GMX adopted an AMM (Automated Market Maker) model. While highly decentralized, large trades were subject to significant slippage, much like dropping a large stone into a small pond, which creates a large splash. Protocols like dYdX, while adopting an order book model, sacrifice many of these decentralized features to achieve high performance.\n\nFrom a game theory perspective, each perpetual DEX seeks an optimal solution within different constraints. Some protocols sacrifice performance to maintain decentralization, some sacrifice decentralization to improve performance, and still others use complex token incentive mechanisms to compensate for inherent product shortcomings. However, each of these trade-offs presents its own challenges: poor performance can drive away professional traders, low decentralization can undermine the core value of DeFi, and models that rely on token subsidies are often unsustainable.\n\nSecond, what is the optimal approach for edgeX's ZK architecture?\n\nedgeX's innovation lies in redefining the boundaries of the \"impossible trinity\" using ZK-rollup technology. If traditional solutions involve trade-offs between three objectives, then ZK technology, through mathematical breakthroughs, allows us to simultaneously approach all three.\n\nLet's use a more intuitive analogy to understand ZK-rollup. Imagine the Ethereum mainnet as a world-class court. Every case (transaction) undergoes a rigorous review process, resulting in high security but low efficiency. A ZK-rollup is like setting up an \"arbitration tribunal\" outside the courthouse, capable of handling a large number of simple cases. After each batch of cases is processed, it only needs to submit a \"proof of processing\" to the main court, proving that all cases were handled correctly in accordance with the law (smart contracts).\n\nEdgeX, built on StarkEx ZK-rollup, can process 200,000 orders per second with order matching latency under 10 milliseconds, a performance approaching that of traditional high-frequency trading systems. More importantly, thanks to the mathematical properties of ZK proofs, these transactions enjoy the same security guarantees as Ethereum mainnet, but at a cost hundreds of times lower.\n\nBut its real competitive advantage comes from the team's traditional financial background. EdgeX was incubated by Amber Group, and its core team hails from institutions such as Goldman Sachs and Jump Trading, who deeply understand the microstructure of traditional financial markets. They understand how to design a fee structure that attracts professional market makers (maker fees are just 0.015%, taker fees are 0.038%), how to maintain a deep order book (BTC/USDT supports $6 million worth of orders within a 0.01% spread), and how to design risk management systems to prevent chain liquidations in extreme market conditions.\n\nThis combination of ZK technology and traditional financial expertise creates a powerful economic flywheel: ultra-low market maker fees attract professional liquidity providers → tighter bid-ask spreads → attract more high-volume traders → higher trading volume and fee income → a competitive fee structure.\n\nFrom a network effect perspective, this flywheel is difficult to replicate once it's started. Professional market makers prioritize platforms with the deepest liquidity, while high-volume traders choose platforms with the lowest slippage. With edgeX surpassing most competitors in terms of liquidity depth (second only to Hyperliquid), it has gained a sustainable competitive advantage.\n\n**Third, why do most people misunderstand this change?**\n\nThe misunderstanding of the edgeX phenomenon stems primarily from three cognitive biases: technological determinism, zero-sum game thinking, and a superficial understanding of the concept of \"revenue monsters.\"\n\nFirst, the technological determinism trap. Many people believe that ZK-rollup is simply a \"faster and cheaper blockchain,\" but this understanding is oversimplified. The true value of ZK technology lies not in performance improvements per se, but in its redefinition of the cost structure of trust. In the traditional performance vs. security trade-off, ZK technology offers a \"third option\": you can achieve both high performance and high security, but only at the expense of higher computational complexity, a complexity that is invisible to users.\n\nJust like nuclear energy is not simply a \"more efficient way to generate electricity,\" but rather, through Einstein's mass-energy equivalence formula, E=mc², it opens up a whole new dimension of energy. Similarly, ZK proofs, through mathematical breakthroughs, enable us to prove the correctness of a computation without revealing specific information, opening up numerous previously impossible application scenarios.\n\nThe second misconception stems from zero-sum game thinking. Many believe that edgeX's success necessarily means the failure of other protocols, and that this is simply a redistribution of the existing pie. However, this view ignores the potential for \"creating new demand.\" When transaction costs are low enough, latency is minimal enough, and risks are manageable enough, many users who previously wouldn't participate in perpetual contracts (such as institutional investors and quantitative funds) will begin to use this market.\n\nJust like Amazon's success wasn't about stealing business from traditional bookstores, but about creating a global online retail market where none existed. EdgeX's success isn't simply about stealing users from other DEXs; by providing an institutional-grade trading experience, it's attracting more traditional finance funds and users into the DeFi ecosystem.\n\nThe most profound misunderstanding lies in a superficial understanding of the concept of \"revenue monster.\" Many people assume that high revenue simply indicates a protocol is \"making money quickly.\" However, in a market rife with speculation and token incentives, real fee revenue reflects something deeper: product-market fit.\n\nWhen users are willing to pay real money for a service, it demonstrates that the service solves a real pain point, not just artificial demand artificially created by token rewards. edgeX does not issue any tokens; all revenue comes from real transaction fees, a rare phenomenon in the DeFi world. This \"high revenue without tokens\" combination is a reflection on and correction of the overuse of token incentives in the current DeFi ecosystem.\n\nFrom a behavioral economics perspective, people often understand \"making money by speculating in cryptocurrencies\" more easily than \"making money by providing services.\" The former aligns with our imagination of \"wealth myths,\" while the latter requires deeper consideration of business logic. Ultimately, however, mature financial markets return to the fundamental business of providing real value.\n\n**Conclusion: When Technological Progress Meets Business Acumen**\n\nFrench mathematician Henri Poincaré once said, \"Science is built of facts, just as a house is built of bricks. But the mere accumulation of facts does not make science, just as the mere accumulation of bricks does not make a house.\" In the story of edgeX, ZK technology is the bricks, traditional financial expertise is the architectural design, and real market demand is the foundation.\n\nThis case reminds us that what truly changes the world is often not a simple technological breakthrough or a simple business model innovation, but the precise combination of technology, expertise, and market demand. The success of edgeX is no accident; it represents the DeFi ecosystem's transition from \"experimental phase\" to \"commercial maturity.\"\n\nPerhaps, when discussing the \"next unicorn,\" we should focus less on flashy concepts and token performance and more on simple questions: What real problems does this protocol solve? Are users willing to pay for it? Does the team have the ability to execute long-term? In this sense, edgeX is not only a successful trading platform but also a key sign of DeFi's maturation.\n\nOf course, any rapidly growing new thing carries risks. ZK technology is still rapidly developing, the regulatory environment is uncertain, and market competition will continue to intensify. But as the old investment adage goes, \"Risk and opportunity always come in pairs.\" For those who can understand the nature of this change, this may be a historic opportunity worth paying attention to.",
  "references": [
    "https://www.panewslab.com/zh/articles/fadeb306-196a-4c08-85c6-911724c1b09b",
    "https://blockchain.news/flashnews/edgex-perp-dex-revenue-surges-2-83-million-dollars-in-7-days-16-percent-of-hyperliquid-outpacing-ethereum-eth-base-solana-sol-and-lido-ldo",
    "https://www.edgex.exchange/en",
    "https://defillama.com/protocol/edgex",
    "https://starkware.co/blog/zk-rollups-explained/zk-rollups-vs-optimistic-rollups/",
    "https://yellow.com/asset/eth/technical-analysis/optimistic-rollups-vs-zk-rollups-the-battle-for-ethereums-layer-2-scaling",
    "https://www.gemini.com/cryptopedia/layer-2-scaling-zk-rollup-optimistic-rollup-ethereum",
    "https://cointelegraph.com/news/hyperliquid-319b-record-defi-perp-dex",
    "https://rankfi.com/perpetual-dexs/",
    "https://dropstab.com/research/alpha/top-perpetual-dex-platforms-for-point-farming"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi.wav",
  "social_hook": "🚀 One-year-old rookie edgeX generates $10.53 million in monthly revenue, crushing GMX and dYdX! How is ZK technology redefining perpetual contracts?...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-24T02:14:19.331Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-17-edgex-zk-revenue-monster-defi/segment072.ts"
    ]
  }
}