{
  "id": "2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution",
  "status": "translated",
  "category": "defi",
  "date": "2025-08-17",
  "language": "en-US",
  "title": "When Wall Street goes blockchain: Why tokenized stocks are a quiet revolution in financial infrastructure",
  "content": "Adam Smith wrote in The Wealth of Nations: \"The division of labor is the most important means of increasing the productive powers of labor.\" Applied to today's financial world, this statement should perhaps be understood this way: when the financial division of labor—transactions, settlements, and custody—becomes too complex and expensive, reintegrating them becomes the best way to improve efficiency. Recently, a quiet revolution has been unfolding in financial infrastructure: the tokenized stock market exploded from 1,600 holding addresses to 90,000 in just one month, reaching a market capitalization of $370 billion. BCG even predicts that the entire real asset tokenization (RWA) market will grow from $600 billion in 2025 to $189 trillion by 2033.\n\nImagine you want to send a package from Taipei to New York. In the traditional postal system, a package must pass through countless hubs: first to the Taipei Post Office, then to Taoyuan Airport, then to Los Angeles, and finally to New York before finally reaching its recipient. Each step takes time, costs money, and is subject to error. But what if, one day, someone invented \"instant delivery\" technology, allowing a package to be delivered directly from your hand to the recipient? All the intermediaries would become redundant, and the entire logistics industry would be restructured.\n\nThis is exactly what tokenized stocks are doing to the traditional stock trading system. When you buy an Apple stock from a traditional brokerage, the transaction goes through multiple stages, including the brokerage, the exchange, a clearing house (such as the DTCC), and a custodian bank, requiring a settlement time of T+1 or even T+2. Tokenized stocks, on the other hand, integrate issuance, trading, and settlement on a single blockchain ledger, enabling near-instant settlement. Why can't we buy stocks directly on Nasdaq?\n\nMany people think, \"I buy stocks on Nasdaq,\" but in reality, you don't place orders directly on Nasdaq, nor do you trade directly with sellers. The entire trading process is incredibly complex, and each intermediary exists to solve a specific problem:\n\n1. Brokers exist because...\nOrdinary investors can't directly connect to an exchange, so they need a \"bridge\" to help them execute orders, receive quotes, and manage their assets.\n\n2. Exchanges (such as Nasdaq) are responsible for matching orders, finding prices, and determining who buys and who sells. However, they do not transfer money, nor do they guarantee that you will actually receive the stock.\n\n3. Clearing houses (such as DTCC) were created because:\nBuyers and sellers do not know or trust each other. What if you buy stock, but the other party defaults on the payment? A clearing house, as a neutral third party, ensures that \"money arrives → stock is transferred,\" guaranteeing that both parties fulfill their obligations. However, the cost is an additional layer of processing and margin requirements, which delays settlement time.\n\n4. Custodian banks/central depositories exist because:\n\nPhysical stocks or paper assets require a \"safe depository\" to store them; otherwise, if the brokerage goes bankrupt, you risk losing your stocks.\n\nIn summary, these intermediaries exist to address trust, coordination, and risk. However, with the advent of digital and blockchain technology, we've begun to wonder: if technology can directly address trust issues, are these intermediaries still necessary?\n\nOn the surface, this appears to be a question of optimizing transaction speed and cost. But the real issue is this: we are witnessing a fundamental restructuring of financial infrastructure, moving from a centralized \"radiating\" model to a decentralized \"peer-to-peer\" network.\n\nFirst, how do traditional securities trading systems typically operate? **\n\nTo understand the significance of this revolution, we must first examine why the traditional system is so complex. The modern securities trading system is the product of centuries of financial evolution, with each component designed to solve specific historical problems.\n\nBrokers originally existed because individual investors could not access exchanges directly. Clearing houses existed because buyers and sellers lacked trust in each other, requiring a neutral third party to guarantee the execution of transactions. Custodian banks existed because physical stock certificates needed to be stored securely. These divisions of labor were reasonable, even necessary, in an era without digital technology.\n\nBut the problem with this system is that each intermediary charges fees, increases delays, and creates new risk points. More importantly, these intermediaries form a complex chain of trust: you need to trust the brokerage, the brokerage needs to trust the clearing house, the clearing house needs to trust the custodian bank, and the custodian bank needs to trust the stock registry. Failure in any one link can paralyze the entire system.\n\nThe 2021 GameStop incident is a prime example. When a large number of retail investors simultaneously bought GameStop shares, the clearing house suddenly demanded massive margin payments from brokerages like Robinhood, forcing these platforms to suspend trading. The problem lies not in the market itself, but in this complex chain of intermediaries, which, in extreme cases, can create systemic risks.\n\nFrom a game theory perspective, each intermediary has an incentive to maximize its own profits, not the efficiency of the entire system. Brokerage firms want clients to trade more to earn fees, clearing houses want longer settlement times to earn interest on funds, and custodian banks want to collect higher custody fees. This misaligned incentives leads to an increasingly complex and expensive system.\n\nSecond, what is the best approach for a tokenized stock system?\n\nTokenized stocks are revolutionary not only in their technology but also in their redesign of the economic structure. They integrate the three core functions of traditional finance—issuance, trading, and settlement—on a single, programmable platform.\n\nTake Solana's vision of a \"Nasdaq on Chain\" as an example. With the Alpenglow upgrade, Solana has reduced block confirmation times to 150 milliseconds, a speed that's already competitive with traditional high-frequency trading systems. More importantly, because all transactions are recorded on the same ledger, buyers and sellers can transact directly without the need for complex intermediary chains.\n\nBut the real innovation lies in composability—something that traditional financial systems simply can't achieve. On the blockchain, tokenized stocks are more than just digital stock certificates; they're \"financial Lego blocks.\" You can use your Apple shares as collateral to get an instant loan, configure smart contracts to automatically reinvest dividends into various assets, and participate in decentralized market making to earn fees. These operations are impossible or extremely difficult in traditional systems.\n\nFrom the perspective of network effects, successful tokenized stock platforms create a powerful positive feedback loop. Liquidity attracts more traders, more traders bring deeper liquidity, deeper liquidity attracts more asset issuers, and more assets attract more developers to build new financial applications. Once this network effect is activated, it creates a \"winner-takes-all\" dynamic.\n\nMore importantly, this system also possesses \"antifragility\"—a concept coined by Nassim Taleb. Traditional financial systems become more fragile under stress (such as the 2008 financial crisis), while decentralized systems theoretically become more resilient under stress. As more people use the network, it becomes more secure and more valuable. **Third, why do most people misunderstand this change?**\n\nThe root of this problem lies in three cognitive biases: status bias, complexity aversion, and a superficial understanding of the concept of \"decentralization.\"\n\nStatus bias leads us to prefer the status quo, even when it's not ideal. While the traditional financial system is inefficient and expensive, it's a \"we know the devil.\" People are accustomed to T+2 settlement, high fees, and brokerage service hours. When someone proposes a radically different alternative, the first reaction is often suspicion and resistance.\n\nComplexity aversion is another issue. Tokenized stocks involve concepts such as blockchain technology, smart contracts, and digital wallets, all of which are unfamiliar to many. By comparison, while the traditional financial system is inherently more complex (think of the complex rules of clearing houses and the layers of formalities required by custodian banks), this complexity is hidden from users. Users simply click a \"buy\" button without having to understand the underlying mechanisms.\n\nThe most dangerous misconception is equating tokenization with speculation. Many people associate the word \"token\" with the price volatility and speculation of cryptocurrencies, overlooking the improvements that underlying technologies have brought to financial infrastructure. This is like the early days of the internet, when people equated online shopping with fraud and failed to see the fundamental improvements e-commerce was bringing to the retail industry.\n\nFrom a behavioral economics perspective, people tend to overestimate short-term risks and underestimate long-term benefits. The short-term risks of tokenized stocks (technological failures, regulatory uncertainty, cyberattacks) are visible and concrete, while the long-term benefits (cost reductions, efficiency gains, new financial products) are abstract and uncertain. This cognitive bias causes most people to miss the true significance of this infrastructural revolution.\n\nThe deeper reason is that our understanding of the financial system often stems from superficial experiences rather than the underlying mechanisms. Just as most people know how to use a cell phone but don't understand how communication networks work, most investors know how to buy and sell stocks but don't understand the mechanics of clearing and settlement systems. When the underlying infrastructure undergoes revolutionary changes, the surface experience may remain largely unchanged, leading people to overlook the significance of the change.\n\n**Conclusion: Finding Wisdom Between Change and Stability**\n\nBritish economist John Maynard Keynes once said, \"The difficulty lies not in accepting new ideas but in discarding old ones.\" In this quiet revolution in financial infrastructure, the real challenge lies not in understanding the advancements of blockchain technology but in recognizing the profound limitations of traditional systems.\n\nTokenized stocks are not about eliminating traditional finance but about reimagining what finance can be. It reminds us that many of the financial \"rules\" we take for granted are, in fact, artifacts of history, not laws of nature. 24/7 trading, instant settlement, programmable assets—none of these are impossible, just not feasible under the old technological paradigm.\n\nAs we stand at this historical inflection point, perhaps the most important thing is not to predict which platform will win the competition or which technology will become the standard, but to remain open-minded and understand the nature of this transformation. After all, the innovations that truly change the world are often not the most flashy, but the improvements that quietly restructure infrastructure and make life simpler and more efficient.\n\nIn this sense, tokenized stocks may not generate the headlines that cryptocurrencies do, but their impact on our daily lives may be even more profound. When one day you discover that you can buy and sell stock in any company in the world in the middle of the night, use your stock as collateral for an instant loan, and participate in complex investment strategies without paying high fees, you will realize that this quiet revolution has changed everything.",
  "references": [
    "https://www.panewslab.com/zh/articles/889bc71c-286f-4424-8d43-67874cd6228b",
    "https://www.panewslab.com/zh/articles/8dcddd3f-44c1-4ef9-b4d7-da8af8457462",
    "https://www.bcg.com/insights/financial-institutions/tokenization-real-world-assets",
    "https://docs.solana.com/developing/programming-model/overview",
    "https://www.kraken.com/features/tokenized-stocks",
    "https://robinhood.com/us/en/about/international/",
    "https://uniswap.org/blog/uniswap-v3-math-primer",
    "https://ethereum.org/en/defi/",
    "https://medium.com/1kxnetwork/blockchain-bridges-5db6f5c84f71",
    "https://research.stlouisfed.org/publications/review/2021/02/05/decentralized-finance-on-blockchain-and-smart-contract-based-financial-markets"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution.wav",
  "social_hook": "📈 Wall Street goes blockchain! Tokenized shares surged from 1,600 addresses to 90,000 in one month, with market capitalization exceeding $370...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-17T00:55:06.374Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-tokenized-stocks-blockchain-infrastructure-revolution/segment074.ts"
    ]
  }
}