{
  "id": "2025-08-08-boros-funding-rate-tokenization-innovation",
  "status": "translated",
  "category": "defi",
  "date": "2025-08-17",
  "language": "en-US",
  "title": "When perpetual contract fees become investment targets: How does Boros turn funding rates into tradable financial Lego?",
  "content": "British economist John Maynard Keynes once said, \"The market can remain irrational longer than you can remain sane.\" Applied to today's cryptocurrency perpetual contracts market, this statement might be understood this way: when market sentiment is extremely euphoric, the \"entry fees\" (funding rates) that bulls are willing to pay can be ridiculously high, and this irrationality can persist for an astonishingly long time. Recently, the Pendle team launched the Boros platform, which does something that sounds crazy but makes sense on closer inspection: it transforms transaction costs, which were once only \"passively incurred,\" into a financial product that can be \"actively invested in.\"\n\nImagine this scenario: Your friend Xiao Wang is a seasoned perpetual contracts trader who opens numerous long positions to chase the market's upward trend every time a bull market emerges. But he was constantly troubled by a hidden cost: funding fees. During peak market conditions, he'd pay short sellers 0.1% or even higher fees every eight hours. Over the course of a month, these fees alone could eat up 20% of his profits. Meanwhile, his friend, Xiao Li, who never trades perpetual contracts, has recently made a killing by collecting the funding fees paid by others. Even more remarkable, Xiao Li doesn't bear any price volatility risk; he simply buys a token called a Yield Unit.\n\nOn the surface, this seems like a question about reducing perpetual contract transaction costs. But the real issue is this: We're witnessing a fundamental shift in DeFi from a \"tool provider\" to a \"risk redistributor.\" Boros isn't just optimizing existing financial instruments; it's creating an entirely new asset class—turning \"risk exposure\" itself into an \"investment target.\"\n\n**First, how do perpetual contract funding rates typically work?**\n\nTo understand Boros's innovation, we must first understand why funding rates exist. Perpetual contracts are essentially a never-ending tug-of-war.\n\nImagine a unique tug-of-war: a red line at the center of a rope represents the spot price (for example, the actual market price of ETH). The position of the rope itself represents the perpetual contract price. On either side—the bulls, believing the price will rise, pull hard toward the \"higher price\"; the bears, believing the price will fall, pull hard toward the \"lower price.\"\n\nThe key to this competition is that the rope (contract price) cannot stray too far from the red line (spot price), otherwise it becomes meaningless. However, market sentiment can make one side too powerful. In a bull market, everyone wants to go long, and the long side is so large that it can easily pull the rope far from the center line. At this point, the referee (the exchange) activates the \"funding rate\" mechanism: the overpowered party (the long side) pays a fee to the opposing party (the short side). The purpose of this fee is to drive some longs out of the market due to high costs, while attracting more shorts, ultimately returning the rope to its equilibrium position.\n\nSpecifically, when the perpetual contract price is consistently higher than the spot price, the funding rate becomes positive. Assuming the current funding rate is 0.1%, then every eight hours, all long position holders are required to pay this fee to short sellers based on the size of their positions. If you hold a long position worth $100,000 in ETH, you'd pay $100 every eight hours, $300 a day, and $9,000 a month. During a bull market, this fee can reach 1% or even higher.\n\nTraditionally, the problem with this mechanism is its passive nature: if you want to go long, you must incur the cost; if you want to earn the fee, you must go short, thereby taking on the risk of a price increase. To fully hedge, you'd have to buy an equivalent amount of the asset in the spot market, a complex and capital-intensive process.\n\nBoros's revolutionary feature is that it allows you to directly \"invest\" in the funding rate itself, without having to participate in the tug-of-war.\n\n**Second, how is Boros' Yield Units a better approach?**\n\nIf traditional funding rate arbitrage is like \"shooting a mosquito with a cannon,\" then Boros is a sophisticated tool designed specifically to catch mosquitoes.\n\nBoros's core innovation lies in \"yield separation and repackaging.\" It performs a similar operation to the \"principal-interest separation\" in the bond market: it decomposes the perpetual contract, a complex asset, into two components—price volatility risk (the principal component) and funding rate income (the interest component), and then allows investors to trade the latter separately.\n\nSpecifically, Boros created a token called Yield Units (YU). Each YU represents the right to receive funding interest from a specific perpetual contract market over a specific timeframe (e.g., 30 days). It's like issuing a \"voucher\" for future cash flows.\n\nFor example, if you purchase a \"30-Day Long Funding Rate YU for ETH Perpetual Contract,\" this means that if the ETH perpetual contract's funding rate is positive (longs pay shorts) over the next 30 days, you'll receive a corresponding return, and the amount of the return directly corresponds to the actual funding rate level. If the funding rate averages 0.1% every 8 hours during this period, you'll earn an annualized return of over 100%.\n\nBut the best part is: you receive this return without any risk from ETH price fluctuations. Whether ETH soars or plummets, as long as someone goes long in the perpetual contract market and pays the funding fee, you get a piece of the action.\n\nThe technical implementation of this design relies on Pendle's yield tokenization infrastructure. Pendle originally specialized in decomposing interest-earning assets (such as stETH) into a principal token (PT) and a yield token (YT). Boros cleverly applies this mechanism to perpetual contract funding rates: it captures funding rates by establishing a delta-neutral position on the underlying perpetual contract platform, then packages this income stream into YU and trades it on Pendle's professional AMM.\n\nFrom an economic perspective, Boros has created a \"pure market sentiment derivative.\" The level of funding rates directly reflects the degree of greed and fear in the market—the more FOMO there is, the higher the fees bulls are willing to pay. Through YU, investors can directly price and bet on how crazy the market will get.\n\nMore importantly, this creates a new \"risk redistribution\" mechanism for the DeFi ecosystem. Longs, who previously had to passively bear the cost of funding rates, can now hedge this cost by purchasing the corresponding YU; while investors with the risk tolerance can profit by assuming this risk. This is a classic Pareto improvement—making all participants better off, and no one worse off.\n\n**Third, why do most people misunderstand this innovation? **\n\nMisconceptions about Boros primarily stem from three cognitive biases: fear of complexity, zero-sum game thinking, and an instinctive aversion to \"financial engineering.\"\n\nThe first is fear of complexity. When hearing terms like \"funding rate tokenization\" and \"return splitting,\" many people's first reaction is, \"What kind of complex financial stunt is this?\" But in reality, Boros's logic is much simpler than traditional funding rate arbitrage. Traditional methods require simultaneous management of multiple variables, such as perpetual contract positions, spot hedging, and funding costs. Boros, on the other hand, requires you to assess a single variable: how intense market sentiment will be in the near future.\n\nThe second misconception stems from zero-sum game thinking. Many people assume that if someone makes money through YU, someone else must lose money—it's simply transferring money from one pocket to the other. However, this idea ignores the potential for value creation through differences in risk appetite. For a large long position holder, thousands of dollars in monthly funding fees might keep them awake at night; but for a risk-neutral arbitrageur, taking on that risk and earning a return could present a perfect investment opportunity. Boros makes this \"risk transfer\" more efficient and transparent.\n\nThe most profound misconception is an instinctive aversion to financial engineering. After the 2008 financial crisis, many people became wary of financial innovations that \"complicate the simple.\" The key, however, is to distinguish between \"pseudo-complexity\" and \"true innovation.\" Pseudo-complexity is the deliberate creation of obscurity to mask risks or extract higher fees; true innovation is a new tool created to solve a real problem. Boros addresses a real pain point: the unpredictable funding costs that perpetual contract traders face daily.\n\nA more subtle misconception is that this innovation is \"detached from the real economy.\" In reality, funding rates themselves reflect the true dynamics of market supply and demand. When a new technological breakthrough or policy announcement emerges, it's often the most responsive investors who first drive up perpetual contract prices. Fluctuations in funding rates are a crucial component of this information price discovery process. Boros makes this process more transparent and efficient. From a behavioral economics perspective, people often understand \"owning assets\" (buying stocks, buying coins) more easily than \"owning cash flows\" (buying bonds, buying income rights). Assets are tangible, while cash flows are abstract. However, mature financial markets precisely enable the precise pricing and trading of abstract risks and returns. Boros is driving DeFi's evolution in this direction.\n\n**Conclusion: When Finance Becomes More Like Lego Bricks**\n\nFrench philosopher Michel Serre once wrote, \"True innovation consists not in inventing something new but in recombining what already exists.\" The story of Boros exemplifies this insight. It didn't invent any radically new concepts, but rather recombined existing DeFi Lego blocks—perpetual contracts, tokenized returns, and automated market makers—to create an unprecedented financial instrument.\n\nThe deeper significance lies in the fact that Boros represents DeFi's shift from \"imitating traditional finance\" to \"native financial innovation.\" Traditional finance, constrained by regulation, infrastructure, and operational complexity, struggles to achieve such refined risk segregation. Blockchain's composability, transparency, and programmability make this innovation possible.\n\nOf course, any financial innovation carries risks. Smart contract vulnerabilities, oracle attacks, and liquidity shortages—these are all risks Boros users need to consider. But as Keynes famously said, \"When the facts change, I change my perspective.\" The facts in DeFi are changing rapidly, and those who can adapt to change and understand innovation often find opportunities within it.\n\nPerhaps the best approach isn't to rush to judge Boros's success or failure, but to maintain curiosity and understand the trends it represents. In an increasingly digital world, the boundaries of finance are being redefined. Today's \"tokenization of funding fees\" may be just the beginning; tomorrow we may see \"tokenization of transaction fees,\" \"tokenization of MEV revenue,\" and even \"tokenization of community governance rights.\"\n\nWhen finance truly becomes as freely combinable as Lego bricks, we may discover that the most valuable elements aren't the bricks themselves, but rather our imagination and ability to combine them. In this sense, Boros teaches us not only how to earn funding fees, but also how to maintain a sharp mind and the courage to innovate in a constantly changing financial world.",
  "references": [
    "https://www.panewslab.com/zh/articles/78j7479hwy95",
    "https://pendle.finance/",
    "https://docs.pendle.finance/",
    "https://medium.com/pendle/introducing-boros-pendles-funding-rate-tokenization-platform-8f3d4c2e8b57",
    "https://ethena.fi/",
    "https://dune.com/pendle/pendle-finance",
    "https://blog.synthetix.io/funding-rate-arbitrage/",
    "https://research.paradigm.xyz/YieldTokens",
    "https://defiprime.com/pendle-finance",
    "https://messari.io/asset/pendle/research",
    "https://tokeninsight.com/en/research/reports/an-in-depth-analysis-of-pendle-finance",
    "https://cointelegraph.com/explained/what-are-perpetual-contracts-and-how-do-they-work"
  ],
  "framework": "萬維鋼風格.md",
  "audio_file": "audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation.wav",
  "social_hook": "Execution error\n\n🎧 Listen: fromfedtochain://audio/2025-08-08-boros-funding-rate-tokenization-innovation\n🌐 Web: https://fromfedtochain.com/audio/2...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-08-17T00:43:08.477Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/defi/2025-08-08-boros-funding-rate-tokenization-innovation/segment072.ts"
    ]
  }
}