{
  "id": "2025-07-15-crypto-startup-survival-guide",
  "status": "translated",
  "category": "startup",
  "date": "2025-07-16",
  "language": "en-US",
  "title": "Crypto Startup Survival Guide: Why 30 Days, Not 3 Years, Is the Key to Success",
  "content": "Have you ever wondered why a business model that takes three years to verify in the traditional technology world must be completed within 30 days in the cryptocurrency world? Or why does the founder of Pump.fun need to send 3,000 Twitter private messages to get attention instead of spending money on advertising like traditional startups? Recently, Lmrank Han, a core contributor to Alliance DAO, shared 20 practical guidelines for crypto entrepreneurship on Solana Breakpoint. These suggestions come from his observation and analysis of hundreds of crypto projects. But behind these superficial \"techniques\" lies the underlying logic that is completely different from traditional entrepreneurship. Why is time compressed in the crypto world? Let us first understand a basic reality: in the cryptocurrency world, time is extremely compressed. Imagine if you opened a traditional restaurant, you had a few months to decorate, train employees, debug the menu, and then slowly accumulate word of mouth. But in the crypto world, thousands of new projects are launched every day, just like thousands of new restaurants are opened every day. In this environment, if you can't prove your value within 30 days, you will be drowned in the noise. Polymarket is a perfect example. When they were the only prediction market platform in the market, it was the best time to innovate. But now that they have verified the feasibility of this model, there are already hundreds of teams in the market doing similar things. This is the cruel reality of the crypto market: the window of opportunity is extremely short. The psychological shift from \"big market\" to \"small problem\" Traditional entrepreneurial advice always tells you to \"aim at the big market.\" Venture capitalists love to hear things like “We’re going to disrupt a market worth hundreds of billions of dollars.” But in the crypto world, this way of thinking is often disastrous. Why? Because the user behavior patterns of cryptocurrencies are completely different. They are not passive consumers, but active participants. They try new protocols, new tools, and new investment strategies every day. For them, solving a small problem that they encounter every day is more attractive than promising to change the entire financial world. For example, high gas fees, complex cross-chain operations, and difficult-to-understand DeFi interfaces—these are specific pain points that crypto users face every day. Solving any of these problems may create a successful product. The magic of 25-50 core users Traditional startups pursue \"viral growth\" - hoping that the product can spread naturally and gain millions of users. But the logic of crypto startups is just the opposite: first find 25-50 core users who really care about your product. This number is not set arbitrarily. The communication mechanism of the crypto community is based on trust and recommendation. If you can get 50 active crypto users to really like your product, they will naturally recommend it to their friends on Twitter, Discord, and Telegram. In the crypto world, a recommendation from an influential KOL is more effective than a million dollars in advertising. Alon of Pump.fun found these core users by sending 3,000 Twitter private messages, which sounds clumsy, but is actually the most effective method. Because he is not looking for ordinary users, but deep users who use similar products every day, understand the technical details, and are willing to give real feedback. The importance of \"DeFi Lego\" thinking In the traditional technology world, \"independent research and development\" is often regarded as a symbol of technical strength. But in the crypto world, this kind of thinking is fatal. A huge advantage of the crypto ecosystem is \"composability\"-you can combine different protocols like building blocks to create new functions. Instead of spending 6 months developing your own AMM (automatic market maker), it is better to use Uniswap or Raydium's ready-made solutions. This is not laziness, but strategic wisdom. First of all, these protocols have undergone millions of dollars in security audits and are much safer than the code you write from scratch. Secondly, they already have liquidity and a user base, and you can leverage these resources immediately. Most importantly, it allows you to focus your limited resources on real innovation. The new logic of resource allocation The logic of resource allocation for traditional startups is: first raise as much money as possible, then quickly expand the team and grab market share. But the logic of crypto startups is completely different. First, the development cost structure of crypto projects is different. A security audit of a smart contract may cost $100,000-200,000, and the salary of a professional blockchain developer is 2-3 times that of an ordinary developer. More importantly, you need to reserve funds for potential security incidents-in the crypto world, a bug may result in millions of dollars in losses. This is why Alliance DAO recommends raising $500,000-1 million in the initial stage, not more. Too much funding will make the team lose the sense of urgency, while too little funding cannot cope with the special needs of crypto projects. The unique challenges of community building In the traditional technology world, the relationship between users and products is a \"consumer-provider\" relationship. But in the crypto world, this relationship is closer to \"co-builder-co-owner\". Users of crypto projects are often investors, promoters, and governance participants at the same time. Not only do they use the product, they also hold the project's tokens and participate in the project's governance decisions. This relationship requires a completely different community management strategy. In a bull market, community building is relatively easy-the rise in token prices will naturally bring attention and participation. But in a bear market, you need a completely different strategy. You need to shift the focus from price to practicality, from speculation to long-term value. You need to convince community members that even if the token price temporarily drops, the project's technological progress and practical application value are still growing. The Art of Balancing Security and Speed This may be the most difficult challenge in crypto entrepreneurship: how to ensure security while maintaining rapid iteration? In traditional software development, the cost of a bug is usually a poor user experience or service interruption. But in the crypto world, the cost of a bug may be a permanent loss of user funds. This creates a seemingly unsolvable contradiction: you need to release quickly to grab the market, but you also need adequate security audits to avoid disasters. The key to solving this contradiction is the \"phased release\" strategy. In the first stage, release an extremely simplified MVP with a single function and minimal code. Conduct a quick security audit and set a strict funding limit. In the second phase, after verifying the core concept, expand the functionality and conduct a more comprehensive security audit. This approach allows you to quickly verify market demand while keeping potential security risks within an affordable range. Strategic considerations for token economics In traditional startups, the equity structure is relatively simple: founders, employees, investors. But in crypto startups, you also need to consider the distribution and governance mechanisms of tokens. A poorly designed token economics can ruin the entire project. If tokens are too concentrated in the hands of a few people, it will affect the decentralization of governance. If the inflation rate of tokens is too high, it will dilute the value of holders. If tokens have no actual use scenarios, they will become a purely speculative tool. More complicated is that the distribution of tokens will affect the long-term development of the project. You need to allocate tokens for team incentives, community rewards, ecosystem development, market promotion and other aspects. This requires clear planning and a deep understanding of the long-term development of the project. Opportunities and challenges of internationalization Crypto projects are inherently global, which is both an opportunity and a challenge. The opportunity is that you can target the global market from day one. A DeFi protocol developed in the United States may find its largest user base in Asia or Europe. Geographical boundaries have become relatively blurred in the crypto world. But the challenges are also unprecedented. Different countries have huge differences in their regulatory attitudes towards cryptocurrencies. A token issuance method that is legal in the United States may be regarded as an illegal security in Europe. You need to consider these regulatory differences at the beginning of your project design and develop corresponding compliance strategies. The uniqueness of failure modes The failure modes of crypto startups are completely different from those of traditional startups. The failure of traditional startups is usually gradual - user loss, declining revenue, and running out of funds. But the failure of crypto startups can be catastrophic - a smart contract vulnerability can lead to the complete collapse of a project in minutes. A more subtle failure mode is the \"token death spiral.\" When the price of a token falls, stakers may sell in large quantities, further pushing the price down. This positive feedback loop can quickly destroy the economic model of a project. Another failure mode is the \"governance attack.\" Malicious actors may manipulate governance votes and change protocol rules for their own benefit by purchasing large amounts of tokens. This attack is impossible in traditional companies, but it is a real threat in decentralized protocols. A New Definition of Success In the crypto world, the definition of success is also changing. The success indicators of traditional startups are the number of users, revenue, and valuation. But the success indicators of crypto projects may be TVL (total locked value), the degree of decentralization of token distribution, governance participation rate, or the actual use of the protocol. More importantly, the success of crypto projects is often not a zero-sum game. A successful DeFi protocol may promote the development of the entire ecosystem and create opportunities for other projects. This network effect is a unique feature of the crypto world. Practical advice for entrepreneurs Based on these insights, practical advice for crypto entrepreneurs is: 1. Redefine MVP: Your minimum viable product should be a \"minimum viable protocol integration\" rather than a brand new invention from scratch. 2. Invest in community, not marketing: Instead of spending money on advertising, invest in community building tools, incentive mechanisms, and the cultivation of long-term participants. 3. Prioritize security, but don't over-engineer: Use proven protocols, but don't delay release timing in pursuit of perfection. 4. Be prepared to deal with volatility: Volatility in the crypto market is inevitable. Both your business model and team mentality need to be prepared for this. 5. Maintain a learning mindset: The crypto world changes very quickly, and yesterday's best practices may be outdated today. Keep an open mind and continue to learn about new technologies and market dynamics. Conclusion: New Rules for a New World Crypto entrepreneurship is not a digital version of traditional entrepreneurship, but a completely different game with its own rules, risks, and opportunities. In this new world, speed is more important than scale, community is more important than users, and portfolio is more important than invention. Successful crypto entrepreneurs are not those who can replicate traditional business models, but those who can understand and exploit the unique characteristics of the crypto world. The 30-day time limit is not an obstacle, but an opportunity. It forces you to focus on what is really important, forces you to quickly verify hypotheses, and forces you to establish a direct connection with users. In a world where new projects are born every day, the only rule of survival is to find and solve real problems faster than others. And those who master this rule will find their place in this exciting new world. As you prepare to enter the world of crypto entrepreneurship, remember: you are not building a company, you are building a community. You are not developing a product, you are creating a protocol. You are not pursuing profits, you are building the future. In this future, the most successful projects are not those that raise the most funds, but those that create the most value for users. And the key to creating value lies in these 20 seemingly simple suggestions.",
  "references": [
    "https://www.panewslab.com/zh/articles/w6x0lm7e21h1",
    "https://twitter.com/lmrankhan",
    "https://www.alliancedao.com/",
    "https://solana.com/breakpoint",
    "https://pump.fun/",
    "https://polymarket.com/",
    "https://uniswap.org/",
    "https://raydium.io/",
    "https://immunefi.com/",
    "https://sherlock.xyz/",
    "https://docs.chain.link/",
    "https://compound.finance/",
    "https://aave.com/",
    "https://ethereum.org/en/developers/docs/smart-contracts/security/",
    "https://consensys.net/diligence/",
    "https://www.trailofbits.com/",
    "https://blog.openzeppelin.com/",
    "https://defillama.com/",
    "https://coinmarketcap.com/alexandria/",
    "https://messari.io/research"
  ],
  "audio_file": "audio/en-US/startup/2025-07-15-crypto-startup-survival-guide.wav",
  "social_hook": "💡 Shocking discovery: Time in the crypto world is compressed! 30 days vs 3 years, why did Pump.fun send 3,000 Twitter messages instead of spending...",
  "feedback": {
    "content_review": null
  },
  "updated_at": "2025-07-19T01:30:09.772Z",
  "streaming_urls": {
    "m3u8": "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/playlist.m3u8",
    "segments": [
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment000.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment001.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment002.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment003.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment004.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment005.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment006.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment007.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment008.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment009.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment010.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment011.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment012.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment013.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment014.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment015.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment016.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment017.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment018.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment019.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment020.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment021.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment022.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment023.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment024.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment025.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment026.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment027.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment028.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment029.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment030.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment031.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment032.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment033.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment034.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment035.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment036.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment037.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment038.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment039.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment040.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment041.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment042.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment043.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment044.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment045.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment046.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment047.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment048.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment049.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment050.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment051.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment052.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment053.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment054.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment055.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment056.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment057.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment058.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment059.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment060.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment061.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment062.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment063.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment064.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment065.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment066.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment067.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment068.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment069.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment070.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment071.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment072.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment073.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment074.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment075.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment076.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment077.ts",
      "https://fromfedtochain.1352ed9cb1e236fe232f67ff3a8e9850.r2.cloudflarestorage.com/audio/en-US/startup/2025-07-15-crypto-startup-survival-guide/segment078.ts"
    ]
  }
}