 {
    "id": "2025-11-14-eth-fusaka-interop-8021",
    "status": "draft",
    "category": "ethereum",
    "date": "2025-11-14",
    "language": "zh-TW",
    "title": "解析以太坊大改革：Fusaka、Interop 與 ERC-8021 的共同命題",
    "content": "歡迎收聽 From Fed to Chain，一個帶你從傳統金融的舊世界，穿越到加密宇宙新大陸的節目。\n---\n各位朋友你好。\n今天，我們不聊單一的某個項目，我想帶你拉高一個視角，看一幅更宏大的藍圖。這是一個關於「數位國家」建設的故事。這個國家的名字，就叫做「以太坊」。\n你可能會覺得奇怪，以太坊不是一條公鏈嗎？怎麼會是一個國家呢？\n我跟你說，在過去，它的確更像一個「城市」，一個極度繁榮，但同時也極度擁擠、生活成本極高的「數位首都」。因為太貴太堵，人們開始搬到周邊去，建立起一個個「衛星城」，比如Arbitrum、Optimism、ZKsync等等。這些，就是我們常說的Layer 2。\n但很快，新的問題就出現了。這些衛星城，彼此之間就像是老死不相往來的獨立城邦。你在A城存的錢，沒辦法直接到B城去消費。你要去B城，還得辦理一套複雜的「簽證和換匯」手續，也就是我們說的「跨鏈橋」。整個體驗非常割裂，非常痛苦。\n更重要的是，在這些衛星城裡開店的商家，也就是那些開發者們，他們發現自己很難賺到錢。除了少數能發行自己「股票」（也就是代幣）的明星項目，大部分開發者，就像是在一個免費的美食廣場裡開店，無論你多努力，都只能賺點辛苦錢，卻無法分享到整個廣場人流爆滿所帶來的紅利。\n於是，人才開始流失，開發者開始考慮，要不要乾脆自己出去，也建一個新的國家。\n以太坊的「中央政府」，也就是以太坊基金會和Vitalik他們，顯然也看到了這個巨大的危機。於是，一場自上而下、規模宏大的「國家級改革」就此拉開序幕。\n這場改革的核心思想，不再是把首都建得更高，而是要**將所有獨立的衛星城，整合成一個統一、繁榮、高效的「數位聯邦」**。\n為了實現這個目標，他們祭出了三張王牌。\n第一張王牌，叫做**「全國高鐵網」計畫**，對應的，就是即將到來的「Fusaka」升級，以及其中的核心技術「PeerDAS」。\n這個計畫要解決的問題很簡單：讓衛星城之間的「運輸成本」變得極其便宜。過去，L2要把交易數據打包傳回以太坊主網，成本很高，這也是為什麼我們在L2上交易，依然要付Gas費。\n而PeerDAS這個技術，就像是發明了一種全新的、超高效的數據壓縮和驗證方法。我來給你打個比方，你就懂了。\n想像一下，聯邦政府需要確保每一座衛星城，都擁有國家圖書館裡所有書籍的完整備份。過去的方法是，要求每個城市的圖書館，都派人來把每一本書從頭到尾抄一遍，這太耗費人力物力了。\n而PeerDAS的做法是怎樣的呢？它說，我們現在用一種「魔法墨水」來印刷書籍，這種墨水有個特性，只要你擁有書中任意20%的頁面，就能完整地還原出整本書。\n然後，它對全國的圖書館員（也就是節點）說：「你們現在不用抄寫全書了。每個人，只需要隨機抽取書中的幾頁，檢查一下這幾頁在不在、有沒有錯字，然後在網路上吼一嗓子，告訴大家你檢查的結果就行。」\n因為每個圖書館員抽查的頁面都不同，當有足夠多的人都吼了嗓子，說自己抽查的那幾頁沒問題時，整個網路就有了極高的數學信心，可以確定，整本書是完整無缺的。\n你看，每個人的工作量都大大減少了，但整個系統的安全性卻沒有降低。這就是PeerDAS的魔力。它預計能讓L2的數據儲存成本，降低8倍甚至更多。這意味著，我們在L2上的交易手續費，未來可能會便宜到幾乎可以忽略不計。這條「國家高鐵網」，將會變得暢通無阻。\n好，修好了路，我們現在來聊聊第二張王牌，也是這次我們要深入挖掘的重點。它叫做**「聯邦護照與意圖驅動的自由貿易」**，對應的，就是以太坊正在大力推動的「Interop」，也就是互操作性。\n過去我們把它比作「聯邦護照」，但這個比喻還不夠精準。它不僅僅是一本護照，它更像是一套**「超級智能的全球旅行社系統」**，而這背後的核心思想，是一種叫做「意圖（Intents）」的革命性概念。\n我跟你說，這可能是未來幾年，改變我們使用區塊鏈方式的最重要的思想轉變。\n什麼是「意圖」呢？我給你對比一下你就明白了。\n過去，我們跟區塊鏈互動的方式，叫做「指令式（Imperative）」。就像是你對一個機器人下達一步一步的命令：「第一步，把100塊錢從A銀行的活期轉到定期；第二步，去B銀行的App，用你的定期存單做抵押；第三步，借出80塊錢的日圓；第四步，把這80塊日圓，換成歐元。」你看，你必須精確地告訴它每一步怎麼做，錯一步都不行。這就是我們現在使用DeFi的現狀，非常複雜，非常反人性。\n而「意圖驅動（Intent-centric）」的方式是怎樣的呢？你只需要對你的智能錢包說一句話，也就是你的「意圖」：「**我想要用我在A銀行的100塊錢，去B銀行，以最便宜、最快的方式，換到盡可能多的歐元。**」\n你下達了這個「意圖」之後，就不需要再管任何事了。\n這時，一個全新的角色就登場了，他們叫做「解決者（Solvers）」。你可以把他們想像成一群搶單的、專業的「超級旅行代理」。他們看到你的意圖後，會立刻開始在背後瘋狂地計算和競爭，尋找能滿足你這個意圖的最佳路徑。\n有的代理可能會發現，先把錢換成C貨幣，再換成歐元最划算；有的代理可能會發現，通過某個特定的橋樑，速度最快。他們會把自己的「解決方案」和報價，提交給你的錢包。你的錢包會自動選擇那個對你最有利的方案，然後授權給那個代理去執行。\n整個過程，對你來說，就是提出一個意圖，然後點一次確認。中間所有的複雜步驟，都由背後這個競爭性的「解決者市場」幫你完成了。\n這就是以太坊互操作性的終極夢想。而為了實現這個夢想，以太坊基金會正在推動幾個關鍵的基礎設施，也就是您提到的那些ERC標準和框架：\n第一個，叫做**開放意圖框架（Open Intents Framework, OIF）**。這就像是聯通所有旅行社的「標準化訂單格式」。它定義了一種通用的語言，讓用戶可以清楚地表達自己的意圖，也讓所有的「解決者」都能看懂訂單，前來競標。\n第二個，叫做**以太坊互操作層（Ethereum Interoperability Layer, EIL）**。這可以理解為「全球外交與清算系統」。它為所有L2衛星城之間，提供了一個官方的、安全的通信渠道，確保當一個「解決者」跨城邦執行任務時，資產的轉移和消息的確認，都是安全可靠的，不會被欺騙或偽造。\n讓我們用一個具體的DeFi場景，來感受一下這前後的天壤之別。\n假設，用戶Sarah在Arbitrum這座城市裡，有100個USDC。她聽說，最近ZKsync那座城市裡，新開的一個流動性挖礦項目，年化收益率高達30%，她非常心動。\n在過去，也就是**「噩夢模式」**下，Sarah需要做什麼呢？\n她得先打開一個叫做「跨鏈橋」的網站，把她的錢包從Arbitrum網路，切換過去。然後，她要先授權（Approve）這個網站使用她的USDC，再執行一筆跨鏈交易，把這100塊錢發送到ZKsync。這個過程，她可能要付兩次Gas費，然後緊張地等待10到20分鐘，同時不斷祈禱這個橋千萬不要出問題。等錢終於到賬了，她再把錢包切換到ZKsync網路，找到那個DeFi項目，再進行授權、質押。一套操作下來，七八個步驟，半個小時過去了，身心俱疲。\n而在未來，也就是**「夢想模式」**下，會是怎樣的呢？\nSarah直接打開那個在ZKsync上的DeFi項目。她看到輸入框，直接輸入「100」。這時，她的錢包會彈出一個神奇的提示：「偵測到您在Arbitrum上有足夠的USDC。一位『解決者』已為您找到最佳路徑，預計總花費0.5美元，是否執行？」\nSarah要做的，只有一件事：點擊「確認」。\n就這麼簡單。在她點擊確認的那一刻，背後那個最優的「解決者」，已經開始瘋狂工作，它可能在幾秒鐘內，就完成了跨鏈、兌換、質押等一系列複雜操作。對Sarah來說，她感覺到的，就只是她的100塊錢，瞬間就出現在了ZKsync的礦池裡，開始為她賺取收益。\n你看，這種體驗的差別，是天翻地覆的。它將徹底拆除L2之間的圍牆，讓整個以太坊生態，真正感覺像一個統一的、無縫的「大都會」。這才是通往大規模採用的「最後一公里」。\n路通了，貿易也自由了，但要讓國家真正繁榮，還需要第三張，也是我認為最精彩的一張王牌。它叫做**「小微企業稅收返還計畫」**，對應的，就是一個叫做「ERC-8021」的提案，也被人們稱為「Builder Codes」。\n這個計畫，旨在解決那個最根本的問題：如何讓開發者賺到錢？\n過去，開發者就像在一個大商場裡開店的商家。商場人氣很旺，但商家只能靠賣自己的商品賺錢，商場本身賺到的租金和管理費，跟商家一點關係都沒有。\n而ERC-8021想做什麼呢？它想對商場的規則，進行一個根本性的改變。\n我來給你講個真實的案例。在以太坊上，有一個叫做Hyperliquid的衍生品交易平台，它就像一個生意火爆的大商場。然後，另一個應用Phantom，一個錢包應用，它做了一個很酷的功能，讓用戶可以直接在Phantom錢包裡，很方便地使用Hyperliquid進行交易。\nHyperliquid的「Builder Codes」機制，就會自動識別出，這些交易是通過Phantom這個「管道」引流過來的。於是，Hyperliquid會把這些交易產生手續費的一部分，自動分潤給Phantom。結果是，Phantom在短短幾個月內，就靠這個機制，賺了超過500萬美元！\n這就是「羅布樂思（Roblox）模型」的魔力。你不再需要自己去建一個大商場，你可以在一個已有的、人氣很旺的商場裡，開一家能提供獨特價值的「精品店」或「導購服務」，只要你帶來的生意夠多，你就能直接從商場的總收入裡分一杯羹。\nERC-8021這個提案，就是想把這種「分潤機制」，變成以太坊國家法律的一部分，讓它成為一個所有L2、所有應用都可以遵循的標準。\n你想想看，這對開發者的激勵有多大！他們不再需要削尖腦袋去想怎麼發一個幣、怎麼融資，他們可以專注於做出用戶真正喜歡的產品，然後通過為整個生態帶來價值，來直接賺錢。這套「稅收返還」計畫，將會是留住人才、激發創新的最強引擎。\n所以，當我們把這三張王牌放在一起看的時候，一幅清晰的「建國藍圖」就出現了。\n以太坊正在透過「Fusaka」和「PeerDAS」這條國家高鐵網，讓所有衛星城之間的交通成本降到最低；然後，透過「意圖驅動」的互操作性這個聯邦護照系統，讓所有公民可以無縫地在各個城市之間穿梭和消費；最後，再透過「ERC-8021」這套小微企業稅收返還計畫，讓每一個在聯邦內努力創業的公民，都能分享到國家發展的紅利。\n這是一個從混亂的城邦時代，走向統一的聯邦時代的偉大故事。它不再僅僅是關於技術的升級，更是關於經濟模型、社會協作和價值分配的深刻變革。\n當然，這場改革的難度是巨大的，充滿了挑戰。但它所展現出的雄心和遠見，讓我們看到了以太坊，這個「數位國家」，想要成為未來數位世界真正核心基礎設施的決心。\n感謝收聽這一期的 From Fed to Chain，我們下次再見。",
    "references": [
      "https://www.panewslab.com/zh/articles/5030306a-3995-4ed7-bee2-0b90cb4e6130",
      "https://notes.ethereum.org/@niard/KohakuRoadmap",
      "https://twitter.com/ncsgy/status/1844014257166524888",
      "https://github.com/ethereum/kohaku",
      "https://github.com/ethereum/kohaku-extension",
      "https://github.com/a16z/helios",
      "https://github.com/railgun-privacy",
      "https://github.com/AmbireTech/extension",
      "https://www.obliviouslabs.com/",
      "https://ethereum.org/en/developers/docs/scaling/zk-rollups/",
      "https://vitalik.ca/general/2022/06/15/using_snarks.html"
    ],
    "framework": "解讀分析式風格.md",
    "knowledge_concepts_used": [
      "end-to-end-privacy",
      "zero-knowledge-proofs",
      "privacy-pools",
      "trust-minimization",
      "light-client-verification",
      "regulatory-compliance-privacy",
      "network-effect",
      "wallet-security"
    ],
    "audio_file": null,
    "social_hook": null,
    "feedback": {
      "content_review": null
    },
    "updated_at": "2025-10-20T10:00:00.000Z"
  }
  